cepawiel/OpenGDEMU/CPU/submodules/microchip-asf/thirdparty/wireless/addons/boot/bootloader/cortexm0+/include/atsamr30.h
/*
// 0x41004000 NVMCTRL

#define NVMCTRL_CTRLA	MMIO_REG(0x41004000, uint16_t)
#define NVMCTRL_CTRLA_CMD(x)	((x) << 0)
#define NVMCTRL_CTRLA_CMD_MSK	0x0000007f
#define NVMCTRL_CTRLA_CMD_VAL(x)	(((x) >> 0) & 0x7f)
#define NVMCTRL_CTRLA_CMDEX(x)	((x) << 8)
#define NVMCTRL_CTRLA_CMDEX_MSK	0x0000ff00
#define NVMCTRL_CTRLA_CMDEX_VAL(x)	(((x) >> 8) & 0xff)

#define NVMCTRL_CTRLA_s    MMIO_REG(0x41004000, struct __struct_NVMCTRL_CTRLA)
struct __struct_NVMCTRL_CTRLA
{
  uint16_t cmd : 7;
  uint16_t  : 1;
  uint16_t cmdex : 8;
};

#define NVMCTRL_CTRLB	MMIO_REG(0x41004004, uint32_t)
#define NVMCTRL_CTRLB_RWS(x)	((x) << 1)
#define NVMCTRL_CTRLB_RWS_MSK	0x0000001e
#define NVMCTRL_CTRLB_RWS_VAL(x)	(((x) >> 1) & 0xf)
#define NVMCTRL_CTRLB_MANW	(1 << 7)
#define NVMCTRL_CTRLB_SLEEPPRM(x)	((x) << 8)
#define NVMCTRL_CTRLB_SLEEPPRM_MSK	0x00000300
#define NVMCTRL_CTRLB_SLEEPPRM_VAL(x)	(((x) >> 8) & 0x3)
#define NVMCTRL_CTRLB_READMODE(x)	((x) << 16)
#define NVMCTRL_CTRLB_READMODE_MSK	0x00030000
#define NVMCTRL_CTRLB_READMODE_VAL(x)	(((x) >> 16) & 0x3)
#define NVMCTRL_CTRLB_CACHEDIS	(1 << 18)

#define NVMCTRL_CTRLB_s    MMIO_REG(0x41004004, struct __struct_NVMCTRL_CTRLB)
struct __struct_NVMCTRL_CTRLB
{
  uint32_t  : 1;
  uint32_t rws : 4;
  uint32_t  : 2;
  uint32_t manw : 1;
  uint32_t sleepprm : 2;
  uint32_t  : 6;
  uint32_t readmode : 2;
  uint32_t cachedis : 1;
  uint32_t  : 13;
};

#define NVMCTRL_PARAM	MMIO_REG(0x41004008, uint32_t)
#define NVMCTRL_PARAM_NVMP(x)	((x) << 0)
#define NVMCTRL_PARAM_NVMP_MSK	0x0000ffff
#define NVMCTRL_PARAM_NVMP_VAL(x)	(((x) >> 0) & 0xffff)
#define NVMCTRL_PARAM_PSZ(x)	((x) << 16)
#define NVMCTRL_PARAM_PSZ_MSK	0x00070000
#define NVMCTRL_PARAM_PSZ_VAL(x)	(((x) >> 16) & 0x7)

#define NVMCTRL_PARAM_s    MMIO_REG(0x41004008, struct __struct_NVMCTRL_PARAM)
struct __struct_NVMCTRL_PARAM
{
  uint32_t nvmp : 16;
  uint32_t psz : 3;
  uint32_t  : 13;
};

#define NVMCTRL_INTENCLR	MMIO_REG(0x4100400c, uint8_t)
#define NVMCTRL_INTENCLR_READY	(1 << 0)
#define NVMCTRL_INTENCLR_ERROR	(1 << 1)

#define NVMCTRL_INTENCLR_s    MMIO_REG(0x4100400c, struct __struct_NVMCTRL_INTENCLR)
struct __struct_NVMCTRL_INTENCLR
{
  uint8_t ready : 1;
  uint8_t error : 1;
  uint8_t  : 6;
};

#define NVMCTRL_INTENSET	MMIO_REG(0x41004010, uint8_t)
#define NVMCTRL_INTENSET_READY	(1 << 0)
#define NVMCTRL_INTENSET_ERROR	(1 << 1)

#define NVMCTRL_INTENSET_s    MMIO_REG(0x41004010, struct __struct_NVMCTRL_INTENSET)
struct __struct_NVMCTRL_INTENSET
{
  uint8_t ready : 1;
  uint8_t error : 1;
  uint8_t  : 6;
};

#define NVMCTRL_INTFLAG	MMIO_REG(0x41004014, uint8_t)
#define NVMCTRL_INTFLAG_READY	(1 << 0)
#define NVMCTRL_INTFLAG_ERROR	(1 << 1)

#define NVMCTRL_INTFLAG_s    MMIO_REG(0x41004014, struct __struct_NVMCTRL_INTFLAG)
struct __struct_NVMCTRL_INTFLAG
{
  uint8_t ready : 1;
  uint8_t error : 1;
  uint8_t  : 6;
};

#define NVMCTRL_STATUS	MMIO_REG(0x41004018, uint16_t)
#define NVMCTRL_STATUS_PRM	(1 << 0)
#define NVMCTRL_STATUS_LOAD	(1 << 1)
#define NVMCTRL_STATUS_PROGE	(1 << 2)
#define NVMCTRL_STATUS_LOCKE	(1 << 3)
#define NVMCTRL_STATUS_NVME	(1 << 4)
#define NVMCTRL_STATUS_SB	(1 << 8)

#define NVMCTRL_STATUS_s    MMIO_REG(0x41004018, struct __struct_NVMCTRL_STATUS)
struct __struct_NVMCTRL_STATUS
{
  uint16_t prm : 1;
  uint16_t load : 1;
  uint16_t proge : 1;
  uint16_t locke : 1;
  uint16_t nvme : 1;
  uint16_t  : 3;
  uint16_t sb : 1;
  uint16_t  : 7;
};

#define NVMCTRL_ADDR	MMIO_REG(0x4100401c, uint32_t)
#define NVMCTRL_ADDR_ADDR(x)	((x) << 0)
#define NVMCTRL_ADDR_ADDR_MSK	0x003fffff
#define NVMCTRL_ADDR_ADDR_VAL(x)	(((x) >> 0) & 0x3fffff)

#define NVMCTRL_ADDR_s    MMIO_REG(0x4100401c, struct __struct_NVMCTRL_ADDR)
struct __struct_NVMCTRL_ADDR
{
  uint32_t addr : 22;
  uint32_t  : 10;
};

#define NVMCTRL_LOCK	MMIO_REG(0x41004020, uint16_t)
#define NVMCTRL_LOCK_LOCK(x)	((x) << 0)
#define NVMCTRL_LOCK_LOCK_MSK	0x0000ffff
#define NVMCTRL_LOCK_LOCK_VAL(x)	(((x) >> 0) & 0xffff)

#define NVMCTRL_LOCK_s    MMIO_REG(0x41004020, struct __struct_NVMCTRL_LOCK)
struct __struct_NVMCTRL_LOCK
{
  uint16_t lock : 16;
};
*/
// 0x40002800 PORTA

#define PORTA_DIR	MMIO_REG(0x40002800, int32_t)
#define PORTA_DIR_P0	(1 << 0)
#define PORTA_DIR_P1	(1 << 1)
#define PORTA_DIR_P2	(1 << 2)
#define PORTA_DIR_P3	(1 << 3)
#define PORTA_DIR_P4	(1 << 4)
#define PORTA_DIR_P5	(1 << 5)
#define PORTA_DIR_P6	(1 << 6)
#define PORTA_DIR_P7	(1 << 7)
#define PORTA_DIR_P8	(1 << 8)
#define PORTA_DIR_P9	(1 << 9)
#define PORTA_DIR_P10	(1 << 10)
#define PORTA_DIR_P11	(1 << 11)
#define PORTA_DIR_P12	(1 << 12)
#define PORTA_DIR_P13	(1 << 13)
#define PORTA_DIR_P14	(1 << 14)
#define PORTA_DIR_P15	(1 << 15)
#define PORTA_DIR_P16	(1 << 16)
#define PORTA_DIR_P17	(1 << 17)
#define PORTA_DIR_P18	(1 << 18)
#define PORTA_DIR_P19	(1 << 19)
#define PORTA_DIR_P20	(1 << 20)
#define PORTA_DIR_P21	(1 << 21)
#define PORTA_DIR_P22	(1 << 22)
#define PORTA_DIR_P23	(1 << 23)
#define PORTA_DIR_P24	(1 << 24)
#define PORTA_DIR_P25	(1 << 25)
#define PORTA_DIR_P26	(1 << 26)
#define PORTA_DIR_P27	(1 << 27)
#define PORTA_DIR_P28	(1 << 28)
#define PORTA_DIR_P29	(1 << 29)
#define PORTA_DIR_P30	(1 << 30)
#define PORTA_DIR_P31	(1 << 31)

#define PORTA_DIR_s    MMIO_REG(0x40002800, struct __struct_PORTA_DIR)
struct __struct_PORTA_DIR
{
  uint32_t p0 : 1;
  uint32_t p1 : 1;
  uint32_t p2 : 1;
  uint32_t p3 : 1;
  uint32_t p4 : 1;
  uint32_t p5 : 1;
  uint32_t p6 : 1;
  uint32_t p7 : 1;
  uint32_t p8 : 1;
  uint32_t p9 : 1;
  uint32_t p10 : 1;
  uint32_t p11 : 1;
  uint32_t p12 : 1;
  uint32_t p13 : 1;
  uint32_t p14 : 1;
  uint32_t p15 : 1;
  uint32_t p16 : 1;
  uint32_t p17 : 1;
  uint32_t p18 : 1;
  uint32_t p19 : 1;
  uint32_t p20 : 1;
  uint32_t p21 : 1;
  uint32_t p22 : 1;
  uint32_t p23 : 1;
  uint32_t p24 : 1;
  uint32_t p25 : 1;
  uint32_t p26 : 1;
  uint32_t p27 : 1;
  uint32_t p28 : 1;
  uint32_t p29 : 1;
  uint32_t p30 : 1;
  uint32_t p31 : 1;
};

#define PORTA_DIRCLR	MMIO_REG(0x40002804, int32_t)
#define PORTA_DIRCLR_P0	(1 << 0)
#define PORTA_DIRCLR_P1	(1 << 1)
#define PORTA_DIRCLR_P2	(1 << 2)
#define PORTA_DIRCLR_P3	(1 << 3)
#define PORTA_DIRCLR_P4	(1 << 4)
#define PORTA_DIRCLR_P5	(1 << 5)
#define PORTA_DIRCLR_P6	(1 << 6)
#define PORTA_DIRCLR_P7	(1 << 7)
#define PORTA_DIRCLR_P8	(1 << 8)
#define PORTA_DIRCLR_P9	(1 << 9)
#define PORTA_DIRCLR_P10	(1 << 10)
#define PORTA_DIRCLR_P11	(1 << 11)
#define PORTA_DIRCLR_P12	(1 << 12)
#define PORTA_DIRCLR_P13	(1 << 13)
#define PORTA_DIRCLR_P14	(1 << 14)
#define PORTA_DIRCLR_P15	(1 << 15)
#define PORTA_DIRCLR_P16	(1 << 16)
#define PORTA_DIRCLR_P17	(1 << 17)
#define PORTA_DIRCLR_P18	(1 << 18)
#define PORTA_DIRCLR_P19	(1 << 19)
#define PORTA_DIRCLR_P20	(1 << 20)
#define PORTA_DIRCLR_P21	(1 << 21)
#define PORTA_DIRCLR_P22	(1 << 22)
#define PORTA_DIRCLR_P23	(1 << 23)
#define PORTA_DIRCLR_P24	(1 << 24)
#define PORTA_DIRCLR_P25	(1 << 25)
#define PORTA_DIRCLR_P26	(1 << 26)
#define PORTA_DIRCLR_P27	(1 << 27)
#define PORTA_DIRCLR_P28	(1 << 28)
#define PORTA_DIRCLR_P29	(1 << 29)
#define PORTA_DIRCLR_P30	(1 << 30)
#define PORTA_DIRCLR_P31	(1 << 31)

#define PORTA_DIRCLR_s    MMIO_REG(0x40002804, struct __struct_PORTA_DIRCLR)
struct __struct_PORTA_DIRCLR
{
  uint32_t p0 : 1;
  uint32_t p1 : 1;
  uint32_t p2 : 1;
  uint32_t p3 : 1;
  uint32_t p4 : 1;
  uint32_t p5 : 1;
  uint32_t p6 : 1;
  uint32_t p7 : 1;
  uint32_t p8 : 1;
  uint32_t p9 : 1;
  uint32_t p10 : 1;
  uint32_t p11 : 1;
  uint32_t p12 : 1;
  uint32_t p13 : 1;
  uint32_t p14 : 1;
  uint32_t p15 : 1;
  uint32_t p16 : 1;
  uint32_t p17 : 1;
  uint32_t p18 : 1;
  uint32_t p19 : 1;
  uint32_t p20 : 1;
  uint32_t p21 : 1;
  uint32_t p22 : 1;
  uint32_t p23 : 1;
  uint32_t p24 : 1;
  uint32_t p25 : 1;
  uint32_t p26 : 1;
  uint32_t p27 : 1;
  uint32_t p28 : 1;
  uint32_t p29 : 1;
  uint32_t p30 : 1;
  uint32_t p31 : 1;
};

