cepawiel/OpenGDEMU/CPU/submodules/microchip-asf/thirdparty/wireless/addons/boot/bootloader/cortexm0+/include/atsamr30.h
#define PORTA_DIRSET	MMIO_REG(0x40002808, int32_t)
#define PORTA_DIRSET_P0	(1 << 0)
#define PORTA_DIRSET_P1	(1 << 1)
#define PORTA_DIRSET_P2	(1 << 2)
#define PORTA_DIRSET_P3	(1 << 3)
#define PORTA_DIRSET_P4	(1 << 4)
#define PORTA_DIRSET_P5	(1 << 5)
#define PORTA_DIRSET_P6	(1 << 6)
#define PORTA_DIRSET_P7	(1 << 7)
#define PORTA_DIRSET_P8	(1 << 8)
#define PORTA_DIRSET_P9	(1 << 9)
#define PORTA_DIRSET_P10	(1 << 10)
#define PORTA_DIRSET_P11	(1 << 11)
#define PORTA_DIRSET_P12	(1 << 12)
#define PORTA_DIRSET_P13	(1 << 13)
#define PORTA_DIRSET_P14	(1 << 14)
#define PORTA_DIRSET_P15	(1 << 15)
#define PORTA_DIRSET_P16	(1 << 16)
#define PORTA_DIRSET_P17	(1 << 17)
#define PORTA_DIRSET_P18	(1 << 18)
#define PORTA_DIRSET_P19	(1 << 19)
#define PORTA_DIRSET_P20	(1 << 20)
#define PORTA_DIRSET_P21	(1 << 21)
#define PORTA_DIRSET_P22	(1 << 22)
#define PORTA_DIRSET_P23	(1 << 23)
#define PORTA_DIRSET_P24	(1 << 24)
#define PORTA_DIRSET_P25	(1 << 25)
#define PORTA_DIRSET_P26	(1 << 26)
#define PORTA_DIRSET_P27	(1 << 27)
#define PORTA_DIRSET_P28	(1 << 28)
#define PORTA_DIRSET_P29	(1 << 29)
#define PORTA_DIRSET_P30	(1 << 30)
#define PORTA_DIRSET_P31	(1 << 31)

#define PORTA_DIRSET_s    MMIO_REG(0x40002808, struct __struct_PORTA_DIRSET)
struct __struct_PORTA_DIRSET
{
  uint32_t p0 : 1;
  uint32_t p1 : 1;
  uint32_t p2 : 1;
  uint32_t p3 : 1;
  uint32_t p4 : 1;
  uint32_t p5 : 1;
  uint32_t p6 : 1;
  uint32_t p7 : 1;
  uint32_t p8 : 1;
  uint32_t p9 : 1;
  uint32_t p10 : 1;
  uint32_t p11 : 1;
  uint32_t p12 : 1;
  uint32_t p13 : 1;
  uint32_t p14 : 1;
  uint32_t p15 : 1;
  uint32_t p16 : 1;
  uint32_t p17 : 1;
  uint32_t p18 : 1;
  uint32_t p19 : 1;
  uint32_t p20 : 1;
  uint32_t p21 : 1;
  uint32_t p22 : 1;
  uint32_t p23 : 1;
  uint32_t p24 : 1;
  uint32_t p25 : 1;
  uint32_t p26 : 1;
  uint32_t p27 : 1;
  uint32_t p28 : 1;
  uint32_t p29 : 1;
  uint32_t p30 : 1;
  uint32_t p31 : 1;
};

#define PORTA_DIRTGL	MMIO_REG(0x4000280c, int32_t)
#define PORTA_DIRTGL_P0	(1 << 0)
#define PORTA_DIRTGL_P1	(1 << 1)
#define PORTA_DIRTGL_P2	(1 << 2)
#define PORTA_DIRTGL_P3	(1 << 3)
#define PORTA_DIRTGL_P4	(1 << 4)
#define PORTA_DIRTGL_P5	(1 << 5)
#define PORTA_DIRTGL_P6	(1 << 6)
#define PORTA_DIRTGL_P7	(1 << 7)
#define PORTA_DIRTGL_P8	(1 << 8)
#define PORTA_DIRTGL_P9	(1 << 9)
#define PORTA_DIRTGL_P10	(1 << 10)
#define PORTA_DIRTGL_P11	(1 << 11)
#define PORTA_DIRTGL_P12	(1 << 12)
#define PORTA_DIRTGL_P13	(1 << 13)
#define PORTA_DIRTGL_P14	(1 << 14)
#define PORTA_DIRTGL_P15	(1 << 15)
#define PORTA_DIRTGL_P16	(1 << 16)
#define PORTA_DIRTGL_P17	(1 << 17)
#define PORTA_DIRTGL_P18	(1 << 18)
#define PORTA_DIRTGL_P19	(1 << 19)
#define PORTA_DIRTGL_P20	(1 << 20)
#define PORTA_DIRTGL_P21	(1 << 21)
#define PORTA_DIRTGL_P22	(1 << 22)
#define PORTA_DIRTGL_P23	(1 << 23)
#define PORTA_DIRTGL_P24	(1 << 24)
#define PORTA_DIRTGL_P25	(1 << 25)
#define PORTA_DIRTGL_P26	(1 << 26)
#define PORTA_DIRTGL_P27	(1 << 27)
#define PORTA_DIRTGL_P28	(1 << 28)
#define PORTA_DIRTGL_P29	(1 << 29)
#define PORTA_DIRTGL_P30	(1 << 30)
#define PORTA_DIRTGL_P31	(1 << 31)

#define PORTA_DIRTGL_s    MMIO_REG(0x4000280c, struct __struct_PORTA_DIRTGL)
struct __struct_PORTA_DIRTGL
{
  uint32_t p0 : 1;
  uint32_t p1 : 1;
  uint32_t p2 : 1;
  uint32_t p3 : 1;
  uint32_t p4 : 1;
  uint32_t p5 : 1;
  uint32_t p6 : 1;
  uint32_t p7 : 1;
  uint32_t p8 : 1;
  uint32_t p9 : 1;
  uint32_t p10 : 1;
  uint32_t p11 : 1;
  uint32_t p12 : 1;
  uint32_t p13 : 1;
  uint32_t p14 : 1;
  uint32_t p15 : 1;
  uint32_t p16 : 1;
  uint32_t p17 : 1;
  uint32_t p18 : 1;
  uint32_t p19 : 1;
  uint32_t p20 : 1;
  uint32_t p21 : 1;
  uint32_t p22 : 1;
  uint32_t p23 : 1;
  uint32_t p24 : 1;
  uint32_t p25 : 1;
  uint32_t p26 : 1;
  uint32_t p27 : 1;
  uint32_t p28 : 1;
  uint32_t p29 : 1;
  uint32_t p30 : 1;
  uint32_t p31 : 1;
};

#define PORTA_OUT	MMIO_REG(0x40002810, int32_t)
#define PORTA_OUT_P0	(1 << 0)
#define PORTA_OUT_P1	(1 << 1)
#define PORTA_OUT_P2	(1 << 2)
#define PORTA_OUT_P3	(1 << 3)
#define PORTA_OUT_P4	(1 << 4)
#define PORTA_OUT_P5	(1 << 5)
#define PORTA_OUT_P6	(1 << 6)
#define PORTA_OUT_P7	(1 << 7)
#define PORTA_OUT_P8	(1 << 8)
#define PORTA_OUT_P9	(1 << 9)
#define PORTA_OUT_P10	(1 << 10)
#define PORTA_OUT_P11	(1 << 11)
#define PORTA_OUT_P12	(1 << 12)
#define PORTA_OUT_P13	(1 << 13)
#define PORTA_OUT_P14	(1 << 14)
#define PORTA_OUT_P15	(1 << 15)
#define PORTA_OUT_P16	(1 << 16)
#define PORTA_OUT_P17	(1 << 17)
#define PORTA_OUT_P18	(1 << 18)
#define PORTA_OUT_P19	(1 << 19)
#define PORTA_OUT_P20	(1 << 20)
#define PORTA_OUT_P21	(1 << 21)
#define PORTA_OUT_P22	(1 << 22)
#define PORTA_OUT_P23	(1 << 23)
#define PORTA_OUT_P24	(1 << 24)
#define PORTA_OUT_P25	(1 << 25)
#define PORTA_OUT_P26	(1 << 26)
#define PORTA_OUT_P27	(1 << 27)
#define PORTA_OUT_P28	(1 << 28)
#define PORTA_OUT_P29	(1 << 29)
#define PORTA_OUT_P30	(1 << 30)
#define PORTA_OUT_P31	(1 << 31)

#define PORTA_OUT_s    MMIO_REG(0x40002810, struct __struct_PORTA_OUT)
struct __struct_PORTA_OUT
{
  uint32_t p0 : 1;
  uint32_t p1 : 1;
  uint32_t p2 : 1;
  uint32_t p3 : 1;
  uint32_t p4 : 1;
  uint32_t p5 : 1;
  uint32_t p6 : 1;
  uint32_t p7 : 1;
  uint32_t p8 : 1;
  uint32_t p9 : 1;
  uint32_t p10 : 1;
  uint32_t p11 : 1;
  uint32_t p12 : 1;
  uint32_t p13 : 1;
  uint32_t p14 : 1;
  uint32_t p15 : 1;
  uint32_t p16 : 1;
  uint32_t p17 : 1;
  uint32_t p18 : 1;
  uint32_t p19 : 1;
  uint32_t p20 : 1;
  uint32_t p21 : 1;
  uint32_t p22 : 1;
  uint32_t p23 : 1;
  uint32_t p24 : 1;
  uint32_t p25 : 1;
  uint32_t p26 : 1;
  uint32_t p27 : 1;
  uint32_t p28 : 1;
  uint32_t p29 : 1;
  uint32_t p30 : 1;
  uint32_t p31 : 1;
};

#define PORTA_OUTCLR	MMIO_REG(0x40002814, int32_t)
#define PORTA_OUTCLR_P0	(1 << 0)
#define PORTA_OUTCLR_P1	(1 << 1)
#define PORTA_OUTCLR_P2	(1 << 2)
#define PORTA_OUTCLR_P3	(1 << 3)
#define PORTA_OUTCLR_P4	(1 << 4)
#define PORTA_OUTCLR_P5	(1 << 5)
#define PORTA_OUTCLR_P6	(1 << 6)
#define PORTA_OUTCLR_P7	(1 << 7)
#define PORTA_OUTCLR_P8	(1 << 8)
#define PORTA_OUTCLR_P9	(1 << 9)
#define PORTA_OUTCLR_P10	(1 << 10)
#define PORTA_OUTCLR_P11	(1 << 11)
#define PORTA_OUTCLR_P12	(1 << 12)
#define PORTA_OUTCLR_P13	(1 << 13)
#define PORTA_OUTCLR_P14	(1 << 14)
#define PORTA_OUTCLR_P15	(1 << 15)
#define PORTA_OUTCLR_P16	(1 << 16)
#define PORTA_OUTCLR_P17	(1 << 17)
#define PORTA_OUTCLR_P18	(1 << 18)
#define PORTA_OUTCLR_P19	(1 << 19)
#define PORTA_OUTCLR_P20	(1 << 20)
#define PORTA_OUTCLR_P21	(1 << 21)
#define PORTA_OUTCLR_P22	(1 << 22)
#define PORTA_OUTCLR_P23	(1 << 23)
#define PORTA_OUTCLR_P24	(1 << 24)
#define PORTA_OUTCLR_P25	(1 << 25)
#define PORTA_OUTCLR_P26	(1 << 26)
#define PORTA_OUTCLR_P27	(1 << 27)
#define PORTA_OUTCLR_P28	(1 << 28)
#define PORTA_OUTCLR_P29	(1 << 29)
#define PORTA_OUTCLR_P30	(1 << 30)
#define PORTA_OUTCLR_P31	(1 << 31)

#define PORTA_OUTCLR_s    MMIO_REG(0x40002814, struct __struct_PORTA_OUTCLR)
struct __struct_PORTA_OUTCLR
{
  uint32_t p0 : 1;
  uint32_t p1 : 1;
  uint32_t p2 : 1;
  uint32_t p3 : 1;
  uint32_t p4 : 1;
  uint32_t p5 : 1;
  uint32_t p6 : 1;
  uint32_t p7 : 1;
  uint32_t p8 : 1;
  uint32_t p9 : 1;
  uint32_t p10 : 1;
  uint32_t p11 : 1;
  uint32_t p12 : 1;
  uint32_t p13 : 1;
  uint32_t p14 : 1;
  uint32_t p15 : 1;
  uint32_t p16 : 1;
  uint32_t p17 : 1;
  uint32_t p18 : 1;
  uint32_t p19 : 1;
  uint32_t p20 : 1;
  uint32_t p21 : 1;
  uint32_t p22 : 1;
  uint32_t p23 : 1;
  uint32_t p24 : 1;
  uint32_t p25 : 1;
  uint32_t p26 : 1;
  uint32_t p27 : 1;
  uint32_t p28 : 1;
  uint32_t p29 : 1;
  uint32_t p30 : 1;
  uint32_t p31 : 1;
};

#define PORTA_OUTSET	MMIO_REG(0x40002818, int32_t)
#define PORTA_OUTSET_P0	(1 << 0)
#define PORTA_OUTSET_P1	(1 << 1)
#define PORTA_OUTSET_P2	(1 << 2)
#define PORTA_OUTSET_P3	(1 << 3)
#define PORTA_OUTSET_P4	(1 << 4)
#define PORTA_OUTSET_P5	(1 << 5)
#define PORTA_OUTSET_P6	(1 << 6)
#define PORTA_OUTSET_P7	(1 << 7)
#define PORTA_OUTSET_P8	(1 << 8)
#define PORTA_OUTSET_P9	(1 << 9)
#define PORTA_OUTSET_P10	(1 << 10)
#define PORTA_OUTSET_P11	(1 << 11)
#define PORTA_OUTSET_P12	(1 << 12)
#define PORTA_OUTSET_P13	(1 << 13)
#define PORTA_OUTSET_P14	(1 << 14)
#define PORTA_OUTSET_P15	(1 << 15)
#define PORTA_OUTSET_P16	(1 << 16)
#define PORTA_OUTSET_P17	(1 << 17)
#define PORTA_OUTSET_P18	(1 << 18)
#define PORTA_OUTSET_P19	(1 << 19)
#define PORTA_OUTSET_P20	(1 << 20)
#define PORTA_OUTSET_P21	(1 << 21)
#define PORTA_OUTSET_P22	(1 << 22)
#define PORTA_OUTSET_P23	(1 << 23)
#define PORTA_OUTSET_P24	(1 << 24)
#define PORTA_OUTSET_P25	(1 << 25)
#define PORTA_OUTSET_P26	(1 << 26)
#define PORTA_OUTSET_P27	(1 << 27)
#define PORTA_OUTSET_P28	(1 << 28)
#define PORTA_OUTSET_P29	(1 << 29)
#define PORTA_OUTSET_P30	(1 << 30)
#define PORTA_OUTSET_P31	(1 << 31)

#define PORTA_OUTSET_s    MMIO_REG(0x40002818, struct __struct_PORTA_OUTSET)
struct __struct_PORTA_OUTSET
{
  uint32_t p0 : 1;
  uint32_t p1 : 1;
  uint32_t p2 : 1;
  uint32_t p3 : 1;
  uint32_t p4 : 1;
  uint32_t p5 : 1;
  uint32_t p6 : 1;
  uint32_t p7 : 1;
  uint32_t p8 : 1;
  uint32_t p9 : 1;
  uint32_t p10 : 1;
  uint32_t p11 : 1;
  uint32_t p12 : 1;
  uint32_t p13 : 1;
  uint32_t p14 : 1;
  uint32_t p15 : 1;
  uint32_t p16 : 1;
  uint32_t p17 : 1;
  uint32_t p18 : 1;
  uint32_t p19 : 1;
  uint32_t p20 : 1;
  uint32_t p21 : 1;
  uint32_t p22 : 1;
  uint32_t p23 : 1;
  uint32_t p24 : 1;
  uint32_t p25 : 1;
  uint32_t p26 : 1;
  uint32_t p27 : 1;
  uint32_t p28 : 1;
  uint32_t p29 : 1;
  uint32_t p30 : 1;
  uint32_t p31 : 1;
};

#define PORTA_OUTTGL	MMIO_REG(0x4000281c, int32_t)
#define PORTA_OUTTGL_P0	(1 << 0)
#define PORTA_OUTTGL_P1	(1 << 1)
#define PORTA_OUTTGL_P2	(1 << 2)
#define PORTA_OUTTGL_P3	(1 << 3)
#define PORTA_OUTTGL_P4	(1 << 4)
#define PORTA_OUTTGL_P5	(1 << 5)
#define PORTA_OUTTGL_P6	(1 << 6)
#define PORTA_OUTTGL_P7	(1 << 7)
#define PORTA_OUTTGL_P8	(1 << 8)
#define PORTA_OUTTGL_P9	(1 << 9)
#define PORTA_OUTTGL_P10	(1 << 10)
#define PORTA_OUTTGL_P11	(1 << 11)
#define PORTA_OUTTGL_P12	(1 << 12)
#define PORTA_OUTTGL_P13	(1 << 13)
#define PORTA_OUTTGL_P14	(1 << 14)
#define PORTA_OUTTGL_P15	(1 << 15)
#define PORTA_OUTTGL_P16	(1 << 16)
#define PORTA_OUTTGL_P17	(1 << 17)
#define PORTA_OUTTGL_P18	(1 << 18)
#define PORTA_OUTTGL_P19	(1 << 19)
#define PORTA_OUTTGL_P20	(1 << 20)
#define PORTA_OUTTGL_P21	(1 << 21)
#define PORTA_OUTTGL_P22	(1 << 22)
#define PORTA_OUTTGL_P23	(1 << 23)
#define PORTA_OUTTGL_P24	(1 << 24)
#define PORTA_OUTTGL_P25	(1 << 25)
#define PORTA_OUTTGL_P26	(1 << 26)
#define PORTA_OUTTGL_P27	(1 << 27)
#define PORTA_OUTTGL_P28	(1 << 28)
#define PORTA_OUTTGL_P29	(1 << 29)
#define PORTA_OUTTGL_P30	(1 << 30)
#define PORTA_OUTTGL_P31	(1 << 31)

#define PORTA_OUTTGL_s    MMIO_REG(0x4000281c, struct __struct_PORTA_OUTTGL)
struct __struct_PORTA_OUTTGL
{
  uint32_t p0 : 1;
  uint32_t p1 : 1;
  uint32_t p2 : 1;
  uint32_t p3 : 1;
  uint32_t p4 : 1;
  uint32_t p5 : 1;
  uint32_t p6 : 1;
  uint32_t p7 : 1;
  uint32_t p8 : 1;
  uint32_t p9 : 1;
  uint32_t p10 : 1;
  uint32_t p11 : 1;
  uint32_t p12 : 1;
  uint32_t p13 : 1;
  uint32_t p14 : 1;
  uint32_t p15 : 1;
  uint32_t p16 : 1;
  uint32_t p17 : 1;
  uint32_t p18 : 1;
  uint32_t p19 : 1;
  uint32_t p20 : 1;
  uint32_t p21 : 1;
  uint32_t p22 : 1;
  uint32_t p23 : 1;
  uint32_t p24 : 1;
  uint32_t p25 : 1;
  uint32_t p26 : 1;
  uint32_t p27 : 1;
  uint32_t p28 : 1;
  uint32_t p29 : 1;
  uint32_t p30 : 1;
  uint32_t p31 : 1;
};

#define PORTA_IN	MMIO_REG(0x40002820, int32_t)
#define PORTA_IN_P0	(1 << 0)
#define PORTA_IN_P1	(1 << 1)
#define PORTA_IN_P2	(1 << 2)
#define PORTA_IN_P3	(1 << 3)
#define PORTA_IN_P4	(1 << 4)
#define PORTA_IN_P5	(1 << 5)
#define PORTA_IN_P6	(1 << 6)
#define PORTA_IN_P7	(1 << 7)
#define PORTA_IN_P8	(1 << 8)
#define PORTA_IN_P9	(1 << 9)
#define PORTA_IN_P10	(1 << 10)
#define PORTA_IN_P11	(1 << 11)
#define PORTA_IN_P12	(1 << 12)
#define PORTA_IN_P13	(1 << 13)
#define PORTA_IN_P14	(1 << 14)
#define PORTA_IN_P15	(1 << 15)
#define PORTA_IN_P16	(1 << 16)
#define PORTA_IN_P17	(1 << 17)
#define PORTA_IN_P18	(1 << 18)
#define PORTA_IN_P19	(1 << 19)
#define PORTA_IN_P20	(1 << 20)
#define PORTA_IN_P21	(1 << 21)
#define PORTA_IN_P22	(1 << 22)
#define PORTA_IN_P23	(1 << 23)
#define PORTA_IN_P24	(1 << 24)
#define PORTA_IN_P25	(1 << 25)
#define PORTA_IN_P26	(1 << 26)
#define PORTA_IN_P27	(1 << 27)
#define PORTA_IN_P28	(1 << 28)
#define PORTA_IN_P29	(1 << 29)
#define PORTA_IN_P30	(1 << 30)
#define PORTA_IN_P31	(1 << 31)

#define PORTA_IN_s    MMIO_REG(0x40002820, struct __struct_PORTA_IN)
struct __struct_PORTA_IN
{
  uint32_t p0 : 1;
  uint32_t p1 : 1;
  uint32_t p2 : 1;
  uint32_t p3 : 1;
  uint32_t p4 : 1;
  uint32_t p5 : 1;
  uint32_t p6 : 1;
  uint32_t p7 : 1;
  uint32_t p8 : 1;
  uint32_t p9 : 1;
  uint32_t p10 : 1;
  uint32_t p11 : 1;
  uint32_t p12 : 1;
  uint32_t p13 : 1;
  uint32_t p14 : 1;
  uint32_t p15 : 1;
  uint32_t p16 : 1;
  uint32_t p17 : 1;
  uint32_t p18 : 1;
  uint32_t p19 : 1;
  uint32_t p20 : 1;
  uint32_t p21 : 1;
  uint32_t p22 : 1;
  uint32_t p23 : 1;
  uint32_t p24 : 1;
  uint32_t p25 : 1;
  uint32_t p26 : 1;
  uint32_t p27 : 1;
  uint32_t p28 : 1;
  uint32_t p29 : 1;
  uint32_t p30 : 1;
  uint32_t p31 : 1;
};

