cepawiel/OpenGDEMU/CPU/submodules/microchip-asf/thirdparty/wireless/addons/boot/bootloader/cortexm0+/include/atsamr30.h
#define PORTA_PMUX11_s    MMIO_REG(0x4000283b, struct __struct_PORTA_PMUX11)
struct __struct_PORTA_PMUX11
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTA_PMUX12	MMIO_REG(0x4000283c, uint8_t)
#define PORTA_PMUX12_PMUXE(x)	((x) << 0)
#define PORTA_PMUX12_PMUXE_MSK	0x0000000f
#define PORTA_PMUX12_PMUXE_VAL(x)	(((x) >> 0) & 0xf)
#define PORTA_PMUX12_PMUXO(x)	((x) << 4)
#define PORTA_PMUX12_PMUXO_MSK	0x000000f0
#define PORTA_PMUX12_PMUXO_VAL(x)	(((x) >> 4) & 0xf)

#define PORTA_PMUX12_s    MMIO_REG(0x4000283c, struct __struct_PORTA_PMUX12)
struct __struct_PORTA_PMUX12
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTA_PMUX13	MMIO_REG(0x4000283d, uint8_t)
#define PORTA_PMUX13_PMUXE(x)	((x) << 0)
#define PORTA_PMUX13_PMUXE_MSK	0x0000000f
#define PORTA_PMUX13_PMUXE_VAL(x)	(((x) >> 0) & 0xf)
#define PORTA_PMUX13_PMUXO(x)	((x) << 4)
#define PORTA_PMUX13_PMUXO_MSK	0x000000f0
#define PORTA_PMUX13_PMUXO_VAL(x)	(((x) >> 4) & 0xf)

#define PORTA_PMUX13_s    MMIO_REG(0x4000283d, struct __struct_PORTA_PMUX13)
struct __struct_PORTA_PMUX13
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTA_PMUX14	MMIO_REG(0x4000283e, uint8_t)
#define PORTA_PMUX14_PMUXE(x)	((x) << 0)
#define PORTA_PMUX14_PMUXE_MSK	0x0000000f
#define PORTA_PMUX14_PMUXE_VAL(x)	(((x) >> 0) & 0xf)
#define PORTA_PMUX14_PMUXO(x)	((x) << 4)
#define PORTA_PMUX14_PMUXO_MSK	0x000000f0
#define PORTA_PMUX14_PMUXO_VAL(x)	(((x) >> 4) & 0xf)

#define PORTA_PMUX14_s    MMIO_REG(0x4000283e, struct __struct_PORTA_PMUX14)
struct __struct_PORTA_PMUX14
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTA_PMUX15	MMIO_REG(0x4000283f, uint8_t)
#define PORTA_PMUX15_PMUXE(x)	((x) << 0)
#define PORTA_PMUX15_PMUXE_MSK	0x0000000f
#define PORTA_PMUX15_PMUXE_VAL(x)	(((x) >> 0) & 0xf)
#define PORTA_PMUX15_PMUXO(x)	((x) << 4)
#define PORTA_PMUX15_PMUXO_MSK	0x000000f0
#define PORTA_PMUX15_PMUXO_VAL(x)	(((x) >> 4) & 0xf)

#define PORTA_PMUX15_s    MMIO_REG(0x4000283f, struct __struct_PORTA_PMUX15)
struct __struct_PORTA_PMUX15
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTA_PINCFG0	MMIO_REG(0x40002840, uint8_t)
#define PORTA_PINCFG0_PMUXEN	(1 << 0)
#define PORTA_PINCFG0_INEN	(1 << 1)
#define PORTA_PINCFG0_PULLEN	(1 << 2)

#define PORTA_PINCFG0_s    MMIO_REG(0x40002840, struct __struct_PORTA_PINCFG0)
struct __struct_PORTA_PINCFG0
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTA_PINCFG1	MMIO_REG(0x40002841, uint8_t)
#define PORTA_PINCFG1_PMUXEN	(1 << 0)
#define PORTA_PINCFG1_INEN	(1 << 1)
#define PORTA_PINCFG1_PULLEN	(1 << 2)

#define PORTA_PINCFG1_s    MMIO_REG(0x40002841, struct __struct_PORTA_PINCFG1)
struct __struct_PORTA_PINCFG1
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTA_PINCFG2	MMIO_REG(0x40002842, uint8_t)
#define PORTA_PINCFG2_PMUXEN	(1 << 0)
#define PORTA_PINCFG2_INEN	(1 << 1)
#define PORTA_PINCFG2_PULLEN	(1 << 2)

#define PORTA_PINCFG2_s    MMIO_REG(0x40002842, struct __struct_PORTA_PINCFG2)
struct __struct_PORTA_PINCFG2
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTA_PINCFG3	MMIO_REG(0x40002843, uint8_t)
#define PORTA_PINCFG3_PMUXEN	(1 << 0)
#define PORTA_PINCFG3_INEN	(1 << 1)
#define PORTA_PINCFG3_PULLEN	(1 << 2)

#define PORTA_PINCFG3_s    MMIO_REG(0x40002843, struct __struct_PORTA_PINCFG3)
struct __struct_PORTA_PINCFG3
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTA_PINCFG4	MMIO_REG(0x40002844, uint8_t)
#define PORTA_PINCFG4_PMUXEN	(1 << 0)
#define PORTA_PINCFG4_INEN	(1 << 1)
#define PORTA_PINCFG4_PULLEN	(1 << 2)

#define PORTA_PINCFG4_s    MMIO_REG(0x40002844, struct __struct_PORTA_PINCFG4)
struct __struct_PORTA_PINCFG4
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTA_PINCFG5	MMIO_REG(0x40002845, uint8_t)
#define PORTA_PINCFG5_PMUXEN	(1 << 0)
#define PORTA_PINCFG5_INEN	(1 << 1)
#define PORTA_PINCFG5_PULLEN	(1 << 2)

#define PORTA_PINCFG5_s    MMIO_REG(0x40002845, struct __struct_PORTA_PINCFG5)
struct __struct_PORTA_PINCFG5
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTA_PINCFG6	MMIO_REG(0x40002846, uint8_t)
#define PORTA_PINCFG6_PMUXEN	(1 << 0)
#define PORTA_PINCFG6_INEN	(1 << 1)
#define PORTA_PINCFG6_PULLEN	(1 << 2)

#define PORTA_PINCFG6_s    MMIO_REG(0x40002846, struct __struct_PORTA_PINCFG6)
struct __struct_PORTA_PINCFG6
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTA_PINCFG7	MMIO_REG(0x40002847, uint8_t)
#define PORTA_PINCFG7_PMUXEN	(1 << 0)
#define PORTA_PINCFG7_INEN	(1 << 1)
#define PORTA_PINCFG7_PULLEN	(1 << 2)

#define PORTA_PINCFG7_s    MMIO_REG(0x40002847, struct __struct_PORTA_PINCFG7)
struct __struct_PORTA_PINCFG7
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTA_PINCFG8	MMIO_REG(0x40002848, uint8_t)
#define PORTA_PINCFG8_PMUXEN	(1 << 0)
#define PORTA_PINCFG8_INEN	(1 << 1)
#define PORTA_PINCFG8_PULLEN	(1 << 2)

#define PORTA_PINCFG8_s    MMIO_REG(0x40002848, struct __struct_PORTA_PINCFG8)
struct __struct_PORTA_PINCFG8
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTA_PINCFG9	MMIO_REG(0x40002849, uint8_t)
#define PORTA_PINCFG9_PMUXEN	(1 << 0)
#define PORTA_PINCFG9_INEN	(1 << 1)
#define PORTA_PINCFG9_PULLEN	(1 << 2)

#define PORTA_PINCFG9_s    MMIO_REG(0x40002849, struct __struct_PORTA_PINCFG9)
struct __struct_PORTA_PINCFG9
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTA_PINCFG10	MMIO_REG(0x4000284a, uint8_t)
#define PORTA_PINCFG10_PMUXEN	(1 << 0)
#define PORTA_PINCFG10_INEN	(1 << 1)
#define PORTA_PINCFG10_PULLEN	(1 << 2)

#define PORTA_PINCFG10_s    MMIO_REG(0x4000284a, struct __struct_PORTA_PINCFG10)
struct __struct_PORTA_PINCFG10
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTA_PINCFG11	MMIO_REG(0x4000284b, uint8_t)
#define PORTA_PINCFG11_PMUXEN	(1 << 0)
#define PORTA_PINCFG11_INEN	(1 << 1)
#define PORTA_PINCFG11_PULLEN	(1 << 2)

