cepawiel/OpenGDEMU/CPU/submodules/microchip-asf/thirdparty/wireless/addons/boot/bootloader/cortexm0+/include/atsamr30.h
#define PORTA_PINCFG11_s    MMIO_REG(0x4000284b, struct __struct_PORTA_PINCFG11)
struct __struct_PORTA_PINCFG11
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTA_PINCFG12	MMIO_REG(0x4000284c, uint8_t)
#define PORTA_PINCFG12_PMUXEN	(1 << 0)
#define PORTA_PINCFG12_INEN	(1 << 1)
#define PORTA_PINCFG12_PULLEN	(1 << 2)

#define PORTA_PINCFG12_s    MMIO_REG(0x4000284c, struct __struct_PORTA_PINCFG12)
struct __struct_PORTA_PINCFG12
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTA_PINCFG13	MMIO_REG(0x4000284d, uint8_t)
#define PORTA_PINCFG13_PMUXEN	(1 << 0)
#define PORTA_PINCFG13_INEN	(1 << 1)
#define PORTA_PINCFG13_PULLEN	(1 << 2)

#define PORTA_PINCFG13_s    MMIO_REG(0x4000284d, struct __struct_PORTA_PINCFG13)
struct __struct_PORTA_PINCFG13
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTA_PINCFG14	MMIO_REG(0x4000284e, uint8_t)
#define PORTA_PINCFG14_PMUXEN	(1 << 0)
#define PORTA_PINCFG14_INEN	(1 << 1)
#define PORTA_PINCFG14_PULLEN	(1 << 2)

#define PORTA_PINCFG14_s    MMIO_REG(0x4000284e, struct __struct_PORTA_PINCFG14)
struct __struct_PORTA_PINCFG14
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTA_PINCFG15	MMIO_REG(0x4000284f, uint8_t)
#define PORTA_PINCFG15_PMUXEN	(1 << 0)
#define PORTA_PINCFG15_INEN	(1 << 1)
#define PORTA_PINCFG15_PULLEN	(1 << 2)

#define PORTA_PINCFG15_s    MMIO_REG(0x4000284f, struct __struct_PORTA_PINCFG15)
struct __struct_PORTA_PINCFG15
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTA_PINCFG16	MMIO_REG(0x40002850, uint8_t)
#define PORTA_PINCFG16_PMUXEN	(1 << 0)
#define PORTA_PINCFG16_INEN	(1 << 1)
#define PORTA_PINCFG16_PULLEN	(1 << 2)

#define PORTA_PINCFG16_s    MMIO_REG(0x40002850, struct __struct_PORTA_PINCFG16)
struct __struct_PORTA_PINCFG16
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTA_PINCFG17	MMIO_REG(0x40002851, uint8_t)
#define PORTA_PINCFG17_PMUXEN	(1 << 0)
#define PORTA_PINCFG17_INEN	(1 << 1)
#define PORTA_PINCFG17_PULLEN	(1 << 2)

#define PORTA_PINCFG17_s    MMIO_REG(0x40002851, struct __struct_PORTA_PINCFG17)
struct __struct_PORTA_PINCFG17
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTA_PINCFG18	MMIO_REG(0x40002852, uint8_t)
#define PORTA_PINCFG18_PMUXEN	(1 << 0)
#define PORTA_PINCFG18_INEN	(1 << 1)
#define PORTA_PINCFG18_PULLEN	(1 << 2)

#define PORTA_PINCFG18_s    MMIO_REG(0x40002852, struct __struct_PORTA_PINCFG18)
struct __struct_PORTA_PINCFG18
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTA_PINCFG19	MMIO_REG(0x40002853, uint8_t)
#define PORTA_PINCFG19_PMUXEN	(1 << 0)
#define PORTA_PINCFG19_INEN	(1 << 1)
#define PORTA_PINCFG19_PULLEN	(1 << 2)

#define PORTA_PINCFG19_s    MMIO_REG(0x40002853, struct __struct_PORTA_PINCFG19)
struct __struct_PORTA_PINCFG19
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTA_PINCFG20	MMIO_REG(0x40002854, uint8_t)
#define PORTA_PINCFG20_PMUXEN	(1 << 0)
#define PORTA_PINCFG20_INEN	(1 << 1)
#define PORTA_PINCFG20_PULLEN	(1 << 2)

#define PORTA_PINCFG20_s    MMIO_REG(0x40002854, struct __struct_PORTA_PINCFG20)
struct __struct_PORTA_PINCFG20
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTA_PINCFG21	MMIO_REG(0x40002855, uint8_t)
#define PORTA_PINCFG21_PMUXEN	(1 << 0)
#define PORTA_PINCFG21_INEN	(1 << 1)
#define PORTA_PINCFG21_PULLEN	(1 << 2)

#define PORTA_PINCFG21_s    MMIO_REG(0x40002855, struct __struct_PORTA_PINCFG21)
struct __struct_PORTA_PINCFG21
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTA_PINCFG22	MMIO_REG(0x40002856, uint8_t)
#define PORTA_PINCFG22_PMUXEN	(1 << 0)
#define PORTA_PINCFG22_INEN	(1 << 1)
#define PORTA_PINCFG22_PULLEN	(1 << 2)

#define PORTA_PINCFG22_s    MMIO_REG(0x40002856, struct __struct_PORTA_PINCFG22)
struct __struct_PORTA_PINCFG22
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTA_PINCFG23	MMIO_REG(0x40002857, uint8_t)
#define PORTA_PINCFG23_PMUXEN	(1 << 0)
#define PORTA_PINCFG23_INEN	(1 << 1)
#define PORTA_PINCFG23_PULLEN	(1 << 2)

#define PORTA_PINCFG23_s    MMIO_REG(0x40002857, struct __struct_PORTA_PINCFG23)
struct __struct_PORTA_PINCFG23
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTA_PINCFG24	MMIO_REG(0x40002858, uint8_t)
#define PORTA_PINCFG24_PMUXEN	(1 << 0)
#define PORTA_PINCFG24_INEN	(1 << 1)
#define PORTA_PINCFG24_PULLEN	(1 << 2)

#define PORTA_PINCFG24_s    MMIO_REG(0x40002858, struct __struct_PORTA_PINCFG24)
struct __struct_PORTA_PINCFG24
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTA_PINCFG25	MMIO_REG(0x40002859, uint8_t)
#define PORTA_PINCFG25_PMUXEN	(1 << 0)
#define PORTA_PINCFG25_INEN	(1 << 1)
#define PORTA_PINCFG25_PULLEN	(1 << 2)

#define PORTA_PINCFG25_s    MMIO_REG(0x40002859, struct __struct_PORTA_PINCFG25)
struct __struct_PORTA_PINCFG25
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTA_PINCFG26	MMIO_REG(0x4000285a, uint8_t)
#define PORTA_PINCFG26_PMUXEN	(1 << 0)
#define PORTA_PINCFG26_INEN	(1 << 1)
#define PORTA_PINCFG26_PULLEN	(1 << 2)

#define PORTA_PINCFG26_s    MMIO_REG(0x4000285a, struct __struct_PORTA_PINCFG26)
struct __struct_PORTA_PINCFG26
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTA_PINCFG27	MMIO_REG(0x4000285b, uint8_t)
#define PORTA_PINCFG27_PMUXEN	(1 << 0)
#define PORTA_PINCFG27_INEN	(1 << 1)
#define PORTA_PINCFG27_PULLEN	(1 << 2)

#define PORTA_PINCFG27_s    MMIO_REG(0x4000285b, struct __struct_PORTA_PINCFG27)
struct __struct_PORTA_PINCFG27
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTA_PINCFG28	MMIO_REG(0x4000285c, uint8_t)
#define PORTA_PINCFG28_PMUXEN	(1 << 0)
#define PORTA_PINCFG28_INEN	(1 << 1)
#define PORTA_PINCFG28_PULLEN	(1 << 2)

#define PORTA_PINCFG28_s    MMIO_REG(0x4000285c, struct __struct_PORTA_PINCFG28)
struct __struct_PORTA_PINCFG28
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

