cepawiel/OpenGDEMU/CPU/submodules/microchip-asf/thirdparty/wireless/addons/boot/bootloader/cortexm0+/include/atsamr30.h
#define PORTA_PINCFG29	MMIO_REG(0x4000285d, uint8_t)
#define PORTA_PINCFG29_PMUXEN	(1 << 0)
#define PORTA_PINCFG29_INEN	(1 << 1)
#define PORTA_PINCFG29_PULLEN	(1 << 2)

#define PORTA_PINCFG29_s    MMIO_REG(0x4000285d, struct __struct_PORTA_PINCFG29)
struct __struct_PORTA_PINCFG29
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTA_PINCFG30	MMIO_REG(0x4000285e, uint8_t)
#define PORTA_PINCFG30_PMUXEN	(1 << 0)
#define PORTA_PINCFG30_INEN	(1 << 1)
#define PORTA_PINCFG30_PULLEN	(1 << 2)

#define PORTA_PINCFG30_s    MMIO_REG(0x4000285e, struct __struct_PORTA_PINCFG30)
struct __struct_PORTA_PINCFG30
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTA_PINCFG31	MMIO_REG(0x4000285f, uint8_t)
#define PORTA_PINCFG31_PMUXEN	(1 << 0)
#define PORTA_PINCFG31_INEN	(1 << 1)
#define PORTA_PINCFG31_PULLEN	(1 << 2)

#define PORTA_PINCFG31_s    MMIO_REG(0x4100285f, struct __struct_PORTA_PINCFG31)
struct __struct_PORTA_PINCFG31
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

// 0x40002880 PORTB

#define PORTB_DIR	MMIO_REG(0x40002880, int32_t)
#define PORTB_DIR_P0	(1 << 0)
#define PORTB_DIR_P1	(1 << 1)
#define PORTB_DIR_P2	(1 << 2)
#define PORTB_DIR_P3	(1 << 3)
#define PORTB_DIR_P4	(1 << 4)
#define PORTB_DIR_P5	(1 << 5)
#define PORTB_DIR_P6	(1 << 6)
#define PORTB_DIR_P7	(1 << 7)
#define PORTB_DIR_P8	(1 << 8)
#define PORTB_DIR_P9	(1 << 9)
#define PORTB_DIR_P10	(1 << 10)
#define PORTB_DIR_P11	(1 << 11)
#define PORTB_DIR_P12	(1 << 12)
#define PORTB_DIR_P13	(1 << 13)
#define PORTB_DIR_P14	(1 << 14)
#define PORTB_DIR_P15	(1 << 15)
#define PORTB_DIR_P16	(1 << 16)
#define PORTB_DIR_P17	(1 << 17)
#define PORTB_DIR_P18	(1 << 18)
#define PORTB_DIR_P19	(1 << 19)
#define PORTB_DIR_P20	(1 << 20)
#define PORTB_DIR_P21	(1 << 21)
#define PORTB_DIR_P22	(1 << 22)
#define PORTB_DIR_P23	(1 << 23)
#define PORTB_DIR_P24	(1 << 24)
#define PORTB_DIR_P25	(1 << 25)
#define PORTB_DIR_P26	(1 << 26)
#define PORTB_DIR_P27	(1 << 27)
#define PORTB_DIR_P28	(1 << 28)
#define PORTB_DIR_P29	(1 << 29)
#define PORTB_DIR_P30	(1 << 30)
#define PORTB_DIR_P31	(1 << 31)

#define PORTB_DIR_s    MMIO_REG(0x40002880, struct __struct_PORTB_DIR)
struct __struct_PORTB_DIR
{
  uint32_t p0 : 1;
  uint32_t p1 : 1;
  uint32_t p2 : 1;
  uint32_t p3 : 1;
  uint32_t p4 : 1;
  uint32_t p5 : 1;
  uint32_t p6 : 1;
  uint32_t p7 : 1;
  uint32_t p8 : 1;
  uint32_t p9 : 1;
  uint32_t p10 : 1;
  uint32_t p11 : 1;
  uint32_t p12 : 1;
  uint32_t p13 : 1;
  uint32_t p14 : 1;
  uint32_t p15 : 1;
  uint32_t p16 : 1;
  uint32_t p17 : 1;
  uint32_t p18 : 1;
  uint32_t p19 : 1;
  uint32_t p20 : 1;
  uint32_t p21 : 1;
  uint32_t p22 : 1;
  uint32_t p23 : 1;
  uint32_t p24 : 1;
  uint32_t p25 : 1;
  uint32_t p26 : 1;
  uint32_t p27 : 1;
  uint32_t p28 : 1;
  uint32_t p29 : 1;
  uint32_t p30 : 1;
  uint32_t p31 : 1;
};

#define PORTB_DIRCLR	MMIO_REG(0x40002884, int32_t)
#define PORTB_DIRCLR_P0	(1 << 0)
#define PORTB_DIRCLR_P1	(1 << 1)
#define PORTB_DIRCLR_P2	(1 << 2)
#define PORTB_DIRCLR_P3	(1 << 3)
#define PORTB_DIRCLR_P4	(1 << 4)
#define PORTB_DIRCLR_P5	(1 << 5)
#define PORTB_DIRCLR_P6	(1 << 6)
#define PORTB_DIRCLR_P7	(1 << 7)
#define PORTB_DIRCLR_P8	(1 << 8)
#define PORTB_DIRCLR_P9	(1 << 9)
#define PORTB_DIRCLR_P10	(1 << 10)
#define PORTB_DIRCLR_P11	(1 << 11)
#define PORTB_DIRCLR_P12	(1 << 12)
#define PORTB_DIRCLR_P13	(1 << 13)
#define PORTB_DIRCLR_P14	(1 << 14)
#define PORTB_DIRCLR_P15	(1 << 15)
#define PORTB_DIRCLR_P16	(1 << 16)
#define PORTB_DIRCLR_P17	(1 << 17)
#define PORTB_DIRCLR_P18	(1 << 18)
#define PORTB_DIRCLR_P19	(1 << 19)
#define PORTB_DIRCLR_P20	(1 << 20)
#define PORTB_DIRCLR_P21	(1 << 21)
#define PORTB_DIRCLR_P22	(1 << 22)
#define PORTB_DIRCLR_P23	(1 << 23)
#define PORTB_DIRCLR_P24	(1 << 24)
#define PORTB_DIRCLR_P25	(1 << 25)
#define PORTB_DIRCLR_P26	(1 << 26)
#define PORTB_DIRCLR_P27	(1 << 27)
#define PORTB_DIRCLR_P28	(1 << 28)
#define PORTB_DIRCLR_P29	(1 << 29)
#define PORTB_DIRCLR_P30	(1 << 30)
#define PORTB_DIRCLR_P31	(1 << 31)

#define PORTB_DIRCLR_s    MMIO_REG(0x40002884, struct __struct_PORTB_DIRCLR)
struct __struct_PORTB_DIRCLR
{
  uint32_t p0 : 1;
  uint32_t p1 : 1;
  uint32_t p2 : 1;
  uint32_t p3 : 1;
  uint32_t p4 : 1;
  uint32_t p5 : 1;
  uint32_t p6 : 1;
  uint32_t p7 : 1;
  uint32_t p8 : 1;
  uint32_t p9 : 1;
  uint32_t p10 : 1;
  uint32_t p11 : 1;
  uint32_t p12 : 1;
  uint32_t p13 : 1;
  uint32_t p14 : 1;
  uint32_t p15 : 1;
  uint32_t p16 : 1;
  uint32_t p17 : 1;
  uint32_t p18 : 1;
  uint32_t p19 : 1;
  uint32_t p20 : 1;
  uint32_t p21 : 1;
  uint32_t p22 : 1;
  uint32_t p23 : 1;
  uint32_t p24 : 1;
  uint32_t p25 : 1;
  uint32_t p26 : 1;
  uint32_t p27 : 1;
  uint32_t p28 : 1;
  uint32_t p29 : 1;
  uint32_t p30 : 1;
  uint32_t p31 : 1;
};

#define PORTB_DIRSET	MMIO_REG(0x40002888, int32_t)
#define PORTB_DIRSET_P0	(1 << 0)
#define PORTB_DIRSET_P1	(1 << 1)
#define PORTB_DIRSET_P2	(1 << 2)
#define PORTB_DIRSET_P3	(1 << 3)
#define PORTB_DIRSET_P4	(1 << 4)
#define PORTB_DIRSET_P5	(1 << 5)
#define PORTB_DIRSET_P6	(1 << 6)
#define PORTB_DIRSET_P7	(1 << 7)
#define PORTB_DIRSET_P8	(1 << 8)
#define PORTB_DIRSET_P9	(1 << 9)
#define PORTB_DIRSET_P10	(1 << 10)
#define PORTB_DIRSET_P11	(1 << 11)
#define PORTB_DIRSET_P12	(1 << 12)
#define PORTB_DIRSET_P13	(1 << 13)
#define PORTB_DIRSET_P14	(1 << 14)
#define PORTB_DIRSET_P15	(1 << 15)
#define PORTB_DIRSET_P16	(1 << 16)
#define PORTB_DIRSET_P17	(1 << 17)
#define PORTB_DIRSET_P18	(1 << 18)
#define PORTB_DIRSET_P19	(1 << 19)
#define PORTB_DIRSET_P20	(1 << 20)
#define PORTB_DIRSET_P21	(1 << 21)
#define PORTB_DIRSET_P22	(1 << 22)
#define PORTB_DIRSET_P23	(1 << 23)
#define PORTB_DIRSET_P24	(1 << 24)
#define PORTB_DIRSET_P25	(1 << 25)
#define PORTB_DIRSET_P26	(1 << 26)
#define PORTB_DIRSET_P27	(1 << 27)
#define PORTB_DIRSET_P28	(1 << 28)
#define PORTB_DIRSET_P29	(1 << 29)
#define PORTB_DIRSET_P30	(1 << 30)
#define PORTB_DIRSET_P31	(1 << 31)

#define PORTB_DIRSET_s    MMIO_REG(0x40002888, struct __struct_PORTB_DIRSET)
struct __struct_PORTB_DIRSET
{
  uint32_t p0 : 1;
  uint32_t p1 : 1;
  uint32_t p2 : 1;
  uint32_t p3 : 1;
  uint32_t p4 : 1;
  uint32_t p5 : 1;
  uint32_t p6 : 1;
  uint32_t p7 : 1;
  uint32_t p8 : 1;
  uint32_t p9 : 1;
  uint32_t p10 : 1;
  uint32_t p11 : 1;
  uint32_t p12 : 1;
  uint32_t p13 : 1;
  uint32_t p14 : 1;
  uint32_t p15 : 1;
  uint32_t p16 : 1;
  uint32_t p17 : 1;
  uint32_t p18 : 1;
  uint32_t p19 : 1;
  uint32_t p20 : 1;
  uint32_t p21 : 1;
  uint32_t p22 : 1;
  uint32_t p23 : 1;
  uint32_t p24 : 1;
  uint32_t p25 : 1;
  uint32_t p26 : 1;
  uint32_t p27 : 1;
  uint32_t p28 : 1;
  uint32_t p29 : 1;
  uint32_t p30 : 1;
  uint32_t p31 : 1;
};

#define PORTB_DIRTGL	MMIO_REG(0x4000288c, int32_t)
#define PORTB_DIRTGL_P0	(1 << 0)
#define PORTB_DIRTGL_P1	(1 << 1)
#define PORTB_DIRTGL_P2	(1 << 2)
#define PORTB_DIRTGL_P3	(1 << 3)
#define PORTB_DIRTGL_P4	(1 << 4)
#define PORTB_DIRTGL_P5	(1 << 5)
#define PORTB_DIRTGL_P6	(1 << 6)
#define PORTB_DIRTGL_P7	(1 << 7)
#define PORTB_DIRTGL_P8	(1 << 8)
#define PORTB_DIRTGL_P9	(1 << 9)
#define PORTB_DIRTGL_P10	(1 << 10)
#define PORTB_DIRTGL_P11	(1 << 11)
#define PORTB_DIRTGL_P12	(1 << 12)
#define PORTB_DIRTGL_P13	(1 << 13)
#define PORTB_DIRTGL_P14	(1 << 14)
#define PORTB_DIRTGL_P15	(1 << 15)
#define PORTB_DIRTGL_P16	(1 << 16)
#define PORTB_DIRTGL_P17	(1 << 17)
#define PORTB_DIRTGL_P18	(1 << 18)
#define PORTB_DIRTGL_P19	(1 << 19)
#define PORTB_DIRTGL_P20	(1 << 20)
#define PORTB_DIRTGL_P21	(1 << 21)
#define PORTB_DIRTGL_P22	(1 << 22)
#define PORTB_DIRTGL_P23	(1 << 23)
#define PORTB_DIRTGL_P24	(1 << 24)
#define PORTB_DIRTGL_P25	(1 << 25)
#define PORTB_DIRTGL_P26	(1 << 26)
#define PORTB_DIRTGL_P27	(1 << 27)
#define PORTB_DIRTGL_P28	(1 << 28)
#define PORTB_DIRTGL_P29	(1 << 29)
#define PORTB_DIRTGL_P30	(1 << 30)
#define PORTB_DIRTGL_P31	(1 << 31)

#define PORTB_DIRTGL_s    MMIO_REG(0x4000288c, struct __struct_PORTB_DIRTGL)
struct __struct_PORTB_DIRTGL
{
  uint32_t p0 : 1;
  uint32_t p1 : 1;
  uint32_t p2 : 1;
  uint32_t p3 : 1;
  uint32_t p4 : 1;
  uint32_t p5 : 1;
  uint32_t p6 : 1;
  uint32_t p7 : 1;
  uint32_t p8 : 1;
  uint32_t p9 : 1;
  uint32_t p10 : 1;
  uint32_t p11 : 1;
  uint32_t p12 : 1;
  uint32_t p13 : 1;
  uint32_t p14 : 1;
  uint32_t p15 : 1;
  uint32_t p16 : 1;
  uint32_t p17 : 1;
  uint32_t p18 : 1;
  uint32_t p19 : 1;
  uint32_t p20 : 1;
  uint32_t p21 : 1;
  uint32_t p22 : 1;
  uint32_t p23 : 1;
  uint32_t p24 : 1;
  uint32_t p25 : 1;
  uint32_t p26 : 1;
  uint32_t p27 : 1;
  uint32_t p28 : 1;
  uint32_t p29 : 1;
  uint32_t p30 : 1;
  uint32_t p31 : 1;
};

#define PORTB_OUT	MMIO_REG(0x40002890, int32_t)
#define PORTB_OUT_P0	(1 << 0)
#define PORTB_OUT_P1	(1 << 1)
#define PORTB_OUT_P2	(1 << 2)
#define PORTB_OUT_P3	(1 << 3)
#define PORTB_OUT_P4	(1 << 4)
#define PORTB_OUT_P5	(1 << 5)
#define PORTB_OUT_P6	(1 << 6)
#define PORTB_OUT_P7	(1 << 7)
#define PORTB_OUT_P8	(1 << 8)
#define PORTB_OUT_P9	(1 << 9)
#define PORTB_OUT_P10	(1 << 10)
#define PORTB_OUT_P11	(1 << 11)
#define PORTB_OUT_P12	(1 << 12)
#define PORTB_OUT_P13	(1 << 13)
#define PORTB_OUT_P14	(1 << 14)
#define PORTB_OUT_P15	(1 << 15)
#define PORTB_OUT_P16	(1 << 16)
#define PORTB_OUT_P17	(1 << 17)
#define PORTB_OUT_P18	(1 << 18)
#define PORTB_OUT_P19	(1 << 19)
#define PORTB_OUT_P20	(1 << 20)
#define PORTB_OUT_P21	(1 << 21)
#define PORTB_OUT_P22	(1 << 22)
#define PORTB_OUT_P23	(1 << 23)
#define PORTB_OUT_P24	(1 << 24)
#define PORTB_OUT_P25	(1 << 25)
#define PORTB_OUT_P26	(1 << 26)
#define PORTB_OUT_P27	(1 << 27)
#define PORTB_OUT_P28	(1 << 28)
#define PORTB_OUT_P29	(1 << 29)
#define PORTB_OUT_P30	(1 << 30)
#define PORTB_OUT_P31	(1 << 31)

#define PORTB_OUT_s    MMIO_REG(0x40002890, struct __struct_PORTB_OUT)
struct __struct_PORTB_OUT
{
  uint32_t p0 : 1;
  uint32_t p1 : 1;
  uint32_t p2 : 1;
  uint32_t p3 : 1;
  uint32_t p4 : 1;
  uint32_t p5 : 1;
  uint32_t p6 : 1;
  uint32_t p7 : 1;
  uint32_t p8 : 1;
  uint32_t p9 : 1;
  uint32_t p10 : 1;
  uint32_t p11 : 1;
  uint32_t p12 : 1;
  uint32_t p13 : 1;
  uint32_t p14 : 1;
  uint32_t p15 : 1;
  uint32_t p16 : 1;
  uint32_t p17 : 1;
  uint32_t p18 : 1;
  uint32_t p19 : 1;
  uint32_t p20 : 1;
  uint32_t p21 : 1;
  uint32_t p22 : 1;
  uint32_t p23 : 1;
  uint32_t p24 : 1;
  uint32_t p25 : 1;
  uint32_t p26 : 1;
  uint32_t p27 : 1;
  uint32_t p28 : 1;
  uint32_t p29 : 1;
  uint32_t p30 : 1;
  uint32_t p31 : 1;
};

#define PORTB_OUTCLR	MMIO_REG(0x40002894, int32_t)
#define PORTB_OUTCLR_P0	(1 << 0)
#define PORTB_OUTCLR_P1	(1 << 1)
#define PORTB_OUTCLR_P2	(1 << 2)
#define PORTB_OUTCLR_P3	(1 << 3)
#define PORTB_OUTCLR_P4	(1 << 4)
#define PORTB_OUTCLR_P5	(1 << 5)
#define PORTB_OUTCLR_P6	(1 << 6)
#define PORTB_OUTCLR_P7	(1 << 7)
#define PORTB_OUTCLR_P8	(1 << 8)
#define PORTB_OUTCLR_P9	(1 << 9)
#define PORTB_OUTCLR_P10	(1 << 10)
#define PORTB_OUTCLR_P11	(1 << 11)
#define PORTB_OUTCLR_P12	(1 << 12)
#define PORTB_OUTCLR_P13	(1 << 13)
#define PORTB_OUTCLR_P14	(1 << 14)
#define PORTB_OUTCLR_P15	(1 << 15)
#define PORTB_OUTCLR_P16	(1 << 16)
#define PORTB_OUTCLR_P17	(1 << 17)
#define PORTB_OUTCLR_P18	(1 << 18)
#define PORTB_OUTCLR_P19	(1 << 19)
#define PORTB_OUTCLR_P20	(1 << 20)
#define PORTB_OUTCLR_P21	(1 << 21)
#define PORTB_OUTCLR_P22	(1 << 22)
#define PORTB_OUTCLR_P23	(1 << 23)
#define PORTB_OUTCLR_P24	(1 << 24)
#define PORTB_OUTCLR_P25	(1 << 25)
#define PORTB_OUTCLR_P26	(1 << 26)
#define PORTB_OUTCLR_P27	(1 << 27)
#define PORTB_OUTCLR_P28	(1 << 28)
#define PORTB_OUTCLR_P29	(1 << 29)
#define PORTB_OUTCLR_P30	(1 << 30)
#define PORTB_OUTCLR_P31	(1 << 31)

