cepawiel/OpenGDEMU/CPU/submodules/microchip-asf/thirdparty/wireless/addons/boot/bootloader/cortexm0+/include/atsamr30.h
#define PORTB_OUTCLR_s    MMIO_REG(0x40002894, struct __struct_PORTB_OUTCLR)
struct __struct_PORTB_OUTCLR
{
  uint32_t p0 : 1;
  uint32_t p1 : 1;
  uint32_t p2 : 1;
  uint32_t p3 : 1;
  uint32_t p4 : 1;
  uint32_t p5 : 1;
  uint32_t p6 : 1;
  uint32_t p7 : 1;
  uint32_t p8 : 1;
  uint32_t p9 : 1;
  uint32_t p10 : 1;
  uint32_t p11 : 1;
  uint32_t p12 : 1;
  uint32_t p13 : 1;
  uint32_t p14 : 1;
  uint32_t p15 : 1;
  uint32_t p16 : 1;
  uint32_t p17 : 1;
  uint32_t p18 : 1;
  uint32_t p19 : 1;
  uint32_t p20 : 1;
  uint32_t p21 : 1;
  uint32_t p22 : 1;
  uint32_t p23 : 1;
  uint32_t p24 : 1;
  uint32_t p25 : 1;
  uint32_t p26 : 1;
  uint32_t p27 : 1;
  uint32_t p28 : 1;
  uint32_t p29 : 1;
  uint32_t p30 : 1;
  uint32_t p31 : 1;
};

#define PORTB_OUTSET	MMIO_REG(0x40002898, int32_t)
#define PORTB_OUTSET_P0	(1 << 0)
#define PORTB_OUTSET_P1	(1 << 1)
#define PORTB_OUTSET_P2	(1 << 2)
#define PORTB_OUTSET_P3	(1 << 3)
#define PORTB_OUTSET_P4	(1 << 4)
#define PORTB_OUTSET_P5	(1 << 5)
#define PORTB_OUTSET_P6	(1 << 6)
#define PORTB_OUTSET_P7	(1 << 7)
#define PORTB_OUTSET_P8	(1 << 8)
#define PORTB_OUTSET_P9	(1 << 9)
#define PORTB_OUTSET_P10	(1 << 10)
#define PORTB_OUTSET_P11	(1 << 11)
#define PORTB_OUTSET_P12	(1 << 12)
#define PORTB_OUTSET_P13	(1 << 13)
#define PORTB_OUTSET_P14	(1 << 14)
#define PORTB_OUTSET_P15	(1 << 15)
#define PORTB_OUTSET_P16	(1 << 16)
#define PORTB_OUTSET_P17	(1 << 17)
#define PORTB_OUTSET_P18	(1 << 18)
#define PORTB_OUTSET_P19	(1 << 19)
#define PORTB_OUTSET_P20	(1 << 20)
#define PORTB_OUTSET_P21	(1 << 21)
#define PORTB_OUTSET_P22	(1 << 22)
#define PORTB_OUTSET_P23	(1 << 23)
#define PORTB_OUTSET_P24	(1 << 24)
#define PORTB_OUTSET_P25	(1 << 25)
#define PORTB_OUTSET_P26	(1 << 26)
#define PORTB_OUTSET_P27	(1 << 27)
#define PORTB_OUTSET_P28	(1 << 28)
#define PORTB_OUTSET_P29	(1 << 29)
#define PORTB_OUTSET_P30	(1 << 30)
#define PORTB_OUTSET_P31	(1 << 31)

#define PORTB_OUTSET_s    MMIO_REG(0x40002898, struct __struct_PORTB_OUTSET)
struct __struct_PORTB_OUTSET
{
  uint32_t p0 : 1;
  uint32_t p1 : 1;
  uint32_t p2 : 1;
  uint32_t p3 : 1;
  uint32_t p4 : 1;
  uint32_t p5 : 1;
  uint32_t p6 : 1;
  uint32_t p7 : 1;
  uint32_t p8 : 1;
  uint32_t p9 : 1;
  uint32_t p10 : 1;
  uint32_t p11 : 1;
  uint32_t p12 : 1;
  uint32_t p13 : 1;
  uint32_t p14 : 1;
  uint32_t p15 : 1;
  uint32_t p16 : 1;
  uint32_t p17 : 1;
  uint32_t p18 : 1;
  uint32_t p19 : 1;
  uint32_t p20 : 1;
  uint32_t p21 : 1;
  uint32_t p22 : 1;
  uint32_t p23 : 1;
  uint32_t p24 : 1;
  uint32_t p25 : 1;
  uint32_t p26 : 1;
  uint32_t p27 : 1;
  uint32_t p28 : 1;
  uint32_t p29 : 1;
  uint32_t p30 : 1;
  uint32_t p31 : 1;
};

#define PORTB_OUTTGL	MMIO_REG(0x4000289c, int32_t)
#define PORTB_OUTTGL_P0	(1 << 0)
#define PORTB_OUTTGL_P1	(1 << 1)
#define PORTB_OUTTGL_P2	(1 << 2)
#define PORTB_OUTTGL_P3	(1 << 3)
#define PORTB_OUTTGL_P4	(1 << 4)
#define PORTB_OUTTGL_P5	(1 << 5)
#define PORTB_OUTTGL_P6	(1 << 6)
#define PORTB_OUTTGL_P7	(1 << 7)
#define PORTB_OUTTGL_P8	(1 << 8)
#define PORTB_OUTTGL_P9	(1 << 9)
#define PORTB_OUTTGL_P10	(1 << 10)
#define PORTB_OUTTGL_P11	(1 << 11)
#define PORTB_OUTTGL_P12	(1 << 12)
#define PORTB_OUTTGL_P13	(1 << 13)
#define PORTB_OUTTGL_P14	(1 << 14)
#define PORTB_OUTTGL_P15	(1 << 15)
#define PORTB_OUTTGL_P16	(1 << 16)
#define PORTB_OUTTGL_P17	(1 << 17)
#define PORTB_OUTTGL_P18	(1 << 18)
#define PORTB_OUTTGL_P19	(1 << 19)
#define PORTB_OUTTGL_P20	(1 << 20)
#define PORTB_OUTTGL_P21	(1 << 21)
#define PORTB_OUTTGL_P22	(1 << 22)
#define PORTB_OUTTGL_P23	(1 << 23)
#define PORTB_OUTTGL_P24	(1 << 24)
#define PORTB_OUTTGL_P25	(1 << 25)
#define PORTB_OUTTGL_P26	(1 << 26)
#define PORTB_OUTTGL_P27	(1 << 27)
#define PORTB_OUTTGL_P28	(1 << 28)
#define PORTB_OUTTGL_P29	(1 << 29)
#define PORTB_OUTTGL_P30	(1 << 30)
#define PORTB_OUTTGL_P31	(1 << 31)

#define PORTB_OUTTGL_s    MMIO_REG(0x4000289c, struct __struct_PORTB_OUTTGL)
struct __struct_PORTB_OUTTGL
{
  uint32_t p0 : 1;
  uint32_t p1 : 1;
  uint32_t p2 : 1;
  uint32_t p3 : 1;
  uint32_t p4 : 1;
  uint32_t p5 : 1;
  uint32_t p6 : 1;
  uint32_t p7 : 1;
  uint32_t p8 : 1;
  uint32_t p9 : 1;
  uint32_t p10 : 1;
  uint32_t p11 : 1;
  uint32_t p12 : 1;
  uint32_t p13 : 1;
  uint32_t p14 : 1;
  uint32_t p15 : 1;
  uint32_t p16 : 1;
  uint32_t p17 : 1;
  uint32_t p18 : 1;
  uint32_t p19 : 1;
  uint32_t p20 : 1;
  uint32_t p21 : 1;
  uint32_t p22 : 1;
  uint32_t p23 : 1;
  uint32_t p24 : 1;
  uint32_t p25 : 1;
  uint32_t p26 : 1;
  uint32_t p27 : 1;
  uint32_t p28 : 1;
  uint32_t p29 : 1;
  uint32_t p30 : 1;
  uint32_t p31 : 1;
};

#define PORTB_IN	MMIO_REG(0x400028a0, int32_t)
#define PORTB_IN_P0	(1 << 0)
#define PORTB_IN_P1	(1 << 1)
#define PORTB_IN_P2	(1 << 2)
#define PORTB_IN_P3	(1 << 3)
#define PORTB_IN_P4	(1 << 4)
#define PORTB_IN_P5	(1 << 5)
#define PORTB_IN_P6	(1 << 6)
#define PORTB_IN_P7	(1 << 7)
#define PORTB_IN_P8	(1 << 8)
#define PORTB_IN_P9	(1 << 9)
#define PORTB_IN_P10	(1 << 10)
#define PORTB_IN_P11	(1 << 11)
#define PORTB_IN_P12	(1 << 12)
#define PORTB_IN_P13	(1 << 13)
#define PORTB_IN_P14	(1 << 14)
#define PORTB_IN_P15	(1 << 15)
#define PORTB_IN_P16	(1 << 16)
#define PORTB_IN_P17	(1 << 17)
#define PORTB_IN_P18	(1 << 18)
#define PORTB_IN_P19	(1 << 19)
#define PORTB_IN_P20	(1 << 20)
#define PORTB_IN_P21	(1 << 21)
#define PORTB_IN_P22	(1 << 22)
#define PORTB_IN_P23	(1 << 23)
#define PORTB_IN_P24	(1 << 24)
#define PORTB_IN_P25	(1 << 25)
#define PORTB_IN_P26	(1 << 26)
#define PORTB_IN_P27	(1 << 27)
#define PORTB_IN_P28	(1 << 28)
#define PORTB_IN_P29	(1 << 29)
#define PORTB_IN_P30	(1 << 30)
#define PORTB_IN_P31	(1 << 31)

#define PORTB_IN_s    MMIO_REG(0x400028a0, struct __struct_PORTB_IN)
struct __struct_PORTB_IN
{
  uint32_t p0 : 1;
  uint32_t p1 : 1;
  uint32_t p2 : 1;
  uint32_t p3 : 1;
  uint32_t p4 : 1;
  uint32_t p5 : 1;
  uint32_t p6 : 1;
  uint32_t p7 : 1;
  uint32_t p8 : 1;
  uint32_t p9 : 1;
  uint32_t p10 : 1;
  uint32_t p11 : 1;
  uint32_t p12 : 1;
  uint32_t p13 : 1;
  uint32_t p14 : 1;
  uint32_t p15 : 1;
  uint32_t p16 : 1;
  uint32_t p17 : 1;
  uint32_t p18 : 1;
  uint32_t p19 : 1;
  uint32_t p20 : 1;
  uint32_t p21 : 1;
  uint32_t p22 : 1;
  uint32_t p23 : 1;
  uint32_t p24 : 1;
  uint32_t p25 : 1;
  uint32_t p26 : 1;
  uint32_t p27 : 1;
  uint32_t p28 : 1;
  uint32_t p29 : 1;
  uint32_t p30 : 1;
  uint32_t p31 : 1;
};

#define PORTB_CTRL	MMIO_REG(0x400028a4, int32_t)

#define PORTB_WRCONFIG	MMIO_REG(0x400028a8, int32_t)
#define PORTB_WRCONFIG_PINMASK(x)	((x) << 0)
#define PORTB_WRCONFIG_PINMASK_MSK	0x0000ffff
#define PORTB_WRCONFIG_PINMASK_VAL(x)	(((x) >> 0) & 0xffff)
#define PORTB_WRCONFIG_PMUXEN	(1 << 16)
#define PORTB_WRCONFIG_INEN	(1 << 17)
#define PORTB_WRCONFIG_PULLEN	(1 << 18)
#define PORTB_WRCONFIG_PMUX(x)	((x) << 24)
#define PORTB_WRCONFIG_PMUX_MSK	0x0f000000
#define PORTB_WRCONFIG_PMUX_VAL(x)	(((x) >> 24) & 0xf)
#define PORTB_WRCONFIG_WRPMUX	(1 << 28)
#define PORTB_WRCONFIG_WRPINCFG	(1 << 30)
#define PORTB_WRCONFIG_HWSEL	(1 << 31)

