cepawiel/OpenGDEMU/CPU/submodules/microchip-asf/thirdparty/wireless/addons/boot/bootloader/cortexm0+/include/atsamr30.h
#define PORTB_WRCONFIG_s    MMIO_REG(0x400028a8, struct __struct_PORTB_WRCONFIG)
struct __struct_PORTB_WRCONFIG
{
  uint32_t pinmask : 16;
  uint32_t pmuxen : 1;
  uint32_t inen : 1;
  uint32_t pullen : 1;
  uint32_t  : 5;
  uint32_t pmux : 4;
  uint32_t wrpmux : 1;
  uint32_t  : 1;
  uint32_t wrpincfg : 1;
  uint32_t hwsel : 1;
};

#define PORTB_PMUX0	MMIO_REG(0x400028b0, uint8_t)
#define PORTB_PMUX0_PMUXE(x)	((x) << 0)
#define PORTB_PMUX0_PMUXE_MSK	0x0000000f
#define PORTB_PMUX0_PMUXE_VAL(x)	(((x) >> 0) & 0xf)
#define PORTB_PMUX0_PMUXO(x)	((x) << 4)
#define PORTB_PMUX0_PMUXO_MSK	0x000000f0
#define PORTB_PMUX0_PMUXO_VAL(x)	(((x) >> 4) & 0xf)

#define PORTB_PMUX0_s    MMIO_REG(0x400028b0, struct __struct_PORTB_PMUX0)
struct __struct_PORTB_PMUX0
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTB_PMUX1	MMIO_REG(0x400028b1, uint8_t)
#define PORTB_PMUX1_PMUXE(x)	((x) << 0)
#define PORTB_PMUX1_PMUXE_MSK	0x0000000f
#define PORTB_PMUX1_PMUXE_VAL(x)	(((x) >> 0) & 0xf)
#define PORTB_PMUX1_PMUXO(x)	((x) << 4)
#define PORTB_PMUX1_PMUXO_MSK	0x000000f0
#define PORTB_PMUX1_PMUXO_VAL(x)	(((x) >> 4) & 0xf)

#define PORTB_PMUX1_s    MMIO_REG(0x400028b1, struct __struct_PORTB_PMUX1)
struct __struct_PORTB_PMUX1
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTB_PMUX2	MMIO_REG(0x400028b2, uint8_t)
#define PORTB_PMUX2_PMUXE(x)	((x) << 0)
#define PORTB_PMUX2_PMUXE_MSK	0x0000000f
#define PORTB_PMUX2_PMUXE_VAL(x)	(((x) >> 0) & 0xf)
#define PORTB_PMUX2_PMUXO(x)	((x) << 4)
#define PORTB_PMUX2_PMUXO_MSK	0x000000f0
#define PORTB_PMUX2_PMUXO_VAL(x)	(((x) >> 4) & 0xf)

#define PORTB_PMUX2_s    MMIO_REG(0x400028b2, struct __struct_PORTB_PMUX2)
struct __struct_PORTB_PMUX2
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTB_PMUX3	MMIO_REG(0x400028b3, uint8_t)
#define PORTB_PMUX3_PMUXE(x)	((x) << 0)
#define PORTB_PMUX3_PMUXE_MSK	0x0000000f
#define PORTB_PMUX3_PMUXE_VAL(x)	(((x) >> 0) & 0xf)
#define PORTB_PMUX3_PMUXO(x)	((x) << 4)
#define PORTB_PMUX3_PMUXO_MSK	0x000000f0
#define PORTB_PMUX3_PMUXO_VAL(x)	(((x) >> 4) & 0xf)

#define PORTB_PMUX3_s    MMIO_REG(0x400028b3, struct __struct_PORTB_PMUX3)
struct __struct_PORTB_PMUX3
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTB_PMUX4	MMIO_REG(0x400028b4, uint8_t)
#define PORTB_PMUX4_PMUXE(x)	((x) << 0)
#define PORTB_PMUX4_PMUXE_MSK	0x0000000f
#define PORTB_PMUX4_PMUXE_VAL(x)	(((x) >> 0) & 0xf)
#define PORTB_PMUX4_PMUXO(x)	((x) << 4)
#define PORTB_PMUX4_PMUXO_MSK	0x000000f0
#define PORTB_PMUX4_PMUXO_VAL(x)	(((x) >> 4) & 0xf)

#define PORTB_PMUX4_s    MMIO_REG(0x400028b4, struct __struct_PORTB_PMUX4)
struct __struct_PORTB_PMUX4
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTB_PMUX5	MMIO_REG(0x400028b5, uint8_t)
#define PORTB_PMUX5_PMUXE(x)	((x) << 0)
#define PORTB_PMUX5_PMUXE_MSK	0x0000000f
#define PORTB_PMUX5_PMUXE_VAL(x)	(((x) >> 0) & 0xf)
#define PORTB_PMUX5_PMUXO(x)	((x) << 4)
#define PORTB_PMUX5_PMUXO_MSK	0x000000f0
#define PORTB_PMUX5_PMUXO_VAL(x)	(((x) >> 4) & 0xf)

#define PORTB_PMUX5_s    MMIO_REG(0x400028b5, struct __struct_PORTB_PMUX5)
struct __struct_PORTB_PMUX5
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTB_PMUX6	MMIO_REG(0x400028b6, uint8_t)
#define PORTB_PMUX6_PMUXE(x)	((x) << 0)
#define PORTB_PMUX6_PMUXE_MSK	0x0000000f
#define PORTB_PMUX6_PMUXE_VAL(x)	(((x) >> 0) & 0xf)
#define PORTB_PMUX6_PMUXO(x)	((x) << 4)
#define PORTB_PMUX6_PMUXO_MSK	0x000000f0
#define PORTB_PMUX6_PMUXO_VAL(x)	(((x) >> 4) & 0xf)

#define PORTB_PMUX6_s    MMIO_REG(0x400028b6, struct __struct_PORTB_PMUX6)
struct __struct_PORTB_PMUX6
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTB_PMUX7	MMIO_REG(0x400028b7, uint8_t)
#define PORTB_PMUX7_PMUXE(x)	((x) << 0)
#define PORTB_PMUX7_PMUXE_MSK	0x0000000f
#define PORTB_PMUX7_PMUXE_VAL(x)	(((x) >> 0) & 0xf)
#define PORTB_PMUX7_PMUXO(x)	((x) << 4)
#define PORTB_PMUX7_PMUXO_MSK	0x000000f0
#define PORTB_PMUX7_PMUXO_VAL(x)	(((x) >> 4) & 0xf)

#define PORTB_PMUX7_s    MMIO_REG(0x400028b7, struct __struct_PORTB_PMUX7)
struct __struct_PORTB_PMUX7
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTB_PMUX8	MMIO_REG(0x400028b8, uint8_t)
#define PORTB_PMUX8_PMUXE(x)	((x) << 0)
#define PORTB_PMUX8_PMUXE_MSK	0x0000000f
#define PORTB_PMUX8_PMUXE_VAL(x)	(((x) >> 0) & 0xf)
#define PORTB_PMUX8_PMUXO(x)	((x) << 4)
#define PORTB_PMUX8_PMUXO_MSK	0x000000f0
#define PORTB_PMUX8_PMUXO_VAL(x)	(((x) >> 4) & 0xf)

#define PORTB_PMUX8_s    MMIO_REG(0x400028b8, struct __struct_PORTB_PMUX8)
struct __struct_PORTB_PMUX8
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTB_PMUX9	MMIO_REG(0x400028b9, uint8_t)
#define PORTB_PMUX9_PMUXE(x)	((x) << 0)
#define PORTB_PMUX9_PMUXE_MSK	0x0000000f
#define PORTB_PMUX9_PMUXE_VAL(x)	(((x) >> 0) & 0xf)
#define PORTB_PMUX9_PMUXO(x)	((x) << 4)
#define PORTB_PMUX9_PMUXO_MSK	0x000000f0
#define PORTB_PMUX9_PMUXO_VAL(x)	(((x) >> 4) & 0xf)

#define PORTB_PMUX9_s    MMIO_REG(0x400028b9, struct __struct_PORTB_PMUX9)
struct __struct_PORTB_PMUX9
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTB_PMUX10	MMIO_REG(0x400028ba, uint8_t)
#define PORTB_PMUX10_PMUXE(x)	((x) << 0)
#define PORTB_PMUX10_PMUXE_MSK	0x0000000f
#define PORTB_PMUX10_PMUXE_VAL(x)	(((x) >> 0) & 0xf)
#define PORTB_PMUX10_PMUXO(x)	((x) << 4)
#define PORTB_PMUX10_PMUXO_MSK	0x000000f0
#define PORTB_PMUX10_PMUXO_VAL(x)	(((x) >> 4) & 0xf)

#define PORTB_PMUX10_s    MMIO_REG(0x400028ba, struct __struct_PORTB_PMUX10)
struct __struct_PORTB_PMUX10
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTB_PMUX11	MMIO_REG(0x400028bb, uint8_t)
#define PORTB_PMUX11_PMUXE(x)	((x) << 0)
#define PORTB_PMUX11_PMUXE_MSK	0x0000000f
#define PORTB_PMUX11_PMUXE_VAL(x)	(((x) >> 0) & 0xf)
#define PORTB_PMUX11_PMUXO(x)	((x) << 4)
#define PORTB_PMUX11_PMUXO_MSK	0x000000f0
#define PORTB_PMUX11_PMUXO_VAL(x)	(((x) >> 4) & 0xf)

#define PORTB_PMUX11_s    MMIO_REG(0x400028bb, struct __struct_PORTB_PMUX11)
struct __struct_PORTB_PMUX11
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTB_PMUX12	MMIO_REG(0x400028bc, uint8_t)
#define PORTB_PMUX12_PMUXE(x)	((x) << 0)
#define PORTB_PMUX12_PMUXE_MSK	0x0000000f
#define PORTB_PMUX12_PMUXE_VAL(x)	(((x) >> 0) & 0xf)
#define PORTB_PMUX12_PMUXO(x)	((x) << 4)
#define PORTB_PMUX12_PMUXO_MSK	0x000000f0
#define PORTB_PMUX12_PMUXO_VAL(x)	(((x) >> 4) & 0xf)

#define PORTB_PMUX12_s    MMIO_REG(0x400028bc, struct __struct_PORTB_PMUX12)
struct __struct_PORTB_PMUX12
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTB_PMUX13	MMIO_REG(0x400028bd, uint8_t)
#define PORTB_PMUX13_PMUXE(x)	((x) << 0)
#define PORTB_PMUX13_PMUXE_MSK	0x0000000f
#define PORTB_PMUX13_PMUXE_VAL(x)	(((x) >> 0) & 0xf)
#define PORTB_PMUX13_PMUXO(x)	((x) << 4)
#define PORTB_PMUX13_PMUXO_MSK	0x000000f0
#define PORTB_PMUX13_PMUXO_VAL(x)	(((x) >> 4) & 0xf)

#define PORTB_PMUX13_s    MMIO_REG(0x400028bd, struct __struct_PORTB_PMUX13)
struct __struct_PORTB_PMUX13
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

