cepawiel/OpenGDEMU/CPU/submodules/microchip-asf/thirdparty/wireless/addons/boot/bootloader/cortexm0+/include/atsamr30.h
#define PORTB_PMUX14	MMIO_REG(0x400028be, uint8_t)
#define PORTB_PMUX14_PMUXE(x)	((x) << 0)
#define PORTB_PMUX14_PMUXE_MSK	0x0000000f
#define PORTB_PMUX14_PMUXE_VAL(x)	(((x) >> 0) & 0xf)
#define PORTB_PMUX14_PMUXO(x)	((x) << 4)
#define PORTB_PMUX14_PMUXO_MSK	0x000000f0
#define PORTB_PMUX14_PMUXO_VAL(x)	(((x) >> 4) & 0xf)

#define PORTB_PMUX14_s    MMIO_REG(0x400028be, struct __struct_PORTB_PMUX14)
struct __struct_PORTB_PMUX14
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTB_PMUX15	MMIO_REG(0x400028bf, uint8_t)
#define PORTB_PMUX15_PMUXE(x)	((x) << 0)
#define PORTB_PMUX15_PMUXE_MSK	0x0000000f
#define PORTB_PMUX15_PMUXE_VAL(x)	(((x) >> 0) & 0xf)
#define PORTB_PMUX15_PMUXO(x)	((x) << 4)
#define PORTB_PMUX15_PMUXO_MSK	0x000000f0
#define PORTB_PMUX15_PMUXO_VAL(x)	(((x) >> 4) & 0xf)

#define PORTB_PMUX15_s    MMIO_REG(0x400028bf, struct __struct_PORTB_PMUX15)
struct __struct_PORTB_PMUX15
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTB_PINCFG0	MMIO_REG(0x400028c0, uint8_t)
#define PORTB_PINCFG0_PMUXEN	(1 << 0)
#define PORTB_PINCFG0_INEN	(1 << 1)
#define PORTB_PINCFG0_PULLEN	(1 << 2)

#define PORTB_PINCFG0_s    MMIO_REG(0x400028c0, struct __struct_PORTB_PINCFG0)
struct __struct_PORTB_PINCFG0
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTB_PINCFG1	MMIO_REG(0x400028c1, uint8_t)
#define PORTB_PINCFG1_PMUXEN	(1 << 0)
#define PORTB_PINCFG1_INEN	(1 << 1)
#define PORTB_PINCFG1_PULLEN	(1 << 2)

#define PORTB_PINCFG1_s    MMIO_REG(0x400028c1, struct __struct_PORTB_PINCFG1)
struct __struct_PORTB_PINCFG1
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTB_PINCFG2	MMIO_REG(0x400028c2, uint8_t)
#define PORTB_PINCFG2_PMUXEN	(1 << 0)
#define PORTB_PINCFG2_INEN	(1 << 1)
#define PORTB_PINCFG2_PULLEN	(1 << 2)

#define PORTB_PINCFG2_s    MMIO_REG(0x400028c2, struct __struct_PORTB_PINCFG2)
struct __struct_PORTB_PINCFG2
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTB_PINCFG3	MMIO_REG(0x400028c3, uint8_t)
#define PORTB_PINCFG3_PMUXEN	(1 << 0)
#define PORTB_PINCFG3_INEN	(1 << 1)
#define PORTB_PINCFG3_PULLEN	(1 << 2)

#define PORTB_PINCFG3_s    MMIO_REG(0x400028c3, struct __struct_PORTB_PINCFG3)
struct __struct_PORTB_PINCFG3
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTB_PINCFG4	MMIO_REG(0x400028c4, uint8_t)
#define PORTB_PINCFG4_PMUXEN	(1 << 0)
#define PORTB_PINCFG4_INEN	(1 << 1)
#define PORTB_PINCFG4_PULLEN	(1 << 2)

#define PORTB_PINCFG4_s    MMIO_REG(0x400028c4, struct __struct_PORTB_PINCFG4)
struct __struct_PORTB_PINCFG4
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTB_PINCFG5	MMIO_REG(0x400028c5, uint8_t)
#define PORTB_PINCFG5_PMUXEN	(1 << 0)
#define PORTB_PINCFG5_INEN	(1 << 1)
#define PORTB_PINCFG5_PULLEN	(1 << 2)

#define PORTB_PINCFG5_s    MMIO_REG(0x400028c5, struct __struct_PORTB_PINCFG5)
struct __struct_PORTB_PINCFG5
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTB_PINCFG6	MMIO_REG(0x400028c6, uint8_t)
#define PORTB_PINCFG6_PMUXEN	(1 << 0)
#define PORTB_PINCFG6_INEN	(1 << 1)
#define PORTB_PINCFG6_PULLEN	(1 << 2)

#define PORTB_PINCFG6_s    MMIO_REG(0x400028c6, struct __struct_PORTB_PINCFG6)
struct __struct_PORTB_PINCFG6
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTB_PINCFG7	MMIO_REG(0x400028c7, uint8_t)
#define PORTB_PINCFG7_PMUXEN	(1 << 0)
#define PORTB_PINCFG7_INEN	(1 << 1)
#define PORTB_PINCFG7_PULLEN	(1 << 2)

#define PORTB_PINCFG7_s    MMIO_REG(0x400028c7, struct __struct_PORTB_PINCFG7)
struct __struct_PORTB_PINCFG7
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTB_PINCFG8	MMIO_REG(0x400028c8, uint8_t)
#define PORTB_PINCFG8_PMUXEN	(1 << 0)
#define PORTB_PINCFG8_INEN	(1 << 1)
#define PORTB_PINCFG8_PULLEN	(1 << 2)

#define PORTB_PINCFG8_s    MMIO_REG(0x400028c8, struct __struct_PORTB_PINCFG8)
struct __struct_PORTB_PINCFG8
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTB_PINCFG9	MMIO_REG(0x400028c9, uint8_t)
#define PORTB_PINCFG9_PMUXEN	(1 << 0)
#define PORTB_PINCFG9_INEN	(1 << 1)
#define PORTB_PINCFG9_PULLEN	(1 << 2)

#define PORTB_PINCFG9_s    MMIO_REG(0x400028c9, struct __struct_PORTB_PINCFG9)
struct __struct_PORTB_PINCFG9
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTB_PINCFG10	MMIO_REG(0x400028ca, uint8_t)
#define PORTB_PINCFG10_PMUXEN	(1 << 0)
#define PORTB_PINCFG10_INEN	(1 << 1)
#define PORTB_PINCFG10_PULLEN	(1 << 2)

#define PORTB_PINCFG10_s    MMIO_REG(0x400028ca, struct __struct_PORTB_PINCFG10)
struct __struct_PORTB_PINCFG10
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTB_PINCFG11	MMIO_REG(0x400028cb, uint8_t)
#define PORTB_PINCFG11_PMUXEN	(1 << 0)
#define PORTB_PINCFG11_INEN	(1 << 1)
#define PORTB_PINCFG11_PULLEN	(1 << 2)

#define PORTB_PINCFG11_s    MMIO_REG(0x400028cb, struct __struct_PORTB_PINCFG11)
struct __struct_PORTB_PINCFG11
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTB_PINCFG12	MMIO_REG(0x400028cc, uint8_t)
#define PORTB_PINCFG12_PMUXEN	(1 << 0)
#define PORTB_PINCFG12_INEN	(1 << 1)
#define PORTB_PINCFG12_PULLEN	(1 << 2)

#define PORTB_PINCFG12_s    MMIO_REG(0x400028cc, struct __struct_PORTB_PINCFG12)
struct __struct_PORTB_PINCFG12
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTB_PINCFG13	MMIO_REG(0x400028cd, uint8_t)
#define PORTB_PINCFG13_PMUXEN	(1 << 0)
#define PORTB_PINCFG13_INEN	(1 << 1)
#define PORTB_PINCFG13_PULLEN	(1 << 2)

#define PORTB_PINCFG13_s    MMIO_REG(0x400028cd, struct __struct_PORTB_PINCFG13)
struct __struct_PORTB_PINCFG13
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTB_PINCFG14	MMIO_REG(0x400028ce, uint8_t)
#define PORTB_PINCFG14_PMUXEN	(1 << 0)
#define PORTB_PINCFG14_INEN	(1 << 1)
#define PORTB_PINCFG14_PULLEN	(1 << 2)

#define PORTB_PINCFG14_s    MMIO_REG(0x400028ce, struct __struct_PORTB_PINCFG14)
struct __struct_PORTB_PINCFG14
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTB_PINCFG15	MMIO_REG(0x400028cf, uint8_t)
#define PORTB_PINCFG15_PMUXEN	(1 << 0)
#define PORTB_PINCFG15_INEN	(1 << 1)
#define PORTB_PINCFG15_PULLEN	(1 << 2)

#define PORTB_PINCFG15_s    MMIO_REG(0x400028cf, struct __struct_PORTB_PINCFG15)
struct __struct_PORTB_PINCFG15
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTB_PINCFG16	MMIO_REG(0x400028d0, uint8_t)
#define PORTB_PINCFG16_PMUXEN	(1 << 0)
#define PORTB_PINCFG16_INEN	(1 << 1)
#define PORTB_PINCFG16_PULLEN	(1 << 2)

#define PORTB_PINCFG16_s    MMIO_REG(0x400028d0, struct __struct_PORTB_PINCFG16)
struct __struct_PORTB_PINCFG16
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

