cepawiel/OpenGDEMU/CPU/submodules/microchip-asf/thirdparty/wireless/addons/boot/bootloader/cortexm0+/include/atsamr30.h
#define PORTB_PINCFG17	MMIO_REG(0x400028d1, uint8_t)
#define PORTB_PINCFG17_PMUXEN	(1 << 0)
#define PORTB_PINCFG17_INEN	(1 << 1)
#define PORTB_PINCFG17_PULLEN	(1 << 2)

#define PORTB_PINCFG17_s    MMIO_REG(0x400028d1, struct __struct_PORTB_PINCFG17)
struct __struct_PORTB_PINCFG17
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTB_PINCFG18	MMIO_REG(0x400028d2, uint8_t)
#define PORTB_PINCFG18_PMUXEN	(1 << 0)
#define PORTB_PINCFG18_INEN	(1 << 1)
#define PORTB_PINCFG18_PULLEN	(1 << 2)

#define PORTB_PINCFG18_s    MMIO_REG(0x400028d2, struct __struct_PORTB_PINCFG18)
struct __struct_PORTB_PINCFG18
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTB_PINCFG19	MMIO_REG(0x400028d3, uint8_t)
#define PORTB_PINCFG19_PMUXEN	(1 << 0)
#define PORTB_PINCFG19_INEN	(1 << 1)
#define PORTB_PINCFG19_PULLEN	(1 << 2)

#define PORTB_PINCFG19_s    MMIO_REG(0x400028d3, struct __struct_PORTB_PINCFG19)
struct __struct_PORTB_PINCFG19
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTB_PINCFG20	MMIO_REG(0x400028d4, uint8_t)
#define PORTB_PINCFG20_PMUXEN	(1 << 0)
#define PORTB_PINCFG20_INEN	(1 << 1)
#define PORTB_PINCFG20_PULLEN	(1 << 2)

#define PORTB_PINCFG20_s    MMIO_REG(0x400028d4, struct __struct_PORTB_PINCFG20)
struct __struct_PORTB_PINCFG20
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTB_PINCFG21	MMIO_REG(0x400028d5, uint8_t)
#define PORTB_PINCFG21_PMUXEN	(1 << 0)
#define PORTB_PINCFG21_INEN	(1 << 1)
#define PORTB_PINCFG21_PULLEN	(1 << 2)

#define PORTB_PINCFG21_s    MMIO_REG(0x400028d5, struct __struct_PORTB_PINCFG21)
struct __struct_PORTB_PINCFG21
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTB_PINCFG22	MMIO_REG(0x400028d6, uint8_t)
#define PORTB_PINCFG22_PMUXEN	(1 << 0)
#define PORTB_PINCFG22_INEN	(1 << 1)
#define PORTB_PINCFG22_PULLEN	(1 << 2)

#define PORTB_PINCFG22_s    MMIO_REG(0x400028d6, struct __struct_PORTB_PINCFG22)
struct __struct_PORTB_PINCFG22
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTB_PINCFG23	MMIO_REG(0x400028d7, uint8_t)
#define PORTB_PINCFG23_PMUXEN	(1 << 0)
#define PORTB_PINCFG23_INEN	(1 << 1)
#define PORTB_PINCFG23_PULLEN	(1 << 2)

#define PORTB_PINCFG23_s    MMIO_REG(0x400028d7, struct __struct_PORTB_PINCFG23)
struct __struct_PORTB_PINCFG23
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTB_PINCFG24	MMIO_REG(0x400028d8, uint8_t)
#define PORTB_PINCFG24_PMUXEN	(1 << 0)
#define PORTB_PINCFG24_INEN	(1 << 1)
#define PORTB_PINCFG24_PULLEN	(1 << 2)

#define PORTB_PINCFG24_s    MMIO_REG(0x400028d8, struct __struct_PORTB_PINCFG24)
struct __struct_PORTB_PINCFG24
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTB_PINCFG25	MMIO_REG(0x400028d9, uint8_t)
#define PORTB_PINCFG25_PMUXEN	(1 << 0)
#define PORTB_PINCFG25_INEN	(1 << 1)
#define PORTB_PINCFG25_PULLEN	(1 << 2)

#define PORTB_PINCFG25_s    MMIO_REG(0x400028d9, struct __struct_PORTB_PINCFG25)
struct __struct_PORTB_PINCFG25
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTB_PINCFG26	MMIO_REG(0x400028da, uint8_t)
#define PORTB_PINCFG26_PMUXEN	(1 << 0)
#define PORTB_PINCFG26_INEN	(1 << 1)
#define PORTB_PINCFG26_PULLEN	(1 << 2)

#define PORTB_PINCFG26_s    MMIO_REG(0x400028da, struct __struct_PORTB_PINCFG26)
struct __struct_PORTB_PINCFG26
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTB_PINCFG27	MMIO_REG(0x400028db, uint8_t)
#define PORTB_PINCFG27_PMUXEN	(1 << 0)
#define PORTB_PINCFG27_INEN	(1 << 1)
#define PORTB_PINCFG27_PULLEN	(1 << 2)

#define PORTB_PINCFG27_s    MMIO_REG(0x400028db, struct __struct_PORTB_PINCFG27)
struct __struct_PORTB_PINCFG27
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTB_PINCFG28	MMIO_REG(0x400028dc, uint8_t)
#define PORTB_PINCFG28_PMUXEN	(1 << 0)
#define PORTB_PINCFG28_INEN	(1 << 1)
#define PORTB_PINCFG28_PULLEN	(1 << 2)

#define PORTB_PINCFG28_s    MMIO_REG(0x400028dc, struct __struct_PORTB_PINCFG28)
struct __struct_PORTB_PINCFG28
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTB_PINCFG29	MMIO_REG(0x400028dd, uint8_t)
#define PORTB_PINCFG29_PMUXEN	(1 << 0)
#define PORTB_PINCFG29_INEN	(1 << 1)
#define PORTB_PINCFG29_PULLEN	(1 << 2)

#define PORTB_PINCFG29_s    MMIO_REG(0x400028dd, struct __struct_PORTB_PINCFG29)
struct __struct_PORTB_PINCFG29
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTB_PINCFG30	MMIO_REG(0x400028de, uint8_t)
#define PORTB_PINCFG30_PMUXEN	(1 << 0)
#define PORTB_PINCFG30_INEN	(1 << 1)
#define PORTB_PINCFG30_PULLEN	(1 << 2)

#define PORTB_PINCFG30_s    MMIO_REG(0x400028de, struct __struct_PORTB_PINCFG30)
struct __struct_PORTB_PINCFG30
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTB_PINCFG31	MMIO_REG(0x400028df, uint8_t)
#define PORTB_PINCFG31_PMUXEN	(1 << 0)
#define PORTB_PINCFG31_INEN	(1 << 1)
#define PORTB_PINCFG31_PULLEN	(1 << 2)

#define PORTB_PINCFG31_s    MMIO_REG(0x400028df, struct __struct_PORTB_PINCFG31)
struct __struct_PORTB_PINCFG31
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

// 0x40002900 PORTC

#define PORTC_DIR MMIO_REG(0x40002900, uint32_t)
#define PORTC_DIR_P0  (1 << 0)
#define PORTC_DIR_P1  (1 << 1)
#define PORTC_DIR_P2  (1 << 2)
#define PORTC_DIR_P3  (1 << 3)
#define PORTC_DIR_P4  (1 << 4)
#define PORTC_DIR_P5  (1 << 5)
#define PORTC_DIR_P6  (1 << 6)
#define PORTC_DIR_P7  (1 << 7)
#define PORTC_DIR_P8  (1 << 8)
#define PORTC_DIR_P9  (1 << 9)
#define PORTC_DIR_P10 (1 << 10)
#define PORTC_DIR_P11 (1 << 11)
#define PORTC_DIR_P12 (1 << 12)
#define PORTC_DIR_P13 (1 << 13)
#define PORTC_DIR_P14 (1 << 14)
#define PORTC_DIR_P15 (1 << 15)
#define PORTC_DIR_P16 (1 << 16)
#define PORTC_DIR_P17 (1 << 17)
#define PORTC_DIR_P18 (1 << 18)
#define PORTC_DIR_P19 (1 << 19)
#define PORTC_DIR_P20 (1 << 20)
#define PORTC_DIR_P21 (1 << 21)
#define PORTC_DIR_P22 (1 << 22)
#define PORTC_DIR_P23 (1 << 23)
#define PORTC_DIR_P24 (1 << 24)
#define PORTC_DIR_P25 (1 << 25)
#define PORTC_DIR_P26 (1 << 26)
#define PORTC_DIR_P27 (1 << 27)
#define PORTC_DIR_P28 (1 << 28)
#define PORTC_DIR_P29 (1 << 29)
#define PORTC_DIR_P30 (1 << 30)
#define PORTC_DIR_P31 (1 << 31)

#define PORTC_DIR_s    MMIO_REG(0x40002900, struct __struct_PORTC_DIR)
struct __struct_PORTC_DIR
{
  uint32_t p0 : 1;
  uint32_t p1 : 1;
  uint32_t p2 : 1;
  uint32_t p3 : 1;
  uint32_t p4 : 1;
  uint32_t p5 : 1;
  uint32_t p6 : 1;
  uint32_t p7 : 1;
  uint32_t p8 : 1;
  uint32_t p9 : 1;
  uint32_t p10 : 1;
  uint32_t p11 : 1;
  uint32_t p12 : 1;
  uint32_t p13 : 1;
  uint32_t p14 : 1;
  uint32_t p15 : 1;
  uint32_t p16 : 1;
  uint32_t p17 : 1;
  uint32_t p18 : 1;
  uint32_t p19 : 1;
  uint32_t p20 : 1;
  uint32_t p21 : 1;
  uint32_t p22 : 1;
  uint32_t p23 : 1;
  uint32_t p24 : 1;
  uint32_t p25 : 1;
  uint32_t p26 : 1;
  uint32_t p27 : 1;
  uint32_t p28 : 1;
  uint32_t p29 : 1;
  uint32_t p30 : 1;
  uint32_t p31 : 1;
};

