cepawiel/OpenGDEMU/CPU/submodules/microchip-asf/thirdparty/wireless/addons/boot/bootloader/cortexm0+/include/atsamr30.h
#define PORTC_CTRL  MMIO_REG(0x40002924, uint32_t)

#define PORTC_WRCONFIG  MMIO_REG(0x40002928, uint32_t)
#define PORTC_WRCONFIG_PINMASK(x) ((x) << 0)
#define PORTC_WRCONFIG_PINMASK_MSK  0x0000ffff
#define PORTC_WRCONFIG_PINMASK_VAL(x) (((x) >> 0) & 0xffff)
#define PORTC_WRCONFIG_PMUXEN (1 << 16)
#define PORTC_WRCONFIG_INEN (1 << 17)
#define PORTC_WRCONFIG_PULLEN (1 << 18)
#define PORTC_WRCONFIG_PMUX(x)  ((x) << 24)
#define PORTC_WRCONFIG_PMUX_MSK 0x0f000000
#define PORTC_WRCONFIG_PMUX_VAL(x)  (((x) >> 24) & 0xf)
#define PORTC_WRCONFIG_WRPMUX (1 << 28)
#define PORTC_WRCONFIG_WRPINCFG (1 << 30)
#define PORTC_WRCONFIG_HWSEL  (1 << 31)

#define PORTC_WRCONFIG_s    MMIO_REG(0x40002928, struct __struct_PORTC_WRCONFIG)
struct __struct_PORTC_WRCONFIG
{
  uint32_t pinmask : 16;
  uint32_t pmuxen : 1;
  uint32_t inen : 1;
  uint32_t pullen : 1;
  uint32_t  : 5;
  uint32_t pmux : 4;
  uint32_t wrpmux : 1;
  uint32_t  : 1;
  uint32_t wrpincfg : 1;
  uint32_t hwsel : 1;
};

#define PORTC_PMUX0 MMIO_REG(0x40002930, uint8_t)
#define PORTC_PMUX0_PMUXE(x)  ((x) << 0)
#define PORTC_PMUX0_PMUXE_MSK 0x0000000f
#define PORTC_PMUX0_PMUXE_VAL(x)  (((x) >> 0) & 0xf)
#define PORTC_PMUX0_PMUXO(x)  ((x) << 4)
#define PORTC_PMUX0_PMUXO_MSK 0x000000f0
#define PORTC_PMUX0_PMUXO_VAL(x)  (((x) >> 4) & 0xf)

#define PORTC_PMUX0_s    MMIO_REG(0x40002930, struct __struct_PORTC_PMUX0)
struct __struct_PORTC_PMUX0
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTC_PMUX1 MMIO_REG(0x40002931, uint8_t)
#define PORTC_PMUX1_PMUXE(x)  ((x) << 0)
#define PORTC_PMUX1_PMUXE_MSK 0x0000000f
#define PORTC_PMUX1_PMUXE_VAL(x)  (((x) >> 0) & 0xf)
#define PORTC_PMUX1_PMUXO(x)  ((x) << 4)
#define PORTC_PMUX1_PMUXO_MSK 0x000000f0
#define PORTC_PMUX1_PMUXO_VAL(x)  (((x) >> 4) & 0xf)

#define PORTC_PMUX1_s    MMIO_REG(0x40002931, struct __struct_PORTC_PMUX1)
struct __struct_PORTC_PMUX1
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTC_PMUX2 MMIO_REG(0x40002932, uint8_t)
#define PORTC_PMUX2_PMUXE(x)  ((x) << 0)
#define PORTC_PMUX2_PMUXE_MSK 0x0000000f
#define PORTC_PMUX2_PMUXE_VAL(x)  (((x) >> 0) & 0xf)
#define PORTC_PMUX2_PMUXO(x)  ((x) << 4)
#define PORTC_PMUX2_PMUXO_MSK 0x000000f0
#define PORTC_PMUX2_PMUXO_VAL(x)  (((x) >> 4) & 0xf)

#define PORTC_PMUX2_s    MMIO_REG(0x40002932, struct __struct_PORTC_PMUX2)
struct __struct_PORTC_PMUX2
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTC_PMUX3 MMIO_REG(0x40002933, uint8_t)
#define PORTC_PMUX3_PMUXE(x)  ((x) << 0)
#define PORTC_PMUX3_PMUXE_MSK 0x0000000f
#define PORTC_PMUX3_PMUXE_VAL(x)  (((x) >> 0) & 0xf)
#define PORTC_PMUX3_PMUXO(x)  ((x) << 4)
#define PORTC_PMUX3_PMUXO_MSK 0x000000f0
#define PORTC_PMUX3_PMUXO_VAL(x)  (((x) >> 4) & 0xf)

#define PORTC_PMUX3_s    MMIO_REG(0x40002933, struct __struct_PORTC_PMUX3)
struct __struct_PORTC_PMUX3
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTC_PMUX4 MMIO_REG(0x40002934, uint8_t)
#define PORTC_PMUX4_PMUXE(x)  ((x) << 0)
#define PORTC_PMUX4_PMUXE_MSK 0x0000000f
#define PORTC_PMUX4_PMUXE_VAL(x)  (((x) >> 0) & 0xf)
#define PORTC_PMUX4_PMUXO(x)  ((x) << 4)
#define PORTC_PMUX4_PMUXO_MSK 0x000000f0
#define PORTC_PMUX4_PMUXO_VAL(x)  (((x) >> 4) & 0xf)

#define PORTC_PMUX4_s    MMIO_REG(0x40002934, struct __struct_PORTC_PMUX4)
struct __struct_PORTC_PMUX4
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTC_PMUX5 MMIO_REG(0x40002935, uint8_t)
#define PORTC_PMUX5_PMUXE(x)  ((x) << 0)
#define PORTC_PMUX5_PMUXE_MSK 0x0000000f
#define PORTC_PMUX5_PMUXE_VAL(x)  (((x) >> 0) & 0xf)
#define PORTC_PMUX5_PMUXO(x)  ((x) << 4)
#define PORTC_PMUX5_PMUXO_MSK 0x000000f0
#define PORTC_PMUX5_PMUXO_VAL(x)  (((x) >> 4) & 0xf)

#define PORTC_PMUX5_s    MMIO_REG(0x40002935, struct __struct_PORTC_PMUX5)
struct __struct_PORTC_PMUX5
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTC_PMUX6 MMIO_REG(0x40002936, uint8_t)
#define PORTC_PMUX6_PMUXE(x)  ((x) << 0)
#define PORTC_PMUX6_PMUXE_MSK 0x0000000f
#define PORTC_PMUX6_PMUXE_VAL(x)  (((x) >> 0) & 0xf)
#define PORTC_PMUX6_PMUXO(x)  ((x) << 4)
#define PORTC_PMUX6_PMUXO_MSK 0x000000f0
#define PORTC_PMUX6_PMUXO_VAL(x)  (((x) >> 4) & 0xf)

#define PORTC_PMUX6_s    MMIO_REG(0x40002936, struct __struct_PORTC_PMUX6)
struct __struct_PORTC_PMUX6
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTC_PMUX7 MMIO_REG(0x40002937, uint8_t)
#define PORTC_PMUX7_PMUXE(x)  ((x) << 0)
#define PORTC_PMUX7_PMUXE_MSK 0x0000000f
#define PORTC_PMUX7_PMUXE_VAL(x)  (((x) >> 0) & 0xf)
#define PORTC_PMUX7_PMUXO(x)  ((x) << 4)
#define PORTC_PMUX7_PMUXO_MSK 0x000000f0
#define PORTC_PMUX7_PMUXO_VAL(x)  (((x) >> 4) & 0xf)

#define PORTC_PMUX7_s    MMIO_REG(0x40002937, struct __struct_PORTC_PMUX7)
struct __struct_PORTC_PMUX7
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTC_PMUX8 MMIO_REG(0x40002938, uint8_t)
#define PORTC_PMUX8_PMUXE(x)  ((x) << 0)
#define PORTC_PMUX8_PMUXE_MSK 0x0000000f
#define PORTC_PMUX8_PMUXE_VAL(x)  (((x) >> 0) & 0xf)
#define PORTC_PMUX8_PMUXO(x)  ((x) << 4)
#define PORTC_PMUX8_PMUXO_MSK 0x000000f0
#define PORTC_PMUX8_PMUXO_VAL(x)  (((x) >> 4) & 0xf)

#define PORTC_PMUX8_s    MMIO_REG(0x40002938, struct __struct_PORTC_PMUX8)
struct __struct_PORTC_PMUX8
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTC_PMUX9 MMIO_REG(0x40002939, uint8_t)
#define PORTC_PMUX9_PMUXE(x)  ((x) << 0)
#define PORTC_PMUX9_PMUXE_MSK 0x0000000f
#define PORTC_PMUX9_PMUXE_VAL(x)  (((x) >> 0) & 0xf)
#define PORTC_PMUX9_PMUXO(x)  ((x) << 4)
#define PORTC_PMUX9_PMUXO_MSK 0x000000f0
#define PORTC_PMUX9_PMUXO_VAL(x)  (((x) >> 4) & 0xf)

#define PORTC_PMUX9_s    MMIO_REG(0x40002939, struct __struct_PORTC_PMUX9)
struct __struct_PORTC_PMUX9
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTC_PMUX10  MMIO_REG(0x4000293a, uint8_t)
#define PORTC_PMUX10_PMUXE(x) ((x) << 0)
#define PORTC_PMUX10_PMUXE_MSK  0x0000000f
#define PORTC_PMUX10_PMUXE_VAL(x) (((x) >> 0) & 0xf)
#define PORTC_PMUX10_PMUXO(x) ((x) << 4)
#define PORTC_PMUX10_PMUXO_MSK  0x000000f0
#define PORTC_PMUX10_PMUXO_VAL(x) (((x) >> 4) & 0xf)

#define PORTC_PMUX10_s    MMIO_REG(0x4000293a, struct __struct_PORTC_PMUX10)
struct __struct_PORTC_PMUX10
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTC_PMUX11  MMIO_REG(0x4000293b, uint8_t)
#define PORTC_PMUX11_PMUXE(x) ((x) << 0)
#define PORTC_PMUX11_PMUXE_MSK  0x0000000f
#define PORTC_PMUX11_PMUXE_VAL(x) (((x) >> 0) & 0xf)
#define PORTC_PMUX11_PMUXO(x) ((x) << 4)
#define PORTC_PMUX11_PMUXO_MSK  0x000000f0
#define PORTC_PMUX11_PMUXO_VAL(x) (((x) >> 4) & 0xf)

#define PORTC_PMUX11_s    MMIO_REG(0x4000293b, struct __struct_PORTC_PMUX11)
struct __struct_PORTC_PMUX11
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

