cepawiel/OpenGDEMU/CPU/submodules/microchip-asf/thirdparty/wireless/addons/boot/bootloader/cortexm0+/include/atsamr30.h
#define PORTC_PMUX12  MMIO_REG(0x4000293c, uint8_t)
#define PORTC_PMUX12_PMUXE(x) ((x) << 0)
#define PORTC_PMUX12_PMUXE_MSK  0x0000000f
#define PORTC_PMUX12_PMUXE_VAL(x) (((x) >> 0) & 0xf)
#define PORTC_PMUX12_PMUXO(x) ((x) << 4)
#define PORTC_PMUX12_PMUXO_MSK  0x000000f0
#define PORTC_PMUX12_PMUXO_VAL(x) (((x) >> 4) & 0xf)

#define PORTC_PMUX12_s    MMIO_REG(0x4000293c, struct __struct_PORTC_PMUX12)
struct __struct_PORTC_PMUX12
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTC_PMUX13  MMIO_REG(0x4000293d, uint8_t)
#define PORTC_PMUX13_PMUXE(x) ((x) << 0)
#define PORTC_PMUX13_PMUXE_MSK  0x0000000f
#define PORTC_PMUX13_PMUXE_VAL(x) (((x) >> 0) & 0xf)
#define PORTC_PMUX13_PMUXO(x) ((x) << 4)
#define PORTC_PMUX13_PMUXO_MSK  0x000000f0
#define PORTC_PMUX13_PMUXO_VAL(x) (((x) >> 4) & 0xf)

#define PORTC_PMUX13_s    MMIO_REG(0x4000293d, struct __struct_PORTC_PMUX13)
struct __struct_PORTC_PMUX13
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTC_PMUX14  MMIO_REG(0x4000293e, uint8_t)
#define PORTC_PMUX14_PMUXE(x) ((x) << 0)
#define PORTC_PMUX14_PMUXE_MSK  0x0000000f
#define PORTC_PMUX14_PMUXE_VAL(x) (((x) >> 0) & 0xf)
#define PORTC_PMUX14_PMUXO(x) ((x) << 4)
#define PORTC_PMUX14_PMUXO_MSK  0x000000f0
#define PORTC_PMUX14_PMUXO_VAL(x) (((x) >> 4) & 0xf)

#define PORTC_PMUX14_s    MMIO_REG(0x4000293e, struct __struct_PORTC_PMUX14)
struct __struct_PORTC_PMUX14
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTC_PMUX15  MMIO_REG(0x4000293f, uint8_t)
#define PORTC_PMUX15_PMUXE(x) ((x) << 0)
#define PORTC_PMUX15_PMUXE_MSK  0x0000000f
#define PORTC_PMUX15_PMUXE_VAL(x) (((x) >> 0) & 0xf)
#define PORTC_PMUX15_PMUXO(x) ((x) << 4)
#define PORTC_PMUX15_PMUXO_MSK  0x000000f0
#define PORTC_PMUX15_PMUXO_VAL(x) (((x) >> 4) & 0xf)

#define PORTC_PMUX15_s    MMIO_REG(0x4000293f, struct __struct_PORTC_PMUX15)
struct __struct_PORTC_PMUX15
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTC_PINCFG0 MMIO_REG(0x40002940, uint8_t)
#define PORTC_PINCFG0_PMUXEN  (1 << 0)
#define PORTC_PINCFG0_INEN  (1 << 1)
#define PORTC_PINCFG0_PULLEN  (1 << 2)

#define PORTC_PINCFG0_s    MMIO_REG(0x40002940, struct __struct_PORTC_PINCFG0)
struct __struct_PORTC_PINCFG0
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTC_PINCFG1 MMIO_REG(0x40002941, uint8_t)
#define PORTC_PINCFG1_PMUXEN  (1 << 0)
#define PORTC_PINCFG1_INEN  (1 << 1)
#define PORTC_PINCFG1_PULLEN  (1 << 2)

#define PORTC_PINCFG1_s    MMIO_REG(0x40002941, struct __struct_PORTC_PINCFG1)
struct __struct_PORTC_PINCFG1
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTC_PINCFG2 MMIO_REG(0x40002942, uint8_t)
#define PORTC_PINCFG2_PMUXEN  (1 << 0)
#define PORTC_PINCFG2_INEN  (1 << 1)
#define PORTC_PINCFG2_PULLEN  (1 << 2)

#define PORTC_PINCFG2_s    MMIO_REG(0x40002942, struct __struct_PORTC_PINCFG2)
struct __struct_PORTC_PINCFG2
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTC_PINCFG3 MMIO_REG(0x40002943, uint8_t)
#define PORTC_PINCFG3_PMUXEN  (1 << 0)
#define PORTC_PINCFG3_INEN  (1 << 1)
#define PORTC_PINCFG3_PULLEN  (1 << 2)

#define PORTC_PINCFG3_s    MMIO_REG(0x40002943, struct __struct_PORTC_PINCFG3)
struct __struct_PORTC_PINCFG3
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTC_PINCFG4 MMIO_REG(0x40002944, uint8_t)
#define PORTC_PINCFG4_PMUXEN  (1 << 0)
#define PORTC_PINCFG4_INEN  (1 << 1)
#define PORTC_PINCFG4_PULLEN  (1 << 2)

#define PORTC_PINCFG4_s    MMIO_REG(0x40002944, struct __struct_PORTC_PINCFG4)
struct __struct_PORTC_PINCFG4
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTC_PINCFG5 MMIO_REG(0x40002945, uint8_t)
#define PORTC_PINCFG5_PMUXEN  (1 << 0)
#define PORTC_PINCFG5_INEN  (1 << 1)
#define PORTC_PINCFG5_PULLEN  (1 << 2)

#define PORTC_PINCFG5_s    MMIO_REG(0x40002945, struct __struct_PORTC_PINCFG5)
struct __struct_PORTC_PINCFG5
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTC_PINCFG6 MMIO_REG(0x40002946, uint8_t)
#define PORTC_PINCFG6_PMUXEN  (1 << 0)
#define PORTC_PINCFG6_INEN  (1 << 1)
#define PORTC_PINCFG6_PULLEN  (1 << 2)

#define PORTC_PINCFG6_s    MMIO_REG(0x40002946, struct __struct_PORTC_PINCFG6)
struct __struct_PORTC_PINCFG6
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTC_PINCFG7 MMIO_REG(0x40002947, uint8_t)
#define PORTC_PINCFG7_PMUXEN  (1 << 0)
#define PORTC_PINCFG7_INEN  (1 << 1)
#define PORTC_PINCFG7_PULLEN  (1 << 2)

#define PORTC_PINCFG7_s    MMIO_REG(0x40002947, struct __struct_PORTC_PINCFG7)
struct __struct_PORTC_PINCFG7
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTC_PINCFG8 MMIO_REG(0x40002948, uint8_t)
#define PORTC_PINCFG8_PMUXEN  (1 << 0)
#define PORTC_PINCFG8_INEN  (1 << 1)
#define PORTC_PINCFG8_PULLEN  (1 << 2)

#define PORTC_PINCFG8_s    MMIO_REG(0x40002948, struct __struct_PORTC_PINCFG8)
struct __struct_PORTC_PINCFG8
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTC_PINCFG9 MMIO_REG(0x40002949, uint8_t)
#define PORTC_PINCFG9_PMUXEN  (1 << 0)
#define PORTC_PINCFG9_INEN  (1 << 1)
#define PORTC_PINCFG9_PULLEN  (1 << 2)

#define PORTC_PINCFG9_s    MMIO_REG(0x40002949, struct __struct_PORTC_PINCFG9)
struct __struct_PORTC_PINCFG9
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTC_PINCFG10  MMIO_REG(0x4000294a, uint8_t)
#define PORTC_PINCFG10_PMUXEN (1 << 0)
#define PORTC_PINCFG10_INEN (1 << 1)
#define PORTC_PINCFG10_PULLEN (1 << 2)

#define PORTC_PINCFG10_s    MMIO_REG(0x4000294a, struct __struct_PORTC_PINCFG10)
struct __struct_PORTC_PINCFG10
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTC_PINCFG11  MMIO_REG(0x4000294b, uint8_t)
#define PORTC_PINCFG11_PMUXEN (1 << 0)
#define PORTC_PINCFG11_INEN (1 << 1)
#define PORTC_PINCFG11_PULLEN (1 << 2)

