cepawiel/OpenGDEMU/CPU/submodules/microchip-asf/thirdparty/wireless/addons/boot/bootloader/cortexm0+/include/atsamr30.h
#define PORTC_PINCFG11_s    MMIO_REG(0x4000294b, struct __struct_PORTC_PINCFG11)
struct __struct_PORTC_PINCFG11
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTC_PINCFG12  MMIO_REG(0x4000294c, uint8_t)
#define PORTC_PINCFG12_PMUXEN (1 << 0)
#define PORTC_PINCFG12_INEN (1 << 1)
#define PORTC_PINCFG12_PULLEN (1 << 2)

#define PORTC_PINCFG12_s    MMIO_REG(0x4000294c, struct __struct_PORTC_PINCFG12)
struct __struct_PORTC_PINCFG12
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTC_PINCFG13  MMIO_REG(0x4000294d, uint8_t)
#define PORTC_PINCFG13_PMUXEN (1 << 0)
#define PORTC_PINCFG13_INEN (1 << 1)
#define PORTC_PINCFG13_PULLEN (1 << 2)

#define PORTC_PINCFG13_s    MMIO_REG(0x4000294d, struct __struct_PORTC_PINCFG13)
struct __struct_PORTC_PINCFG13
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTC_PINCFG14  MMIO_REG(0x4000294e, uint8_t)
#define PORTC_PINCFG14_PMUXEN (1 << 0)
#define PORTC_PINCFG14_INEN (1 << 1)
#define PORTC_PINCFG14_PULLEN (1 << 2)

#define PORTC_PINCFG14_s    MMIO_REG(0x4000294e, struct __struct_PORTC_PINCFG14)
struct __struct_PORTC_PINCFG14
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTC_PINCFG15  MMIO_REG(0x4000294f, uint8_t)
#define PORTC_PINCFG15_PMUXEN (1 << 0)
#define PORTC_PINCFG15_INEN (1 << 1)
#define PORTC_PINCFG15_PULLEN (1 << 2)

#define PORTC_PINCFG15_s    MMIO_REG(0x4000294f, struct __struct_PORTC_PINCFG15)
struct __struct_PORTC_PINCFG15
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTC_PINCFG16  MMIO_REG(0x40002950, uint8_t)
#define PORTC_PINCFG16_PMUXEN (1 << 0)
#define PORTC_PINCFG16_INEN (1 << 1)
#define PORTC_PINCFG16_PULLEN (1 << 2)

#define PORTC_PINCFG16_s    MMIO_REG(0x40002950, struct __struct_PORTC_PINCFG16)
struct __struct_PORTC_PINCFG16
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTC_PINCFG17  MMIO_REG(0x40002951, uint8_t)
#define PORTC_PINCFG17_PMUXEN (1 << 0)
#define PORTC_PINCFG17_INEN (1 << 1)
#define PORTC_PINCFG17_PULLEN (1 << 2)

#define PORTC_PINCFG17_s    MMIO_REG(0x40002951, struct __struct_PORTC_PINCFG17)
struct __struct_PORTC_PINCFG17
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTC_PINCFG18  MMIO_REG(0x40002952, uint8_t)
#define PORTC_PINCFG18_PMUXEN (1 << 0)
#define PORTC_PINCFG18_INEN (1 << 1)
#define PORTC_PINCFG18_PULLEN (1 << 2)

#define PORTC_PINCFG18_s    MMIO_REG(0x40002952, struct __struct_PORTC_PINCFG18)
struct __struct_PORTC_PINCFG18
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTC_PINCFG19  MMIO_REG(0x40002953, uint8_t)
#define PORTC_PINCFG19_PMUXEN (1 << 0)
#define PORTC_PINCFG19_INEN (1 << 1)
#define PORTC_PINCFG19_PULLEN (1 << 2)

#define PORTC_PINCFG19_s    MMIO_REG(0x40002953, struct __struct_PORTC_PINCFG19)
struct __struct_PORTC_PINCFG19
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTC_PINCFG20  MMIO_REG(0x40002954, uint8_t)
#define PORTC_PINCFG20_PMUXEN (1 << 0)
#define PORTC_PINCFG20_INEN (1 << 1)
#define PORTC_PINCFG20_PULLEN (1 << 2)

#define PORTC_PINCFG20_s    MMIO_REG(0x40002954, struct __struct_PORTC_PINCFG20)
struct __struct_PORTC_PINCFG20
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTC_PINCFG21  MMIO_REG(0x40002955, uint8_t)
#define PORTC_PINCFG21_PMUXEN (1 << 0)
#define PORTC_PINCFG21_INEN (1 << 1)
#define PORTC_PINCFG21_PULLEN (1 << 2)

#define PORTC_PINCFG21_s    MMIO_REG(0x40002955, struct __struct_PORTC_PINCFG21)
struct __struct_PORTC_PINCFG21
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTC_PINCFG22  MMIO_REG(0x40002956, uint8_t)
#define PORTC_PINCFG22_PMUXEN (1 << 0)
#define PORTC_PINCFG22_INEN (1 << 1)
#define PORTC_PINCFG22_PULLEN (1 << 2)

#define PORTC_PINCFG22_s    MMIO_REG(0x40002956, struct __struct_PORTC_PINCFG22)
struct __struct_PORTC_PINCFG22
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTC_PINCFG23  MMIO_REG(0x40002957, uint8_t)
#define PORTC_PINCFG23_PMUXEN (1 << 0)
#define PORTC_PINCFG23_INEN (1 << 1)
#define PORTC_PINCFG23_PULLEN (1 << 2)

#define PORTC_PINCFG23_s    MMIO_REG(0x40002957, struct __struct_PORTC_PINCFG23)
struct __struct_PORTC_PINCFG23
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTC_PINCFG24  MMIO_REG(0x40002958, uint8_t)
#define PORTC_PINCFG24_PMUXEN (1 << 0)
#define PORTC_PINCFG24_INEN (1 << 1)
#define PORTC_PINCFG24_PULLEN (1 << 2)

#define PORTC_PINCFG24_s    MMIO_REG(0x40002958, struct __struct_PORTC_PINCFG24)
struct __struct_PORTC_PINCFG24
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTC_PINCFG25  MMIO_REG(0x40002959, uint8_t)
#define PORTC_PINCFG25_PMUXEN (1 << 0)
#define PORTC_PINCFG25_INEN (1 << 1)
#define PORTC_PINCFG25_PULLEN (1 << 2)

#define PORTC_PINCFG25_s    MMIO_REG(0x40002959, struct __struct_PORTC_PINCFG25)
struct __struct_PORTC_PINCFG25
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTC_PINCFG26  MMIO_REG(0x4000295a, uint8_t)
#define PORTC_PINCFG26_PMUXEN (1 << 0)
#define PORTC_PINCFG26_INEN (1 << 1)
#define PORTC_PINCFG26_PULLEN (1 << 2)

#define PORTC_PINCFG26_s    MMIO_REG(0x4000295a, struct __struct_PORTC_PINCFG26)
struct __struct_PORTC_PINCFG26
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTC_PINCFG27  MMIO_REG(0x4000295b, uint8_t)
#define PORTC_PINCFG27_PMUXEN (1 << 0)
#define PORTC_PINCFG27_INEN (1 << 1)
#define PORTC_PINCFG27_PULLEN (1 << 2)

#define PORTC_PINCFG27_s    MMIO_REG(0x4000295b, struct __struct_PORTC_PINCFG27)
struct __struct_PORTC_PINCFG27
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTC_PINCFG28  MMIO_REG(0x4000295c, uint8_t)
#define PORTC_PINCFG28_PMUXEN (1 << 0)
#define PORTC_PINCFG28_INEN (1 << 1)
#define PORTC_PINCFG28_PULLEN (1 << 2)

#define PORTC_PINCFG28_s    MMIO_REG(0x4000295c, struct __struct_PORTC_PINCFG28)
struct __struct_PORTC_PINCFG28
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTC_PINCFG29  MMIO_REG(0x4000295d, uint8_t)
#define PORTC_PINCFG29_PMUXEN (1 << 0)
#define PORTC_PINCFG29_INEN (1 << 1)
#define PORTC_PINCFG29_PULLEN (1 << 2)

#define PORTC_PINCFG29_s    MMIO_REG(0x4000295d, struct __struct_PORTC_PINCFG29)
struct __struct_PORTC_PINCFG29
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTC_PINCFG30  MMIO_REG(0x4000295e, uint8_t)
#define PORTC_PINCFG30_PMUXEN (1 << 0)
#define PORTC_PINCFG30_INEN (1 << 1)
#define PORTC_PINCFG30_PULLEN (1 << 2)

#define PORTC_PINCFG30_s    MMIO_REG(0x4000295e, struct __struct_PORTC_PINCFG30)
struct __struct_PORTC_PINCFG30
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTC_PINCFG31  MMIO_REG(0x4000295f, uint8_t)
#define PORTC_PINCFG31_PMUXEN (1 << 0)
#define PORTC_PINCFG31_INEN (1 << 1)
#define PORTC_PINCFG31_PULLEN (1 << 2)

#define PORTC_PINCFG31_s    MMIO_REG(0x4000295f, struct __struct_PORTC_PINCFG31)
struct __struct_PORTC_PINCFG31
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};


// 0x42000000 SC0_SPI

#define SC0_SPI_CTRLA	MMIO_REG(0x42000000, uint32_t)
#define SC0_SPI_CTRLA_SWRST	(1 << 0)
#define SC0_SPI_CTRLA_ENABLE	(1 << 1)
#define SC0_SPI_CTRLA_MODE(x)	((x) << 2)
#define SC0_SPI_CTRLA_MODE_MSK	0x0000001c
#define SC0_SPI_CTRLA_MODE_VAL(x)	(((x) >> 2) & 0x7)
#define SC0_SPI_CTRLA_RUNSTDBY	(1 << 7)
#define SC0_SPI_CTRLA_DOPO(x) ((x) << 16)
#define SC0_SPI_CTRLA_DOPO_MSK  0x00030000
#define SC0_SPI_CTRLA_DOPO_VAL(x) (((x) >> 16) & 0x3)
#define SC0_SPI_CTRLA_DIPO(x)	((x) << 20)
#define SC0_SPI_CTRLA_DIPO_MSK	0x00300000
#define SC0_SPI_CTRLA_DIPO_VAL(x)	(((x) >> 20) & 0x3)
#define SC0_SPI_CTRLA_FORM(x)	((x) << 24)
#define SC0_SPI_CTRLA_FORM_MSK	0x0f000000
#define SC0_SPI_CTRLA_FORM_VAL(x)	(((x) >> 24) & 0xf)
#define SC0_SPI_CTRLA_CPHA	(1 << 28)
#define SC0_SPI_CTRLA_CPOL	(1 << 29)
#define SC0_SPI_CTRLA_DORD	(1 << 30)

#define SC0_SPI_CTRLA_s    MMIO_REG(0x42000000, struct __struct_SC0_SPI_CTRLA)
struct __struct_SC0_SPI_CTRLA
{
  uint32_t swrst : 1;
  uint32_t enable : 1;
  uint32_t mode : 3;
  uint32_t  : 2;
  uint32_t runstdby : 1;
  uint32_t ibon : 1;
  uint32_t  : 7;
  uint32_t dopo : 2;
  uint32_t  : 2;
  uint32_t dipo : 2;
  uint32_t  : 2;
  uint32_t form : 4;
  uint32_t cpha : 1;
  uint32_t cpol : 1;
  uint32_t dord : 1;
  uint32_t  : 1;
};

#define SC0_SPI_CTRLB	MMIO_REG(0x42000004, uint32_t)
#define SC0_SPI_CTRLB_CHSIZE(x)	((x) << 0)
#define SC0_SPI_CTRLB_CHSIZE_MSK	0x00000007
#define SC0_SPI_CTRLB_CHSIZE_VAL(x)	(((x) >> 0) & 0x7)
#define SC0_SPI_CTRLB_PLOADEN	(1 << 6)
#define SC0_SPI_CTRLB_AMODE(x)	((x) << 14)
#define SC0_SPI_CTRLB_AMODE_MSK	0x0000c000
#define SC0_SPI_CTRLB_AMODE_VAL(x)	(((x) >> 14) & 0x3)
#define SC0_SPI_CTRLB_RXEN	(1 << 17)

