cepawiel/OpenGDEMU/CPU/submodules/microchip-asf/thirdparty/wireless/addons/boot/bootloader/cortexm0+/include/atsamr30.h
#define SC0_SPI_CTRLB_s    MMIO_REG(0x42000004, struct __struct_SC0_SPI_CTRLB)
struct __struct_SC0_SPI_CTRLB
{
  uint32_t chsize : 3;
  uint32_t  : 3;
  uint32_t ploaden : 1;
  uint32_t  : 2;
  uint32_t ssde : 1;
  uint32_t  : 3;
  uint32_t mssen : 1;
  uint32_t amode : 2;
  uint32_t  : 1;
  uint32_t rxen : 1;
  uint32_t  : 14;
};

#define SC0_SPI_DBGCTRL	MMIO_REG(0x42000030, uint8_t)
#define SC0_SPI_DBGCTRL_DBGSTOP	(1 << 0)

#define SC0_SPI_DBGCTRL_s    MMIO_REG(0x42000030, struct __struct_SC0_SPI_DBGCTRL)
struct __struct_SC0_SPI_DBGCTRL
{
  uint8_t dbgstop : 1;
  uint8_t  : 7;
};

#define SC0_SPI_BAUD	MMIO_REG(0x4200000C, uint8_t)
#define SC0_SPI_BAUD_BAUD(x)	((x) << 0)
#define SC0_SPI_BAUD_BAUD_MSK	0x000000ff
#define SC0_SPI_BAUD_BAUD_VAL(x)	(((x) >> 0) & 0xff)

#define SC0_SPI_BAUD_s    MMIO_REG(0x4200000C, struct __struct_SC0_SPI_BAUD)
struct __struct_SC0_SPI_BAUD
{
  uint8_t baud : 8;
};

#define SC0_SPI_INTENCLR	MMIO_REG(0x42000014, uint8_t)
#define SC0_SPI_INTENCLR_DRE	(1 << 0)
#define SC0_SPI_INTENCLR_TXC	(1 << 1)
#define SC0_SPI_INTENCLR_RXC	(1 << 2)

#define SC0_SPI_INTENCLR_s    MMIO_REG(0x42000014, struct __struct_SC0_SPI_INTENCLR)
struct __struct_SC0_SPI_INTENCLR
{
  uint8_t dre : 1;
  uint8_t txc : 1;
  uint8_t rxc : 1;
  uint8_t ssl : 1;
  uint8_t  : 3;
  uint8_t error : 1;
};

#define SC0_SPI_INTENSET	MMIO_REG(0x42000016, uint8_t)
#define SC0_SPI_INTENSET_DRE	(1 << 0)
#define SC0_SPI_INTENSET_TXC	(1 << 1)
#define SC0_SPI_INTENSET_RXC	(1 << 2)

#define SC0_SPI_INTENSET_s    MMIO_REG(0x42000016, struct __struct_SC0_SPI_INTENSET)
struct __struct_SC0_SPI_INTENSET
{
  uint8_t dre : 1;
  uint8_t txc : 1;
  uint8_t rxc : 1;
  uint8_t ssl : 1;
  uint8_t  : 3;
  uint8_t error : 1;
};

#define SC0_SPI_INTFLAG	MMIO_REG(0x42000018, uint8_t)
#define SC0_SPI_INTFLAG_DRE	(1 << 0)
#define SC0_SPI_INTFLAG_TXC	(1 << 1)
#define SC0_SPI_INTFLAG_RXC	(1 << 2)

#define SC0_SPI_INTFLAG_s    MMIO_REG(0x42000018, struct __struct_SC0_SPI_INTFLAG)
struct __struct_SC0_SPI_INTFLAG
{
  uint8_t dre : 1;
  uint8_t txc : 1;
  uint8_t rxc : 1;
  uint8_t ssl : 1;
  uint8_t  : 3;
  uint8_t error : 1;
};

#define SC0_SPI_STATUS	MMIO_REG(0x4200001A, uint16_t)
#define SC0_SPI_STATUS_BUFOVF	(1 << 2)


#define SC0_SPI_STATUS_s    MMIO_REG(0x4200001A, struct __struct_SC0_SPI_STATUS)
struct __struct_SC0_SPI_STATUS
{
  uint16_t  : 2;
  uint16_t bufovf : 1;
  uint16_t  : 13;
};

#define SC0_SPI_SYNCBUSY  MMIO_REG(0x4200001C, uint32_t)
#define SC0_SPI_SYNCBUSY_SWRST (1 << 0)
#define SC0_SPI_SYNCBUSY_ENABLE (1 << 1)
#define SC0_SPI_SYNCBUSY_CTRLB (1 << 2)

#define SC0_SPI_SYNCBUSY_s    MMIO_REG(0x4200001C, struct __struct_SC0_SPI_STATUS)
struct __struct_SC0_SPI_SYNCBUSY
{
  uint32_t  swrst: 1;
  uint32_t enable : 1;
  uint32_t ctrlb : 1;
  uint32_t  : 29;
};

#define SC0_SPI_ADDR	MMIO_REG(0x42000024, uint32_t)
#define SC0_SPI_ADDR_ADDR(x)	((x) << 0)
#define SC0_SPI_ADDR_ADDR_MSK	0x000000ff
#define SC0_SPI_ADDR_ADDR_VAL(x)	(((x) >> 0) & 0xff)
#define SC0_SPI_ADDR_ADDRMASK(x)	((x) << 16)
#define SC0_SPI_ADDR_ADDRMASK_MSK	0x00ff0000
#define SC0_SPI_ADDR_ADDRMASK_VAL(x)	(((x) >> 16) & 0xff)

#define SC0_SPI_ADDR_s    MMIO_REG(0x42000024, struct __struct_SC0_SPI_ADDR)
struct __struct_SC0_SPI_ADDR
{
  uint32_t addr : 8;
  uint32_t  : 8;
  uint32_t addrmask : 8;
  uint32_t  : 8;
};

#define SC0_SPI_DATA	MMIO_REG(0x42000028, uint16_t)
#define SC0_SPI_DATA_DATA(x)	((x) << 0)
#define SC0_SPI_DATA_DATA_MSK	0x000001ff
#define SC0_SPI_DATA_DATA_VAL(x)	(((x) >> 0) & 0x1ff)

#define SC0_SPI_DATA_s    MMIO_REG(0x42000028, struct __struct_SC0_SPI_DATA)
struct __struct_SC0_SPI_DATA
{
  uint16_t data : 9;
  uint16_t  : 7;
};

// 0x42000400 SC1_USART

#define SC1_USART_CTRLA MMIO_REG(0x42000400, uint32_t)
#define SC1_USART_CTRLA_SWRST (1 << 0)
#define SC1_USART_CTRLA_ENABLE  (1 << 1)
#define SC1_USART_CTRLA_MODE(x) ((x) << 2)
#define SC1_USART_CTRLA_MODE_MSK  0x0000001c
#define SC1_USART_CTRLA_MODE_VAL(x) (((x) >> 2) & 0x7)
#define SC1_USART_CTRLA_RUNSTDBY  (1 << 7)
#define SC1_USART_CTRLA_TXPO  (1 << 16)
#define SC1_USART_CTRLA_RXPO(x) ((x) << 20)
#define SC1_USART_CTRLA_RXPO_MSK  0x00300000
#define SC1_USART_CTRLA_RXPO_VAL(x) (((x) >> 20) & 0x3)
#define SC1_USART_CTRLA_FORM(x) ((x) << 24)
#define SC1_USART_CTRLA_FORM_MSK  0x0f000000
#define SC1_USART_CTRLA_FORM_VAL(x) (((x) >> 24) & 0xf)
#define SC1_USART_CTRLA_CMODE (1 << 28)
#define SC1_USART_CTRLA_CPOL  (1 << 29)
#define SC1_USART_CTRLA_DORD  (1 << 30)

#define SC1_USART_CTRLA_s    MMIO_REG(0x42000400, struct __struct_SC1_USART_CTRLA)
struct __struct_SC1_USART_CTRLA
{
  uint32_t swrst : 1;
  uint32_t enable : 1;
  uint32_t mode : 3;
  uint32_t  : 2;
  uint32_t runstdby : 1;
  uint32_t ibon : 1;
  uint32_t  : 4;
  uint32_t sampr : 3;
  uint32_t txpo : 2;
  uint32_t  : 2;
  uint32_t rxpo : 2;
  uint32_t sampa : 2;
  uint32_t form : 4;
  uint32_t cmode : 1;
  uint32_t cpol : 1;
  uint32_t dord : 1;
  uint32_t  : 1;
};

#define SC1_USART_CTRLB MMIO_REG(0x42000404, uint32_t)
#define SC1_USART_CTRLB_CHSIZE(x) ((x) << 0)
#define SC1_USART_CTRLB_CHSIZE_MSK  0x00000007
#define SC1_USART_CTRLB_CHSIZE_VAL(x) (((x) >> 0) & 0x7)
#define SC1_USART_CTRLB_SBMODE  (1 << 6)
#define SC1_USART_CTRLB_PMODE (1 << 13)
#define SC1_USART_CTRLB_TXEN  (1 << 16)
#define SC1_USART_CTRLB_RXEN  (1 << 17)

#define SC1_USART_CTRLB_s    MMIO_REG(0x42000404, struct __struct_SC1_USART_CTRLB)
struct __struct_SC1_USART_CTRLB
{
  uint32_t chsize : 3;
  uint32_t  : 3;
  uint32_t sbmode : 1;
  uint32_t  : 1;
  uint32_t colden : 1;
  uint32_t sfde : 1;
  uint32_t enc : 1;
  uint32_t  : 2;
  uint32_t pmode : 1;
  uint32_t  : 2;
  uint32_t txen : 1;
  uint32_t rxen : 1;
  uint32_t  : 14;
};

#define SC1_USART_DBGCTRL MMIO_REG(0x42000430, uint8_t)
#define SC1_USART_DBGCTRL_DBGSTOP (1 << 0)

#define SC1_USART_DBGCTRL_s    MMIO_REG(0x42000430, struct __struct_SC1_USART_DBGCTRL)
struct __struct_SC1_USART_DBGCTRL
{
  uint8_t dbgstop : 1;
  uint8_t  : 7;
};

#define SC1_USART_BAUD  MMIO_REG(0x4200040c, uint16_t)
#define SC1_USART_BAUD_BAUD(x)  ((x) << 0)
#define SC1_USART_BAUD_BAUD_MSK 0x0000ffff
#define SC1_USART_BAUD_BAUD_VAL(x)  (((x) >> 0) & 0xffff)

#define SC1_USART_BAUD_s    MMIO_REG(0x4200040c, struct __struct_SC1_USART_BAUD)
struct __struct_SC1_USART_BAUD
{
  uint16_t baud : 16;
};

#define SC1_USART_INTENCLR  MMIO_REG(0x42000414, uint8_t)
#define SC1_USART_INTENCLR_DRE  (1 << 0)
#define SC1_USART_INTENCLR_TXC  (1 << 1)
#define SC1_USART_INTENCLR_RXC  (1 << 2)

