cepawiel/OpenGDEMU/CPU/submodules/microchip-asf/thirdparty/wireless/addons/boot/bootloader/cortexm0+/include/atsamr30.h
#define SC3_SPI_STATUS_s    MMIO_REG(0x4200141A, struct __struct_SC3_SPI_STATUS)
struct __struct_SC3_SPI_STATUS
{
	uint16_t  : 2;
	uint16_t bufovf : 1;
	uint16_t  : 13;
};

#define SC3_SPI_SYNCBUSY  MMIO_REG(0x4200141C, uint32_t)
#define SC3_SPI_SYNCBUSY_SWRST (1 << 0)
#define SC3_SPI_SYNCBUSY_ENABLE (1 << 1)
#define SC3_SPI_SYNCBUSY_CTRLB (1 << 2)

#define SC3_SPI_SYNCBUSY_s    MMIO_REG(0x4200141C, struct __struct_SC3_SPI_STATUS)
struct __struct_SC3_SPI_SYNCBUSY
{
	uint32_t  swrst: 1;
	uint32_t enable : 1;
	uint32_t ctrlb : 1;
	uint32_t  : 29;
};

#define SC3_SPI_ADDR	MMIO_REG(0x42001424, uint32_t)
#define SC3_SPI_ADDR_ADDR(x)	((x) << 0)
#define SC3_SPI_ADDR_ADDR_MSK	0x000000ff
#define SC3_SPI_ADDR_ADDR_VAL(x)	(((x) >> 0) & 0xff)
#define SC3_SPI_ADDR_ADDRMASK(x)	((x) << 16)
#define SC3_SPI_ADDR_ADDRMASK_MSK	0x00ff0000
#define SC3_SPI_ADDR_ADDRMASK_VAL(x)	(((x) >> 16) & 0xff)

#define SC3_SPI_ADDR_s    MMIO_REG(0x42001414, struct __struct_SC3_SPI_ADDR)
struct __struct_SC3_SPI_ADDR
{
	uint32_t addr : 8;
	uint32_t  : 8;
	uint32_t addrmask : 8;
	uint32_t  : 8;
};

#define SC3_SPI_DATA	MMIO_REG(0x42001428, uint16_t)
#define SC3_SPI_DATA_DATA(x)	((x) << 0)
#define SC3_SPI_DATA_DATA_MSK	0x000001ff
#define SC3_SPI_DATA_DATA_VAL(x)	(((x) >> 0) & 0x1ff)

#define SC3_SPI_DATA_s    MMIO_REG(0x42001428, struct __struct_SC3_SPI_DATA)
struct __struct_SC3_SPI_DATA
{
	uint16_t data : 9;
	uint16_t  : 7;
};

// 0x42001800 SC4_SPI

#define SC4_SPI_CTRLA	MMIO_REG(0x42001000, uint32_t)
#define SC4_SPI_CTRLA_SWRST	(1 << 0)
#define SC4_SPI_CTRLA_ENABLE	(1 << 1)
#define SC4_SPI_CTRLA_MODE(x)	((x) << 2)
#define SC4_SPI_CTRLA_MODE_MSK	0x0000001c
#define SC4_SPI_CTRLA_MODE_VAL(x)	(((x) >> 2) & 0x7)
#define SC4_SPI_CTRLA_RUNSTDBY	(1 << 7)
#define SC4_SPI_CTRLA_DOPO(x) ((x) << 16)
#define SC4_SPI_CTRLA_DOPO_MSK  0x00030000
#define SC4_SPI_CTRLA_DOPO_VAL(x) (((x) >> 16) & 0x3)
#define SC4_SPI_CTRLA_DIPO(x)	((x) << 20)
#define SC4_SPI_CTRLA_DIPO_MSK	0x00300000
#define SC4_SPI_CTRLA_DIPO_VAL(x)	(((x) >> 20) & 0x3)
#define SC4_SPI_CTRLA_FORM(x)	((x) << 24)
#define SC4_SPI_CTRLA_FORM_MSK	0x0f000000
#define SC4_SPI_CTRLA_FORM_VAL(x)	(((x) >> 24) & 0xf)
#define SC4_SPI_CTRLA_CPHA	(1 << 28)
#define SC4_SPI_CTRLA_CPOL	(1 << 29)
#define SC4_SPI_CTRLA_DORD	(1 << 30)

#define SC4_SPI_CTRLA_s    MMIO_REG(0x42001000, struct __struct_SC4_SPI_CTRLA)
struct __struct_SC4_SPI_CTRLA
{
  uint32_t swrst : 1;
  uint32_t enable : 1;
  uint32_t mode : 3;
  uint32_t  : 2;
  uint32_t runstdby : 1;
  uint32_t ibon : 1;
  uint32_t  : 7;
  uint32_t dopo : 2;
  uint32_t  : 2;
  uint32_t dipo : 2;
  uint32_t  : 2;
  uint32_t form : 4;
  uint32_t cpha : 1;
  uint32_t cpol : 1;
  uint32_t dord : 1;
  uint32_t  : 1;
};

#define SC4_SPI_CTRLB	MMIO_REG(0x42001004, uint32_t)
#define SC4_SPI_CTRLB_CHSIZE(x)	((x) << 0)
#define SC4_SPI_CTRLB_CHSIZE_MSK	0x00000007
#define SC4_SPI_CTRLB_CHSIZE_VAL(x)	(((x) >> 0) & 0x7)
#define SC4_SPI_CTRLB_PLOADEN	(1 << 6)
#define SC4_SPI_CTRLB_AMODE(x)	((x) << 14)
#define SC4_SPI_CTRLB_AMODE_MSK	0x0000c000
#define SC4_SPI_CTRLB_AMODE_VAL(x)	(((x) >> 14) & 0x3)
#define SC4_SPI_CTRLB_RXEN	(1 << 17)

#define SC4_SPI_CTRLB_s    MMIO_REG(0x42001004, struct __struct_SC4_SPI_CTRLB)
struct __struct_SC4_SPI_CTRLB
{
  uint32_t chsize : 3;
  uint32_t  : 3;
  uint32_t ploaden : 1;
  uint32_t  : 2;
  uint32_t ssde : 1;
  uint32_t  : 3;
  uint32_t mssen : 1;
  uint32_t amode : 2;
  uint32_t  : 1;
  uint32_t rxen : 1;
  uint32_t  : 14;
};

#define SC4_SPI_DBGCTRL	MMIO_REG(0x42001030, uint8_t)
#define SC4_SPI_DBGCTRL_DBGSTOP	(1 << 0)

#define SC4_SPI_DBGCTRL_s    MMIO_REG(0x42001030, struct __struct_SC4_SPI_DBGCTRL)
struct __struct_SC4_SPI_DBGCTRL
{
  uint8_t dbgstop : 1;
  uint8_t  : 7;
};

#define SC4_SPI_BAUD	MMIO_REG(0x4200100C, uint8_t)
#define SC4_SPI_BAUD_BAUD(x)	((x) << 0)
#define SC4_SPI_BAUD_BAUD_MSK	0x000000ff
#define SC4_SPI_BAUD_BAUD_VAL(x)	(((x) >> 0) & 0xff)

#define SC4_SPI_BAUD_s    MMIO_REG(0x4200100C, struct __struct_SC4_SPI_BAUD)
struct __struct_SC4_SPI_BAUD
{
  uint8_t baud : 8;
};

#define SC4_SPI_INTENCLR	MMIO_REG(0x42001014, uint8_t)
#define SC4_SPI_INTENCLR_DRE	(1 << 0)
#define SC4_SPI_INTENCLR_TXC	(1 << 1)
#define SC4_SPI_INTENCLR_RXC	(1 << 2)

#define SC4_SPI_INTENCLR_s    MMIO_REG(0x42001014, struct __struct_SC4_SPI_INTENCLR)
struct __struct_SC4_SPI_INTENCLR
{
  uint8_t dre : 1;
  uint8_t txc : 1;
  uint8_t rxc : 1;
  uint8_t ssl : 1;
  uint8_t  : 3;
  uint8_t error : 1;
};

#define SC4_SPI_INTENSET	MMIO_REG(0x42001016, uint8_t)
#define SC4_SPI_INTENSET_DRE	(1 << 0)
#define SC4_SPI_INTENSET_TXC	(1 << 1)
#define SC4_SPI_INTENSET_RXC	(1 << 2)

#define SC4_SPI_INTENSET_s    MMIO_REG(0x42001016, struct __struct_SC4_SPI_INTENSET)
struct __struct_SC4_SPI_INTENSET
{
  uint8_t dre : 1;
  uint8_t txc : 1;
  uint8_t rxc : 1;
  uint8_t ssl : 1;
  uint8_t  : 3;
  uint8_t error : 1;
};

#define SC4_SPI_INTFLAG	MMIO_REG(0x42001018, uint8_t)
#define SC4_SPI_INTFLAG_DRE	(1 << 0)
#define SC4_SPI_INTFLAG_TXC	(1 << 1)
#define SC4_SPI_INTFLAG_RXC	(1 << 2)

#define SC4_SPI_INTFLAG_s    MMIO_REG(0x42001018, struct __struct_SC4_SPI_INTFLAG)
struct __struct_SC4_SPI_INTFLAG
{
  uint8_t dre : 1;
  uint8_t txc : 1;
  uint8_t rxc : 1;
  uint8_t ssl : 1;
  uint8_t  : 3;
  uint8_t error : 1;
};

#define SC4_SPI_STATUS	MMIO_REG(0x4200101A, uint16_t)
#define SC4_SPI_STATUS_BUFOVF	(1 << 2)


#define SC4_SPI_STATUS_s    MMIO_REG(0x4200101A, struct __struct_SC4_SPI_STATUS)
struct __struct_SC4_SPI_STATUS
{
  uint16_t  : 2;
  uint16_t bufovf : 1;
  uint16_t  : 13;
};

#define SC4_SPI_SYNCBUSY  MMIO_REG(0x4200101C, uint32_t)
#define SC4_SPI_SYNCBUSY_SWRST (1 << 0)
#define SC4_SPI_SYNCBUSY_ENABLE (1 << 1)
#define SC4_SPI_SYNCBUSY_CTRLB (1 << 2)

#define SC4_SPI_SYNCBUSY_s    MMIO_REG(0x4200101C, struct __struct_SC4_SPI_STATUS)
struct __struct_SC4_SPI_SYNCBUSY
{
  uint32_t  swrst: 1;
  uint32_t enable : 1;
  uint32_t ctrlb : 1;
  uint32_t  : 29;
};

#define SC4_SPI_ADDR	MMIO_REG(0x42001024, uint32_t)
#define SC4_SPI_ADDR_ADDR(x)	((x) << 0)
#define SC4_SPI_ADDR_ADDR_MSK	0x000000ff
#define SC4_SPI_ADDR_ADDR_VAL(x)	(((x) >> 0) & 0xff)
#define SC4_SPI_ADDR_ADDRMASK(x)	((x) << 16)
#define SC4_SPI_ADDR_ADDRMASK_MSK	0x00ff0000
#define SC4_SPI_ADDR_ADDRMASK_VAL(x)	(((x) >> 16) & 0xff)

#define SC4_SPI_ADDR_s    MMIO_REG(0x42001014, struct __struct_SC4_SPI_ADDR)
struct __struct_SC4_SPI_ADDR
{
  uint32_t addr : 8;
  uint32_t  : 8;
  uint32_t addrmask : 8;
  uint32_t  : 8;
};

#define SC4_SPI_DATA	MMIO_REG(0x42001028, uint16_t)
#define SC4_SPI_DATA_DATA(x)	((x) << 0)
#define SC4_SPI_DATA_DATA_MSK	0x000001ff
#define SC4_SPI_DATA_DATA_VAL(x)	(((x) >> 0) & 0x1ff)

