cepawiel/OpenGDEMU/CPU/submodules/microchip-asf/thirdparty/wireless/addons/boot/bootloader/cortexm0+/include/atsamr30.h
#define TC3_16_COUNT_s    MMIO_REG(0x42002410, struct __struct_TC3_16_COUNT)
struct __struct_TC3_16_COUNT
{
  uint16_t count : 16;
};

#define TC3_16_CC0	MMIO_REG(0x42002418, uint16_t)
#define TC3_16_CC0_CC(x)	((x) << 0)
#define TC3_16_CC0_CC_MSK	0x0000ffff
#define TC3_16_CC0_CC_VAL(x)	(((x) >> 0) & 0xffff)

#define TC3_16_CC0_s    MMIO_REG(0x42002418, struct __struct_TC3_16_CC0)
struct __struct_TC3_16_CC0
{
  uint16_t cc : 16;
};

#define TC3_16_CC1	MMIO_REG(0x4200241a, uint16_t)
#define TC3_16_CC1_CC(x)	((x) << 0)
#define TC3_16_CC1_CC_MSK	0x0000ffff
#define TC3_16_CC1_CC_VAL(x)	(((x) >> 0) & 0xffff)

#define TC3_16_CC1_s    MMIO_REG(0x4200241a, struct __struct_TC3_16_CC1)
struct __struct_TC3_16_CC1
{
  uint16_t cc : 16;
};

// 0x40000C00 SYSCTRL

#define SYSCTRL_INTENCLR	MMIO_REG(0x40000C00, uint32_t)
#define SYSCTRL_INTENCLR_XOSCRDY	(1 << 0)
#define SYSCTRL_INTENCLR_XOSC32KRDY	(1 << 1)
#define SYSCTRL_INTENCLR_OSC32KRDY	(1 << 2)
#define SYSCTRL_INTENCLR_OSC8MRDY	(1 << 3)
#define SYSCTRL_INTENCLR_DFLLRDY	(1 << 4)
#define SYSCTRL_INTENCLR_DFLLOOB	(1 << 5)
#define SYSCTRL_INTENCLR_DFLLLCKF	(1 << 6)
#define SYSCTRL_INTENCLR_DFLLLCKC	(1 << 7)
#define SYSCTRL_INTENCLR_DFLLRCS	(1 << 8)
#define SYSCTRL_INTENCLR_BOD33RDY	(1 << 9)
#define SYSCTRL_INTENCLR_BOD33DET	(1 << 10)
#define SYSCTRL_INTENCLR_B33SRDY	(1 << 11)
#define SYSCTRL_INTENCLR_BOD12RDY	(1 << 12)
#define SYSCTRL_INTENCLR_BOD12DET	(1 << 13)
#define SYSCTRL_INTENCLR_B12SRDY	(1 << 14)

#define SYSCTRL_INTENCLR_s    MMIO_REG(0x40000C00, struct __struct_SYSCTRL_INTENCLR)
struct __struct_SYSCTRL_INTENCLR
{
  uint32_t xoscrdy : 1;
  uint32_t xosc32krdy : 1;
  uint32_t osc32krdy : 1;
  uint32_t osc8mrdy : 1;
  uint32_t dfllrdy : 1;
  uint32_t dflloob : 1;
  uint32_t dflllckf : 1;
  uint32_t dflllckc : 1;
  uint32_t dfllrcs : 1;
  uint32_t bod33rdy : 1;
  uint32_t bod33det : 1;
  uint32_t b33srdy : 1;
  uint32_t : 3;
  uint32_t dplllckr : 1;
  uint32_t dplllckf : 1;
  uint32_t dplllto : 1;
  uint32_t  : 14;
};

#define SYSCTRL_INTENSET	MMIO_REG(0x40000C04, uint32_t)
#define SYSCTRL_INTENSET_XOSCRDY	(1 << 0)
#define SYSCTRL_INTENSET_XOSC32KRDY	(1 << 1)
#define SYSCTRL_INTENSET_OSC32KRDY	(1 << 2)
#define SYSCTRL_INTENSET_OSC8MRDY	(1 << 3)
#define SYSCTRL_INTENSET_DFLLRDY	(1 << 4)
#define SYSCTRL_INTENSET_DFLLOOB	(1 << 5)
#define SYSCTRL_INTENSET_DFLLLCKF	(1 << 6)
#define SYSCTRL_INTENSET_DFLLLCKC	(1 << 7)
#define SYSCTRL_INTENSET_DFLLRCS	(1 << 8)
#define SYSCTRL_INTENSET_BOD33RDY	(1 << 9)
#define SYSCTRL_INTENSET_BOD33DET	(1 << 10)
#define SYSCTRL_INTENSET_B33SRDY	(1 << 11)
#define SYSCTRL_INTENSET_BOD12RDY	(1 << 12)
#define SYSCTRL_INTENSET_BOD12DET	(1 << 13)
#define SYSCTRL_INTENSET_B12SRDY	(1 << 14)

#define SYSCTRL_INTENSET_s    MMIO_REG(0x40000C04, struct __struct_SYSCTRL_INTENSET)
struct __struct_SYSCTRL_INTENSET
{
  uint32_t xoscrdy : 1;
  uint32_t xosc32krdy : 1;
  uint32_t osc32krdy : 1;
  uint32_t osc8mrdy : 1;
  uint32_t dfllrdy : 1;
  uint32_t dflloob : 1;
  uint32_t dflllckf : 1;
  uint32_t dflllckc : 1;
  uint32_t dfllrcs : 1;
  uint32_t bod33rdy : 1;
  uint32_t bod33det : 1;
  uint32_t b33srdy : 1;
  uint32_t : 3;
  uint32_t dplllckr : 1;
  uint32_t dplllckf : 1;
  uint32_t dplllto : 1;
  uint32_t  : 14;
};

#define SYSCTRL_INTFLAG	MMIO_REG(0x40000808, uint32_t)
#define SYSCTRL_INTFLAG_XOSCRDY	(1 << 0)
#define SYSCTRL_INTFLAG_XOSC32KRDY	(1 << 1)
#define SYSCTRL_INTFLAG_OSC32KRDY	(1 << 2)
#define SYSCTRL_INTFLAG_OSC8MRDY	(1 << 3)
#define SYSCTRL_INTFLAG_DFLLRDY	(1 << 4)
#define SYSCTRL_INTFLAG_DFLLOOB	(1 << 5)
#define SYSCTRL_INTFLAG_DFLLLCKF	(1 << 6)
#define SYSCTRL_INTFLAG_DFLLLCKC	(1 << 7)
#define SYSCTRL_INTFLAG_DFLLRCS	(1 << 8)
#define SYSCTRL_INTFLAG_BOD33RDY	(1 << 9)
#define SYSCTRL_INTFLAG_BOD33DET	(1 << 10)
#define SYSCTRL_INTFLAG_B33SRDY	(1 << 11)
#define SYSCTRL_INTFLAG_BOD12RDY	(1 << 12)
#define SYSCTRL_INTFLAG_BOD12DET	(1 << 13)
#define SYSCTRL_INTFLAG_B12SRDY	(1 << 14)

#define SYSCTRL_INTFLAG_s    MMIO_REG(0x40000C08, struct __struct_SYSCTRL_INTFLAG)
struct __struct_SYSCTRL_INTFLAG
{
  uint32_t xoscrdy : 1;
  uint32_t xosc32krdy : 1;
  uint32_t osc32krdy : 1;
  uint32_t osc8mrdy : 1;
  uint32_t dfllrdy : 1;
  uint32_t dflloob : 1;
  uint32_t dflllckf : 1;
  uint32_t dflllckc : 1;
  uint32_t dfllrcs : 1;
  uint32_t bod33rdy : 1;
  uint32_t bod33det : 1;
  uint32_t b33srdy : 1;
  uint32_t : 3;
  uint32_t dplllckr : 1;
  uint32_t dplllckf : 1;
  uint32_t dplllto : 1;
  uint32_t  : 14;
};

#define SYSCTRL_PCLKSR	MMIO_REG(0x40000C0c, uint32_t)
#define SYSCTRL_PCLKSR_XOSCRDY	(1 << 0)
#define SYSCTRL_PCLKSR_XOSC32KRDY	(1 << 1)
#define SYSCTRL_PCLKSR_OSC32KRDY	(1 << 2)
#define SYSCTRL_PCLKSR_OSC8MRDY	(1 << 3)
#define SYSCTRL_PCLKSR_DFLLRDY	(1 << 4)
#define SYSCTRL_PCLKSR_DFLLOOB	(1 << 5)
#define SYSCTRL_PCLKSR_DFLLLCKF	(1 << 6)
#define SYSCTRL_PCLKSR_DFLLLCKC	(1 << 7)
#define SYSCTRL_PCLKSR_DFLLRCS	(1 << 8)
#define SYSCTRL_PCLKSR_BOD33RDY	(1 << 9)
#define SYSCTRL_PCLKSR_BOD33DET	(1 << 10)
#define SYSCTRL_PCLKSR_B33SRDY	(1 << 11)
#define SYSCTRL_PCLKSR_BOD12RDY	(1 << 12)
#define SYSCTRL_PCLKSR_BOD12DET	(1 << 13)
#define SYSCTRL_PCLKSR_B12SRDY	(1 << 14)

#define SYSCTRL_PCLKSR_s    MMIO_REG(0x40000C0c, struct __struct_SYSCTRL_PCLKSR)
struct __struct_SYSCTRL_PCLKSR
{
  uint32_t xoscrdy : 1;
  uint32_t xosc32krdy : 1;
  uint32_t osc32krdy : 1;
  uint32_t osc8mrdy : 1;
  uint32_t dfllrdy : 1;
  uint32_t dflloob : 1;
  uint32_t dflllckf : 1;
  uint32_t dflllckc : 1;
  uint32_t dfllrcs : 1;
  uint32_t bod33rdy : 1;
  uint32_t bod33det : 1;
  uint32_t b33srdy : 1;
  uint32_t : 3;
  uint32_t dplllckr : 1;
  uint32_t dplllckf : 1;
  uint32_t dplllto : 1;
  uint32_t  : 14;
};

#define SYSCTRL_XOSC	MMIO_REG(0x40000C10, uint16_t)
#define SYSCTRL_XOSC_ENABLE	(1 << 1)
#define SYSCTRL_XOSC_XTALEN	(1 << 2)
#define SYSCTRL_XOSC_RUNSTDBY	(1 << 6)
#define SYSCTRL_XOSC_ONDEMAND	(1 << 7)
#define SYSCTRL_XOSC_GAIN(x)	((x) << 8)
#define SYSCTRL_XOSC_GAIN_MSK	0x00000700
#define SYSCTRL_XOSC_GAIN_VAL(x)	(((x) >> 8) & 0x7)
#define SYSCTRL_XOSC_AMPGC	(1 << 11)
#define SYSCTRL_XOSC_STARTUP(x)	((x) << 12)
#define SYSCTRL_XOSC_STARTUP_MSK	0x0000f000
#define SYSCTRL_XOSC_STARTUP_VAL(x)	(((x) >> 12) & 0xf)

#define SYSCTRL_XOSC_s    MMIO_REG(0x40000C10, struct __struct_SYSCTRL_XOSC)
struct __struct_SYSCTRL_XOSC
{
  uint16_t  : 1;
  uint16_t enable : 1;
  uint16_t xtalen : 1;
  uint16_t  : 3;
  uint16_t runstdby : 1;
  uint16_t ondemand : 1;
  uint16_t gain : 3;
  uint16_t ampgc : 1;
  uint16_t startup : 4;
};

#define SYSCTRL_XOSC32K	MMIO_REG(0x40000C14, uint16_t)
#define SYSCTRL_XOSC32K_ENABLE	(1 << 1)
#define SYSCTRL_XOSC32K_XTALEN	(1 << 2)
#define SYSCTRL_XOSC32K_EN32K	(1 << 3)
#define SYSCTRL_XOSC32K_EN1K	(1 << 4)
#define SYSCTRL_XOSC32K_AAMPEN	(1 << 5)
#define SYSCTRL_XOSC32K_RUNSTDBY	(1 << 6)
#define SYSCTRL_XOSC32K_ONDEMAND	(1 << 7)
#define SYSCTRL_XOSC32K_STARTUP(x)	((x) << 8)
#define SYSCTRL_XOSC32K_STARTUP_MSK	0x00000700
#define SYSCTRL_XOSC32K_STARTUP_VAL(x)	(((x) >> 8) & 0x7)
#define SYSCTRL_XOSC32K_WRTLOCK	(1 << 12)

