cepawiel/OpenGDEMU/CPU/submodules/microchip-asf/thirdparty/wireless/addons/boot/bootloader/cortexm0+/include/atsamr30.h
#define SYSCTRL_XOSC32K_s    MMIO_REG(0x40000C14, struct __struct_SYSCTRL_XOSC32K)
struct __struct_SYSCTRL_XOSC32K
{
  uint16_t  : 1;
  uint16_t enable : 1;
  uint16_t xtalen : 1;
  uint16_t en32k : 1;
  uint16_t en1k : 1;
  uint16_t aampen : 1;
  uint16_t runstdby : 1;
  uint16_t ondemand : 1;
  uint16_t startup : 3;
  uint16_t  : 1;
  uint16_t wrtlock : 1;
  uint16_t  : 3;
};

#define SYSCTRL_OSC32K	MMIO_REG(0x40000C18, uint32_t)
#define SYSCTRL_OSC32K_ENABLE	(1 << 1)
#define SYSCTRL_OSC32K_EN32K	(1 << 2)
#define SYSCTRL_OSC32K_EN1K	(1 << 3)
#define SYSCTRL_OSC32K_RUNSTDBY	(1 << 6)
#define SYSCTRL_OSC32K_ONDEMAND	(1 << 7)
#define SYSCTRL_OSC32K_STARTUP(x)	((x) << 8)
#define SYSCTRL_OSC32K_STARTUP_MSK	0x00000700
#define SYSCTRL_OSC32K_STARTUP_VAL(x)	(((x) >> 8) & 0x7)
#define SYSCTRL_OSC32K_WRTLOCK	(1 << 12)
#define SYSCTRL_OSC32K_CALIB(x)	((x) << 16)
#define SYSCTRL_OSC32K_CALIB_MSK	0x007f0000
#define SYSCTRL_OSC32K_CALIB_VAL(x)	(((x) >> 16) & 0x7f)

#define SYSCTRL_OSC32K_s    MMIO_REG(0x40000C18, struct __struct_SYSCTRL_OSC32K)
struct __struct_SYSCTRL_OSC32K
{
  uint32_t  : 1;
  uint32_t enable : 1;
  uint32_t en32k : 1;
  uint32_t en1k : 1;
  uint32_t  : 2;
  uint32_t runstdby : 1;
  uint32_t ondemand : 1;
  uint32_t startup : 3;
  uint32_t  : 1;
  uint32_t wrtlock : 1;
  uint32_t  : 3;
  uint32_t calib : 7;
  uint32_t  : 9;
};

#define SYSCTRL_OSCULP32K	MMIO_REG(0x40000C1c, uint8_t)
#define SYSCTRL_OSCULP32K_CALIB(x)	((x) << 0)
#define SYSCTRL_OSCULP32K_CALIB_MSK	0x0000001f
#define SYSCTRL_OSCULP32K_CALIB_VAL(x)	(((x) >> 0) & 0x1f)
#define SYSCTRL_OSCULP32K_WRTLOCK	(1 << 7)

#define SYSCTRL_OSCULP32K_s    MMIO_REG(0x40000C1c, struct __struct_SYSCTRL_OSCULP32K)
struct __struct_SYSCTRL_OSCULP32K
{
  uint8_t calib : 5;
  uint8_t  : 2;
  uint8_t wrtlock : 1;
};

#define SYSCTRL_OSC8M	MMIO_REG(0x40000C20, uint32_t)
#define SYSCTRL_OSC8M_ENABLE	(1 << 1)
#define SYSCTRL_OSC8M_RUNSTDBY	(1 << 6)
#define SYSCTRL_OSC8M_ONDEMAND	(1 << 7)
#define SYSCTRL_OSC8M_PRESC(x)	((x) << 8)
#define SYSCTRL_OSC8M_PRESC_MSK	0x00000300
#define SYSCTRL_OSC8M_PRESC_VAL(x)	(((x) >> 8) & 0x3)
#define SYSCTRL_OSC8M_CALIB(x)	((x) << 16)
#define SYSCTRL_OSC8M_CALIB_MSK	0x0fff0000
#define SYSCTRL_OSC8M_CALIB_VAL(x)	(((x) >> 16) & 0xfff)
#define SYSCTRL_OSC8M_FRANGE(x)	((x) << 30)
#define SYSCTRL_OSC8M_FRANGE_MSK	0xc0000000
#define SYSCTRL_OSC8M_FRANGE_VAL(x)	(((x) >> 30) & 0x3)

#define SYSCTRL_OSC8M_s    MMIO_REG(0x40000C20, struct __struct_SYSCTRL_OSC8M)
struct __struct_SYSCTRL_OSC8M
{
  uint32_t  : 1;
  uint32_t enable : 1;
  uint32_t  : 4;
  uint32_t runstdby : 1;
  uint32_t ondemand : 1;
  uint32_t presc : 2;
  uint32_t  : 6;
  uint32_t calib : 12;
  uint32_t  : 2;
  uint32_t frange : 2;
};

#define SYSCTRL_DFLLCTRL	MMIO_REG(0x40000C24, uint16_t)
#define SYSCTRL_DFLLCTRL_ENABLE	(1 << 1)
#define SYSCTRL_DFLLCTRL_MODE	(1 << 2)
#define SYSCTRL_DFLLCTRL_STABLE	(1 << 3)
#define SYSCTRL_DFLLCTRL_LLAW	(1 << 4)
#define SYSCTRL_DFLLCTRL_RUNSTDBY	(1 << 6)
#define SYSCTRL_DFLLCTRL_ONDEMAND	(1 << 7)
#define SYSCTRL_DFLLCTRL_CCDIS	(1 << 8)
#define SYSCTRL_DFLLCTRL_QLDIS	(1 << 9)

#define SYSCTRL_DFLLCTRL_s    MMIO_REG(0x40000C24, struct __struct_SYSCTRL_DFLLCTRL)
struct __struct_SYSCTRL_DFLLCTRL
{
  uint16_t  : 1;
  uint16_t enable : 1;
  uint16_t mode : 1;
  uint16_t stable : 1;
  uint16_t llaw : 1;
  uint16_t usbcrm : 1;
  uint16_t runstdby : 1;
  uint16_t ondemand : 1;
  uint16_t ccdis : 1;
  uint16_t qldis : 1;
  uint16_t bplckc : 1;
  uint16_t waitlock : 1;
  uint16_t  : 4;
};

#define SYSCTRL_DFLLVAL	MMIO_REG(0x40000C28, uint32_t)
#define SYSCTRL_DFLLVAL_FINE(x)	((x) << 0)
#define SYSCTRL_DFLLVAL_FINE_MSK	0x000000ff
#define SYSCTRL_DFLLVAL_FINE_VAL(x)	(((x) >> 0) & 0xff)
#define SYSCTRL_DFLLVAL_COARSE(x)	((x) << 8)
#define SYSCTRL_DFLLVAL_COARSE_MSK	0x00001f00
#define SYSCTRL_DFLLVAL_COARSE_VAL(x)	(((x) >> 8) & 0x1f)
#define SYSCTRL_DFLLVAL_DIFF(x)	((x) << 16)
#define SYSCTRL_DFLLVAL_DIFF_MSK	0xffff0000
#define SYSCTRL_DFLLVAL_DIFF_VAL(x)	(((x) >> 16) & 0xffff)

#define SYSCTRL_DFLLVAL_s    MMIO_REG(0x40000C28, struct __struct_SYSCTRL_DFLLVAL)
struct __struct_SYSCTRL_DFLLVAL
{
  uint32_t fine : 10;
  uint32_t coarse : 6;
  uint32_t diff : 16;
};

#define SYSCTRL_DFLLMUL	MMIO_REG(0x40000C2c, uint32_t)
#define SYSCTRL_DFLLMUL_MUL(x)	((x) << 0)
#define SYSCTRL_DFLLMUL_MUL_MSK	0x0000ffff
#define SYSCTRL_DFLLMUL_MUL_VAL(x)	(((x) >> 0) & 0xffff)
#define SYSCTRL_DFLLMUL_FSTEP(x)	((x) << 16)
#define SYSCTRL_DFLLMUL_FSTEP_MSK	0x00ff0000
#define SYSCTRL_DFLLMUL_FSTEP_VAL(x)	(((x) >> 16) & 0xff)
#define SYSCTRL_DFLLMUL_CSTEP(x)	((x) << 24)
#define SYSCTRL_DFLLMUL_CSTEP_MSK	0x1f000000
#define SYSCTRL_DFLLMUL_CSTEP_VAL(x)	(((x) >> 24) & 0x1f)

#define SYSCTRL_DFLLMUL_s    MMIO_REG(0x40000C2c, struct __struct_SYSCTRL_DFLLMUL)
struct __struct_SYSCTRL_DFLLMUL
{
  uint32_t mul : 16;
  uint32_t fstep : 10;
  uint32_t cstep : 6;
};

#define SYSCTRL_DFLLSYNC	MMIO_REG(0x40000C30, uint8_t)
#define SYSCTRL_DFLLSYNC_READREQ	(1 << 7)

#define SYSCTRL_DFLLSYNC_s    MMIO_REG(0x40000C30, struct __struct_SYSCTRL_DFLLSYNC)
struct __struct_SYSCTRL_DFLLSYNC
{
  uint8_t  : 7;
  uint8_t readreq : 1;
};

#define SYSCTRL_BOD33	MMIO_REG(0x40000C34, uint32_t)
#define SYSCTRL_BOD33_ENABLE	(1 << 1)
#define SYSCTRL_BOD33_HYST	(1 << 2)
#define SYSCTRL_BOD33_ACTION(x)	((x) << 3)
#define SYSCTRL_BOD33_ACTION_MSK	0x00000018
#define SYSCTRL_BOD33_ACTION_VAL(x)	(((x) >> 3) & 0x3)
#define SYSCTRL_BOD33_RUNSTDBY	(1 << 6)
#define SYSCTRL_BOD33_MODE	(1 << 8)
#define SYSCTRL_BOD33_CEN	(1 << 9)
#define SYSCTRL_BOD33_PSEL(x)	((x) << 12)
#define SYSCTRL_BOD33_PSEL_MSK	0x0000f000
#define SYSCTRL_BOD33_PSEL_VAL(x)	(((x) >> 12) & 0xf)
#define SYSCTRL_BOD33_LEVEL(x)	((x) << 16)
#define SYSCTRL_BOD33_LEVEL_MSK	0x001f0000
#define SYSCTRL_BOD33_LEVEL_VAL(x)	(((x) >> 16) & 0x1f)

#define SYSCTRL_BOD33_s    MMIO_REG(0x40000C34, struct __struct_SYSCTRL_BOD33)
struct __struct_SYSCTRL_BOD33
{
  uint32_t  : 1;
  uint32_t enable : 1;
  uint32_t hyst : 1;
  uint32_t action : 2;
  uint32_t  : 1;
  uint32_t runstdby : 1;
  uint32_t  : 1;
  uint32_t mode : 1;
  uint32_t cen : 1;
  uint32_t  : 2;
  uint32_t psel : 4;
  uint32_t level : 6;
  uint32_t  : 10;
};

