cepawiel/OpenGDEMU/CPU/submodules/microchip-asf/thirdparty/wireless/addons/boot/bootloader/cortexm0+/include/atsamr30.h
#define SYSCTRL_BOD12	MMIO_REG(0x40000C38, uint32_t)
#define SYSCTRL_BOD12_ENABLE	(1 << 1)
#define SYSCTRL_BOD12_HYST	(1 << 2)
#define SYSCTRL_BOD12_ACTION(x)	((x) << 3)
#define SYSCTRL_BOD12_ACTION_MSK	0x00000018
#define SYSCTRL_BOD12_ACTION_VAL(x)	(((x) >> 3) & 0x3)
#define SYSCTRL_BOD12_RUNSTDBY	(1 << 6)
#define SYSCTRL_BOD12_MODE	(1 << 8)
#define SYSCTRL_BOD12_CEN	(1 << 9)
#define SYSCTRL_BOD12_PSEL(x)	((x) << 12)
#define SYSCTRL_BOD12_PSEL_MSK	0x0000f000
#define SYSCTRL_BOD12_PSEL_VAL(x)	(((x) >> 12) & 0xf)
#define SYSCTRL_BOD12_LEVEL(x)	((x) << 16)
#define SYSCTRL_BOD12_LEVEL_MSK	0x001f0000
#define SYSCTRL_BOD12_LEVEL_VAL(x)	(((x) >> 16) & 0x1f)

#define SYSCTRL_BOD12_s    MMIO_REG(0x40000C38, struct __struct_SYSCTRL_BOD12)
struct __struct_SYSCTRL_BOD12
{
  uint32_t  : 1;
  uint32_t enable : 1;
  uint32_t hyst : 1;
  uint32_t action : 2;
  uint32_t  : 1;
  uint32_t runstdby : 1;
  uint32_t  : 1;
  uint32_t mode : 1;
  uint32_t cen : 1;
  uint32_t  : 2;
  uint32_t psel : 4;
  uint32_t level : 6;
  uint32_t  : 10;
};

#define SYSCTRL_VREG	MMIO_REG(0x40000C3c, uint16_t)
#define SYSCTRL_VREG_ENABLE	(1 << 1)
#define SYSCTRL_VREG_VDMON(x)	((x) << 4)
#define SYSCTRL_VREG_VDMON_MSK	0x00000030
#define SYSCTRL_VREG_VDMON_VAL(x)	(((x) >> 4) & 0x3)
#define SYSCTRL_VREG_RUNSTDBY	(1 << 6)
#define SYSCTRL_VREG_LEVEL(x)	((x) << 8)
#define SYSCTRL_VREG_LEVEL_MSK	0x00000700
#define SYSCTRL_VREG_LEVEL_VAL(x)	(((x) >> 8) & 0x7)
#define SYSCTRL_VREG_CALIB(x)	((x) << 12)
#define SYSCTRL_VREG_CALIB_MSK	0x00007000
#define SYSCTRL_VREG_CALIB_VAL(x)	(((x) >> 12) & 0x7)

#define SYSCTRL_VREG_s    MMIO_REG(0x40000C3c, struct __struct_SYSCTRL_VREG)
struct __struct_SYSCTRL_VREG
{
  uint16_t  : 1;
  uint16_t enable : 1;
  uint16_t  : 2;
  uint16_t vdmon : 2;
  uint16_t runstdby : 1;
  uint16_t  : 1;
  uint16_t level : 3;
  uint16_t  : 1;
  uint16_t calib : 3;
  uint16_t  : 1;
};

#define SYSCTRL_VREF	MMIO_REG(0x40000C40, uint32_t)
#define SYSCTRL_VREF_TSEN	(1 << 1)
#define SYSCTRL_VREF_BGOUTEN	(1 << 2)
#define SYSCTRL_VREF_CALIB(x)	((x) << 16)
#define SYSCTRL_VREF_CALIB_MSK	0x07ff0000
#define SYSCTRL_VREF_CALIB_VAL(x)	(((x) >> 16) & 0x7ff)

#define SYSCTRL_VREF_s    MMIO_REG(0x40000C40, struct __struct_SYSCTRL_VREF)
struct __struct_SYSCTRL_VREF
{
  uint32_t  : 1;
  uint32_t tsen : 1;
  uint32_t bgouten : 1;
  uint32_t  : 13;
  uint32_t calib : 11;
  uint32_t  : 5;
};
/*
// 0x40001800 GCLK

#define GCLK_CTRL	MMIO_REG(0x40001800, uint8_t)
#define GCLK_CTRL_SWRST	(1 << 0)

#define GCLK_CTRL_s    MMIO_REG(0x40001800, struct __struct_GCLK_CTRL)
struct __struct_GCLK_CTRL
{
  uint8_t swrst : 1;
  uint8_t  : 7;
};

#define GCLK_STATUS	MMIO_REG(0x40001801, uint8_t)
#define GCLK_STATUS_SYNCBUSY	(1 << 7)

#define GCLK_STATUS_s    MMIO_REG(0x40001801, struct __struct_GCLK_STATUS)
struct __struct_GCLK_STATUS
{
  uint8_t  : 7;
  uint8_t syncbusy : 1;
};

#define GCLK_CLKCTRL	MMIO_REG(0x40001802, uint16_t)
#define GCLK_CLKCTRL_ID(x)	((x) << 0)
#define GCLK_CLKCTRL_ID_MSK	0x0000003f
#define GCLK_CLKCTRL_ID_VAL(x)	(((x) >> 0) & 0x3f)
#define GCLK_CLKCTRL_GEN(x)	((x) << 8)
#define GCLK_CLKCTRL_GEN_MSK	0x00000f00
#define GCLK_CLKCTRL_GEN_VAL(x)	(((x) >> 8) & 0xf)
#define GCLK_CLKCTRL_CLKEN	(1 << 14)
#define GCLK_CLKCTRL_WRTLOCK	(1 << 15)

#define GCLK_CLKCTRL_s    MMIO_REG(0x40001802, struct __struct_GCLK_CLKCTRL)
struct __struct_GCLK_CLKCTRL
{
  uint16_t id : 6;
  uint16_t  : 2;
  uint16_t gen : 4;
  uint16_t  : 2;
  uint16_t clken : 1;
  uint16_t wrtlock : 1;
};

#define GCLK_GENCTRL	MMIO_REG(0x40001804, uint32_t)
#define GCLK_GENCTRL_ID(x)	((x) << 0)
#define GCLK_GENCTRL_ID_MSK	0x0000000f
#define GCLK_GENCTRL_ID_VAL(x)	(((x) >> 0) & 0xf)
#define GCLK_GENCTRL_SRC(x)	((x) << 8)
#define GCLK_GENCTRL_SRC_MSK	0x00001f00
#define GCLK_GENCTRL_SRC_VAL(x)	(((x) >> 8) & 0x1f)
#define GCLK_GENCTRL_GENEN	(1 << 16)
#define GCLK_GENCTRL_IDC	(1 << 17)
#define GCLK_GENCTRL_OOV	(1 << 18)
#define GCLK_GENCTRL_OE	(1 << 19)
#define GCLK_GENCTRL_DIVSEL	(1 << 20)
#define GCLK_GENCTRL_RUNSTDBY	(1 << 21)

#define GCLK_GENCTRL_s    MMIO_REG(0x40001804, struct __struct_GCLK_GENCTRL)
struct __struct_GCLK_GENCTRL
{
  uint32_t id : 4;
  uint32_t  : 4;
  uint32_t src : 5;
  uint32_t  : 3;
  uint32_t genen : 1;
  uint32_t idc : 1;
  uint32_t oov : 1;
  uint32_t oe : 1;
  uint32_t divsel : 1;
  uint32_t runstdby : 1;
  uint32_t  : 10;
};

#define GCLK_GENDIV	MMIO_REG(0x40001808, uint32_t)
#define GCLK_GENDIV_ID(x)	((x) << 0)
#define GCLK_GENDIV_ID_MSK	0x0000000f
#define GCLK_GENDIV_ID_VAL(x)	(((x) >> 0) & 0xf)
#define GCLK_GENDIV_DIV(x)	((x) << 8)
#define GCLK_GENDIV_DIV_MSK	0x00ffff00
#define GCLK_GENDIV_DIV_VAL(x)	(((x) >> 8) & 0xffff)

#define GCLK_GENDIV_s    MMIO_REG(0x40001808, struct __struct_GCLK_GENDIV)
struct __struct_GCLK_GENDIV
{
  uint32_t id : 4;
  uint32_t  : 4;
  uint32_t div : 16;
  uint32_t  : 8;
};
*/
// 0x40000000 PM

#define PM_CTRL	MMIO_REG(0x40000000, uint8_t)
#define PM_CTRL_CFDEN	(1 << 2)
#define PM_CTRL_BKUPCLK	(1 << 4)

#define PM_CTRL_s    MMIO_REG(0x40000000, struct __struct_PM_CTRL)
struct __struct_PM_CTRL
{
  uint8_t  : 2;
  uint8_t cfden : 1;
  uint8_t  : 1;
  uint8_t bkupclk : 1;
  uint8_t  : 3;
};

#define PM_SLEEP	MMIO_REG(0x40000001, uint8_t)
#define PM_SLEEP_IDLE(x)	((x) << 0)
#define PM_SLEEP_IDLE_MSK	0x00000003
#define PM_SLEEP_IDLE_VAL(x)	(((x) >> 0) & 0x3)

#define PM_SLEEP_s    MMIO_REG(0x40000001, struct __struct_PM_SLEEP)
struct __struct_PM_SLEEP
{
  uint8_t idle : 2;
  uint8_t  : 6;
};

#define PM_CPUSEL	MMIO_REG(0x40000008, uint8_t)
#define PM_CPUSEL_CPUDIV(x)	((x) << 0)
#define PM_CPUSEL_CPUDIV_MSK	0x00000007
#define PM_CPUSEL_CPUDIV_VAL(x)	(((x) >> 0) & 0x7)

#define PM_CPUSEL_s    MMIO_REG(0x40000008, struct __struct_PM_CPUSEL)
struct __struct_PM_CPUSEL
{
  uint8_t cpudiv : 3;
  uint8_t  : 5;
};

#define PM_APBASEL	MMIO_REG(0x40000009, uint8_t)
#define PM_APBASEL_APBADIV(x)	((x) << 0)
#define PM_APBASEL_APBADIV_MSK	0x00000007
#define PM_APBASEL_APBADIV_VAL(x)	(((x) >> 0) & 0x7)

#define PM_APBASEL_s    MMIO_REG(0x40000009, struct __struct_PM_APBASEL)
struct __struct_PM_APBASEL
{
  uint8_t apbadiv : 3;
  uint8_t  : 5;
};

#define PM_APBBSEL	MMIO_REG(0x4000000a, uint8_t)
#define PM_APBBSEL_APBBDIV(x)	((x) << 0)
#define PM_APBBSEL_APBBDIV_MSK	0x00000007
#define PM_APBBSEL_APBBDIV_VAL(x)	(((x) >> 0) & 0x7)

