cepawiel/OpenGDEMU/CPU/submodules/microchip-asf/thirdparty/wireless/addons/boot/bootloader/cortexm0+/include/atsamr30.h
#define PM_APBBSEL_s    MMIO_REG(0x4000000a, struct __struct_PM_APBBSEL)
struct __struct_PM_APBBSEL
{
  uint8_t apbbdiv : 3;
  uint8_t  : 5;
};

#define PM_APBCSEL	MMIO_REG(0x4000000b, uint8_t)
#define PM_APBCSEL_APBCDIV(x)	((x) << 0)
#define PM_APBCSEL_APBCDIV_MSK	0x00000007
#define PM_APBCSEL_APBCDIV_VAL(x)	(((x) >> 0) & 0x7)

#define PM_APBCSEL_s    MMIO_REG(0x4000000b, struct __struct_PM_APBCSEL)
struct __struct_PM_APBCSEL
{
  uint8_t apbcdiv : 3;
  uint8_t  : 5;
};

#define PM_AHBMASK	MMIO_REG(0x40000014, uint32_t)
#define PM_AHBMASK_HPB0	(1 << 0)
#define PM_AHBMASK_HPB1	(1 << 1)
#define PM_AHBMASK_HPB2	(1 << 2)
#define PM_AHBMASK_DSU	(1 << 3)
#define PM_AHBMASK_NVMCTRL	(1 << 4)

#define PM_AHBMASK_s    MMIO_REG(0x40000014, struct __struct_PM_AHBMASK)
struct __struct_PM_AHBMASK
{
  uint32_t hpb0 : 1;
  uint32_t hpb1 : 1;
  uint32_t hpb2 : 1;
  uint32_t dsu : 1;
  uint32_t nvmctrl : 1;
  uint32_t dmac : 1;
  uint32_t usb : 1;
  uint32_t  : 25;
};

#define PM_APBAMASK	MMIO_REG(0x40000018, uint32_t)
#define PM_APBAMASK_PAC0	(1 << 0)
#define PM_APBAMASK_PM	(1 << 1)
#define PM_APBAMASK_SYSCTRL	(1 << 2)
#define PM_APBAMASK_GCLK	(1 << 3)
#define PM_APBAMASK_WDT	(1 << 4)
#define PM_APBAMASK_RTC	(1 << 5)
#define PM_APBAMASK_EIC	(1 << 6)

#define PM_APBAMASK_s    MMIO_REG(0x40000018, struct __struct_PM_APBAMASK)
struct __struct_PM_APBAMASK
{
  uint32_t pac0 : 1;
  uint32_t pm : 1;
  uint32_t sysctrl : 1;
  uint32_t gclk : 1;
  uint32_t wdt : 1;
  uint32_t rtc : 1;
  uint32_t eic : 1;
  uint32_t  : 25;
};

#define PM_APBBMASK	MMIO_REG(0x4000001c, uint32_t)
#define PM_APBBMASK_PAC1	(1 << 0)
#define PM_APBBMASK_DSU	(1 << 1)
#define PM_APBBMASK_NVMCTRL	(1 << 2)
#define PM_APBBMASK_PORT	(1 << 3)

#define PM_APBBMASK_s    MMIO_REG(0x4000001c, struct __struct_PM_APBBMASK)
struct __struct_PM_APBBMASK
{
  uint32_t pac1 : 1;
  uint32_t dsu : 1;
  uint32_t nvmctrl : 1;
  uint32_t port : 1;
  uint32_t dmac : 1;
  uint32_t usb : 1;
  uint32_t hmatrix : 1;
  uint32_t  : 25;
};

#define PM_APBCMASK	MMIO_REG(0x40000020, uint32_t)
#define PM_APBCMASK_PAC2	(1 << 0)
#define PM_APBCMASK_EVSYS	(1 << 1)
#define PM_APBCMASK_SERCOM0	(1 << 2)
#define PM_APBCMASK_SERCOM1	(1 << 3)
#define PM_APBCMASK_SERCOM2	(1 << 4)
#define PM_APBCMASK_SERCOM3	(1 << 5)
#define PM_APBCMASK_SERCOM4	(1 << 6)
#define PM_APBCMASK_SERCOM5	(1 << 7)
#define PM_APBCMASK_TCC0	(1 << 8)
#define PM_APBCMASK_TCC1	(1 << 9)
#define PM_APBCMASK_TC2	(1 << 10)
#define PM_APBCMASK_TC3	(1 << 11)
#define PM_APBCMASK_TC4	(1 << 12)
#define PM_APBCMASK_TC5	(1 << 13)
#define PM_APBCMASK_TC6	(1 << 14)
#define PM_APBCMASK_TC7	(1 << 15)
#define PM_APBCMASK_ADC	(1 << 16)
#define PM_APBCMASK_AC	(1 << 17)
#define PM_APBCMASK_DAC	(1 << 18)
#define PM_APBCMASK_PTC	(1 << 19)

#define PM_APBCMASK_s    MMIO_REG(0x40000020, struct __struct_PM_APBCMASK)
struct __struct_PM_APBCMASK
{
  uint32_t sercom0 : 1;
  uint32_t sercom1 : 1;
  uint32_t sercom2 : 1;
  uint32_t sercom3 : 1;
  uint32_t sercom4 : 1;
  uint32_t tcc0 : 1;
  uint32_t tcc1 : 1;
  uint32_t tcc2 : 1;
  uint32_t tc0 : 1;
  uint32_t tc1 : 1;
  uint32_t tc2 : 1;
  uint32_t dac : 1;
  uint32_t aes : 1;
  uint32_t trng : 1;
  uint32_t  : 15;
};

#define PM_INTENCLR	MMIO_REG(0x40000034, uint8_t)
#define PM_INTENCLR_CKRDY	(1 << 0)
#define PM_INTENCLR_CFD	(1 << 1)

#define PM_INTENCLR_s    MMIO_REG(0x40000034, struct __struct_PM_INTENCLR)
struct __struct_PM_INTENCLR
{
  uint8_t ckrdy : 1;
  uint8_t cfd : 1;
  uint8_t  : 6;
};

#define PM_INTENSET	MMIO_REG(0x40000035, uint8_t)
#define PM_INTENSET_CKRDY	(1 << 0)
#define PM_INTENSET_CFD	(1 << 1)

#define PM_INTENSET_s    MMIO_REG(0x40000035, struct __struct_PM_INTENSET)
struct __struct_PM_INTENSET
{
  uint8_t ckrdy : 1;
  uint8_t cfd : 1;
  uint8_t  : 6;
};

#define PM_INTFLAG	MMIO_REG(0x40000036, uint8_t)
#define PM_INTFLAG_CKRDY	(1 << 0)
#define PM_INTFLAG_CFD	(1 << 1)

#define PM_INTFLAG_s    MMIO_REG(0x40000036, struct __struct_PM_INTFLAG)
struct __struct_PM_INTFLAG
{
  uint8_t ckrdy : 1;
  uint8_t cfd : 1;
  uint8_t  : 6;
};

#define PM_RCAUSE	MMIO_REG(0x40000038, uint8_t)
#define PM_RCAUSE_POR	(1 << 0)
#define PM_RCAUSE_BOD12	(1 << 1)
#define PM_RCAUSE_BOD33	(1 << 2)
#define PM_RCAUSE_EXT	(1 << 4)
#define PM_RCAUSE_WDT	(1 << 5)
#define PM_RCAUSE_SYST	(1 << 6)

#define PM_RCAUSE_s    MMIO_REG(0x40000038, struct __struct_PM_RCAUSE)
struct __struct_PM_RCAUSE
{
  uint8_t por : 1;
  uint8_t bod12 : 1;
  uint8_t bod33 : 1;
  uint8_t  : 1;
  uint8_t ext : 1;
  uint8_t wdt : 1;
  uint8_t syst : 1;
  uint8_t  : 1;
};

/* ************************************************************************** */
/**  BASE ADDRESS DEFINITIONS FOR SAMR21G18A */
/* ************************************************************************** */
/** \defgroup SAMR21G18A_base Peripheral Base Address Definitions */
/*@{*/

#if defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)
#define AC                            (0x43001000UL) /**< \brief (AC) APB Base Address */
#define ADC                           (0x43000C00UL) /**< \brief (ADC) APB Base Address */
#define CCL                           (0x43001C00UL) /**< \brief (CCL) APB Base Address */
#define DMAC                          (0x44000400UL) /**< \brief (DMAC) APB Base Address */
#define DSU                           (0x41002000UL) /**< \brief (DSU) APB Base Address */
#define EIC                           (0x40002400UL) /**< \brief (EIC) APB Base Address */
#define EVSYS                         (0x43000000UL) /**< \brief (EVSYS) APB Base Address */
#define GCLK                          (0x40001800UL) /**< \brief (GCLK) APB Base Address */
#define MCLK                          (0x40000400UL) /**< \brief (MCLK) APB Base Address */
#define MTB                           (0x41006000UL) /**< \brief (MTB) APB Base Address */
#define NVMCTRL                       (0x41004000UL) /**< \brief (NVMCTRL) APB Base Address */
#define NVMCTRL_CAL                   (0x00800000UL) /**< \brief (NVMCTRL) CAL Base Address */
#define NVMCTRL_LOCKBIT               (0x00802000UL) /**< \brief (NVMCTRL) LOCKBIT Base Address */
#define NVMCTRL_OTP1                  (0x00806000UL) /**< \brief (NVMCTRL) OTP1 Base Address */
#define NVMCTRL_OTP2                  (0x00806008UL) /**< \brief (NVMCTRL) OTP2 Base Address */
#define NVMCTRL_OTP3                  (0x00806010UL) /**< \brief (NVMCTRL) OTP3 Base Address */
#define NVMCTRL_OTP4                  (0x00806018UL) /**< \brief (NVMCTRL) OTP4 Base Address */
#define NVMCTRL_OTP5                  (0x00806020UL) /**< \brief (NVMCTRL) OTP5 Base Address */
#define NVMCTRL_TEMP_LOG              (0x00806030UL) /**< \brief (NVMCTRL) TEMP_LOG Base Address */
#define NVMCTRL_USER                  (0x00804000UL) /**< \brief (NVMCTRL) USER Base Address */
#define OSCCTRL                       (0x40000C00UL) /**< \brief (OSCCTRL) APB Base Address */
#define OSC32KCTRL                    (0x40001000UL) /**< \brief (OSC32KCTRL) APB Base Address */
#define PAC                           (0x44000000UL) /**< \brief (PAC) APB Base Address */
#define PM                            (0x40000000UL) /**< \brief (PM) APB Base Address */
#define PORT                          (0x40002800UL) /**< \brief (PORT) APB Base Address */
#define PORT_IOBUS                    (0x60000000UL) /**< \brief (PORT) IOBUS Base Address */
#define RSTC                          (0x40000800UL) /**< \brief (RSTC) APB Base Address */
#define RTC                           (0x40002000UL) /**< \brief (RTC) APB Base Address */
#define RFCTRL                        (0x42003C00UL) /**< \brief (RFCTRL) APB Base Address */
#define SERCOM0                       (0x42000000UL) /**< \brief (SERCOM0) APB Base Address */
#define SERCOM1                       (0x42000400UL) /**< \brief (SERCOM1) APB Base Address */
#define SERCOM2                       (0x42000800UL) /**< \brief (SERCOM2) APB Base Address */
#define SERCOM3                       (0x42000C00UL) /**< \brief (SERCOM3) APB Base Address */
#define SERCOM4                       (0x42001000UL) /**< \brief (SERCOM4) APB Base Address */
#define SERCOM5                       (0x43000400UL) /**< \brief (SERCOM5) APB Base Address */
#define SUPC                          (0x40001400UL) /**< \brief (SUPC) APB Base Address */
#define TAL                           (0x40002C00UL) /**< \brief (TAL) APB Base Address */
#define TC0                           (0x42002000UL) /**< \brief (TC0) APB Base Address */
#define TC1                           (0x42002400UL) /**< \brief (TC1) APB Base Address */
#define TC4                           (0x43000800UL) /**< \brief (TC4) APB Base Address */
#define TCC0                          (0x42001400UL) /**< \brief (TCC0) APB Base Address */
#define TCC1                          (0x42001800UL) /**< \brief (TCC1) APB Base Address */
#define TCC2                          (0x42001C00UL) /**< \brief (TCC2) APB Base Address */
#define USB                           (0x41000000UL) /**< \brief (USB) APB Base Address */
#define WDT                           (0x40001C00UL) /**< \brief (WDT) APB Base Address */
#else
#define AC                ((Ac       *)0x43001000UL) /**< \brief (AC) APB Base Address */
#define AC_INST_NUM       1                          /**< \brief (AC) Number of instances */
#define AC_INSTS          { AC }                     /**< \brief (AC) Instances List */

#define ADC               ((Adc      *)0x43000C00UL) /**< \brief (ADC) APB Base Address */
#define ADC_INST_NUM      1                          /**< \brief (ADC) Number of instances */
#define ADC_INSTS         { ADC }                    /**< \brief (ADC) Instances List */

#define CCL               ((Ccl      *)0x43001C00UL) /**< \brief (CCL) APB Base Address */
#define CCL_INST_NUM      1                          /**< \brief (CCL) Number of instances */
#define CCL_INSTS         { CCL }                    /**< \brief (CCL) Instances List */

#define DMAC              ((Dmac     *)0x44000400UL) /**< \brief (DMAC) APB Base Address */
#define DMAC_INST_NUM     1                          /**< \brief (DMAC) Number of instances */
#define DMAC_INSTS        { DMAC }                   /**< \brief (DMAC) Instances List */

